[
  {
    "category": "black",
    "imageUrl": "/images5/products/irish_breakfast.jpg",
    "description": "Our Irish Breakfast combines hearty black teas from Ceylon (Sri Lanka) and Assam (India) to get your morning off to a bright start. As its name implies, Irish Breakfast black tea blend is an ideal accompaniment to a morning meal. It seamlessly blends the citrusy notes of a high-grown Ceylon with the malty underscore of a pungent Assam. Spicy and jammy aroma on the leaf, malty and deep flavor with a brisk and 'buzzy' mouthfeel. Rounded sweetness in the finish. May be enjoyed plain or with a drop of milk. Irish Breakfast is one of Adagio's most popular teas.",
    "name": "irish breakfast",
    "score": 96,
    "thumbUrl": "/images5/products_index/irish_breakfast.jpg",
    "url": "/black/irish_breakfast.html",
    "steepInfo": "Steep at 212&deg; for 3-5 minutes."
  },
  {
    "category": "black",
    "imageUrl": "/images5/products/black_dragon_pearls.jpg",
    "description": "Black Dragon Pearls is a rare, hand-rolled variety of black tea with a smooth, rich and chocolatey taste. Hailing from the Yunnan province, this black tea version of the popular Dragon Pearl is comprised of only the highest quality leaves and buds, expertly rolled into a large pearl-like shape. Black Dragon Pearls are naturally sweet and smooth, with a touch of earthiness. Subtle cocoa notes whisper gently as each pearl unfurls, delivering a superior tea experience not to be missed. We suggest using 2-3 pearls per cup for the fullest flavor.",
    "name": "black dragon pearls",
    "score": 96,
    "thumbUrl": "/images5/products_index/black_dragon_pearls.jpg",
    "url": "/black/black_dragon_pearls.html",
    "steepInfo": "Steep at 212&deg; for 3-5 minutes."
  },
  {
    "category": "black",
    "imageUrl": "/images5/products/earl_grey_bravo.jpg",
    "description": "Earl Grey Bravo is a classic blend of artisan black tea from Sri Lanka, flavored with bergamot (a citrus fruit). The perfect afternoon tea: zesty and exhilarating fresh citrus aroma, slightly dry to the nose, with a rounded and balanced orange rind flavor to match the tang of the Ceylon black tea. Our Earl Grey Bravo benefits from a pleasantly dry finish with a lingering citrus sweetness.",
    "name": "earl grey bravo",
    "score": 95,
    "thumbUrl": "/images5/products_index/earl_grey_bravo.jpg",
    "url": "/black/earl_grey_bravo.html",
    "steepInfo": "Steep at 212&deg; for 2-3 minutes."
  },
  {
    "category": "black",
    "imageUrl": "/images5/products/golden_monkey.jpg",
    "description": "Golden Monkey or Jin Hou is a famous Chinese black tea whose leaves are said to resemble monkey paws. Golden Monkey originates from the Fujian province of China and is hand-processed each spring with careful plucking of only one leaf and one bud. This Golden Monkey is sweet and very \"nosy\": savory roasted apples, palm sugar, walnut, cocoa, rye and spice notes that linger as you sip. Rich, coating texture and very smooth, soft mouthfeel are both signs of a quality Jin Hou. This is a very complex black tea and can be enjoyed in multiple infusions, a real treat for black tea lovers.",
    "name": "golden monkey",
    "score": 95,
    "thumbUrl": "/images5/products_index/golden_monkey.jpg",
    "url": "/black/golden_monkey.html",
    "steepInfo": "Steep at 212&deg; for 3-5 minutes."
  },
  {
    "category": "black",
    "imageUrl": "/images5/products/earl_grey_moonlight.jpg",
    "description": "By popular demand, we have finally added an Earl Grey 'cream' blend. Comforting flavors of vanilla and cream combine to soften the citrus notes of traditional Earl Grey. Your taste buds will swoon at first sip of our Earl Grey Moonlight.",
    "name": "earl grey moonlight",
    "score": 94,
    "thumbUrl": "/images5/products_index/earl_grey_moonlight.jpg",
    "url": "/black/earl_grey_moonlight.html",
    "steepInfo": "Steep at 212&deg; for 3-5 minutes."
  },
  {
    "category": "black",
    "imageUrl": "/images5/products/yunnan_noir.jpg",
    "description": "Yunnan Noir is a black tea from the Yunnan province of China, the birthplace of tea itself. Much of the tea in this southern province is a large leaf variety. Mountains veiled in mist, with clean water and rich soil form ideal growing conditions and contribute to the unique flavor. Our Yunnan Noir is a hand-rolled tea, with leaves tightly curled into a 'black snail' shape. The aroma is sweet with hints of honey and spice. Savory and winey on the palate, with smooth, deep fruity astringency, tremendous depth of flavor, cinnamon bark and nutmeg in the finish. Terrifically textured cup of tea.",
    "name": "yunnan noir",
    "score": 95,
    "thumbUrl": "/images5/products_index/yunnan_noir.jpg",
    "url": "/black/yunnan_noir.html",
    "steepInfo": "Steep at 212&deg; for 3-5 minutes."
  },
  {
    "category": "black",
    "imageUrl": "/images5/products/ceylon_sonata.jpg",
    "description": "Ceylon Sonata is a classic black tea from Sri Lanka. In colonial times, this island nation was known as Ceylon. This name is still used to describe all teas grown here. Ceylon tea is bright and lively, medium-bodied and delightfully tangy.  Our Ceylon Sonata hails from the renowned Kenilworth Estate, located in Sri Lanka's Kandy region. Fresh, citrusy aroma, sweet juicy notes like mandarin peel or grapefruit, refreshing texture and balanced astringency. The perfect afternoon tea.",
    "name": "ceylon sonata",
    "score": 94,
    "thumbUrl": "/images5/products_index/ceylon_sonata.jpg",
    "url": "/black/ceylon_sonata.html",
    "steepInfo": "Steep at 212&deg; for 3-5 minutes."
  },
  {
    "category": "black",
    "imageUrl": "/images5/products/assam_melody.jpg",
    "description": "Bold black tea from the Assam region of India. Assam tea is known for a deep, burgundy-red cup and pungent flavor. Our Assam Melody is perfect for tea drinkers who may be new to the powerful character of Assam. Rich aroma, more sweet starchy than malty, like roasted plantains. Rounded mouthfeel, malty without being overpowering. Slight notes of raisin. Brisk astringency and not extremely pungent. A solid, 'friendly' Assam, from the well-regarded Meleng Estate.",
    "name": "assam melody",
    "score": 94,
    "thumbUrl": "/images5/products_index/assam_melody.jpg",
    "url": "/black/assam_melody.html",
    "steepInfo": "Steep at 212&deg; for 3-5 minutes."
  },
  {
    "category": "black",
    "imageUrl": "/images5/products/yunnan_jig.jpg",
    "description": "Yunnan Jig is a black tea from the Yunnan province of China, the birthplace of tea itself. Yunnan black tea is easily identified by its abundance of soft golden tips, and savory cocoa and black pepper flavors. It is a very forgiving tea; will not taste bitter when over-steeped. Our Yunnan Jig black tea has a sweet, almost creamy aroma. Rich and savory flavor, with a slight cocoa powder finish. Earthy and spicy and soft, smooth mouthfeel and finish. Classic Yunnan.",
    "name": "yunnan jig",
    "score": 95,
    "thumbUrl": "/images5/products_index/yunnan_jig.jpg",
    "url": "/black/yunnan_jig.html",
    "steepInfo": "Steep at 212&deg; for 3-5 minutes."
  },
  {
    "category": "black",
    "imageUrl": "/images5/products/assam_harmony.jpg",
    "description": "Bold, powerful black tea from the Assam region of India. A deep, burgundy-red cup and roasted grain aroma, malty rich flavor with notes of raisins. Pungent but smooth astringency, making this tea an ideal cup to pair with milk and sugar. This outstanding Assam comes from a favorite garden of ours, Mangalam Estate.",
    "name": "assam harmony",
    "score": 93,
    "thumbUrl": "/images5/products_index/assam_harmony.jpg",
    "url": "/black/assam_harmony.html",
    "steepInfo": "Steep at 212&deg; for 3-5 minutes."
  },
  {
    "category": "black",
    "imageUrl": "/images5/products/earl_grey_lavender.jpg",
    "description": "Our Earl Grey Lavender benefits from the addition of lavender flowers, which have a long history of medicinal, culinary and household use. For one, their sweet, floral fragrance is notably soothing, invoking relaxation. Combined with the classic blend of Earl Grey's citrus and a hint of cream, it is sure to become a quiet time favorite.",
    "name": "earl grey lavender",
    "score": 93,
    "thumbUrl": "/images5/products_index/earl_grey_lavender.jpg",
    "url": "/black/earl_grey_lavender.html",
    "steepInfo": "Steep at 212&deg; for 3-5 minutes."
  },
  {
    "category": "black",
    "imageUrl": "/images5/products/yunnan_gold.jpg",
    "description": "Yunnan Gold black tea (also known as Dian Hong) is easily identified by its abundance of soft golden tips, and savory cocoa and black pepper flavors. This artisan tea hails from the Yunnan province of China, the birthplace of tea itself.  Our high-grade Yunnan Gold is milk chocolate creamy and sweet, with pleasant pepper notes. The flavor becomes earthier and more layered as it cools. Soft, rounded cup, silky and perfect. It is also a very forgiving tea and will not taste bitter when over-steeped. Allowed to take only one tea to a desert island, this \"golden\" Yunnan would be our clear choice.",
    "name": "yunnan gold",
    "score": 95,
    "thumbUrl": "/images5/products_index/yunnan_gold.jpg",
    "url": "/black/yunnan_gold.html",
    "steepInfo": "Steep at 212&deg; for 3-5 minutes."
  },
  {
    "category": "black",
    "imageUrl": "",
    "description": "A chance to broaden your discovery with the very best of black teas. Each sample makes about 8-10 cups of tea. This set includes (though subject to infrequent change):<br><br><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>keemun encore<\/FONT> - Smoky, slightly malty and smooth, aromatic finish, and fiery amber cup.<BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>pu erh poe<\/FONT> - Freshly damp forest aroma, soft earthy flavor and faintly dark chocolate texture. <BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>fujian baroque<\/FONT> - Naturally sweet, velvety cocoa notes, deep fruitiness and glimmers of spice and softly mineral.<BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>yunnan gold<\/FONT> - Milk chocolate creamy and sweet, with pleasant pepper notes and earthy undertones. <BR><\/DIV>",
    "name": "emperor sampler",
    "score": 94,
    "thumbUrl": "/images5/products_index/black_savant_sampler.jpg",
    "url": "/black/black_savant_sampler.html",
    "steepInfo": ""
  },
  {
    "category": "black",
    "imageUrl": "/images5/products/lapsang_souchong.jpg",
    "description": "Lapsang Souchong is a black tea from the Fujian province of China, famous for its smoky aroma and flavor. To create this, the finished tea is given some extra drying over smoking pine fire, imparting a sweet, clean smoky flavor to the tea. Lapsang Souchong sometimes gets a bad rep for being brashly smoky, but really fine examples aren't like that at all. Our Lapsang Souchong is very approachable: clean and slightly cool smokiness in the aroma, like menthol. Sweet, refreshing smoky flavor, crisp and edgy. Golden-coppery color in the cup; the mark of a Lapsang that hasn't been smoked to a jerky. Sweet pine flavor, lightly evaporating finish. It's amazing all the dimensions of 'smoky' you can experience in one, very well made cup of fine Lapsang Souchong.",
    "name": "lapsang souchong",
    "score": 90,
    "thumbUrl": "/images5/products_index/lapsang_souchong.jpg",
    "url": "/black/lapsang_souchong.html",
    "steepInfo": "Steep at 212&deg; for 3-5 minutes."
  },
  {
    "category": "black",
    "imageUrl": "/images5/products/golden_spring.jpg",
    "description": "A delicate but surprising China black tea from Fujian province, harvested early in the spring. Downy golden curled buds are interspersed throughout this majestic tea, evoking visual color-play between gold and black. Richly sweet jam and carob aroma. Smooth, decadent and very savory texture, with notes of currants and roasted apples to lighten it up. Softly dry astringency very in balance with the satisfyingly smooth texture. A pure sensory delight to the palate.",
    "name": "golden spring",
    "score": 94,
    "thumbUrl": "/images5/products_index/golden_spring.jpg",
    "url": "/black/golden_spring.html",
    "steepInfo": "Steep at 212&deg; for 3-5 minutes."
  },
  {
    "category": "black",
    "imageUrl": "/images5/products/english_breakfast.jpg",
    "description": "English Breakfast is a full-bodied black tea blend that goes well with a traditional English breakfast. The original cup was made with black Keemun tea from Anhui province in China. Across many generations, plenty of different interpretations of this famous blend have been made. Our English Breakfast stays close to the classic. Made from top quality black Keemun tea, prized for its rich, slightly smoky flavor and perfectly 'on point' astringency. Balanced, very honeyed aroma. May be enjoyed plain or with a drop of milk. This fine example of English Breakfast remains one of Adagio's most popular varieties.",
    "name": "english breakfast",
    "score": 92,
    "thumbUrl": "/images5/products_index/english_breakfast.jpg",
    "url": "/black/english_breakfast.html",
    "steepInfo": "Steep at 212&deg; for 3-5 minutes."
  },
  {
    "category": "black",
    "imageUrl": "/images5/products/keemun_concerto.jpg",
    "description": "Black tea from the Anhui province of China. Perhaps the most famous of Chinese varieties, prized for its rich, toasty flavor, mineral flinty notes and smoky, almost incense aroma. Our Keemun Concerto steeps a beautiful, fiery amber red, with a smoky aroma and earthy, smooth flavor. Clean finish and very mellow.",
    "name": "keemun concerto",
    "score": 92,
    "thumbUrl": "/images5/products_index/keemun_concerto.jpg",
    "url": "/black/keemun_concerto.html",
    "steepInfo": "Steep at 212&deg; for 3-5 minutes."
  },
  {
    "category": "black",
    "imageUrl": "/images5/products/fujian_baroque.jpg",
    "description": "Fujian Baroque is a black tea from the Fujian province of China. Its general attributes are similar to the Golden Monkey, but the leaf is finer and the aroma even more pronounced. The exquisite tapestry of naturally sweet cocoa notes, fruitiness and glimmers of spice are unmatched by any other tea. Softly sweet and velvety, with leafy autumn notes and soft, mineral aftertaste. Fujian Baroque can be brewed light or strong; the taste will remain smooth with very delicate astringency.",
    "name": "fujian baroque",
    "score": 94,
    "thumbUrl": "/images5/products_index/fujian_baroque.jpg",
    "url": "/black/fujian_baroque.html",
    "steepInfo": "Steep at 212&deg; for 3-5 minutes."
  },
  {
    "category": "black",
    "imageUrl": "/images5/products/mambo.jpg",
    "description": "Mambo originated from the fusion of Cuban and American Jazz. Our Mambo blend is also a unique fusion of two similar, but quite different, styles: black teas from Yunnan and WuYi areas of China. Smoky, savory aroma, lingering notes of cocoa from the Yunnan, refreshing mineral finish from WuYi. Plush mouthfeel and succulent texture. The flavorful, rich body of our Mambo is guaranteed to jazz up your mornings and keep your feet tapping all day.",
    "name": "mambo",
    "score": 93,
    "thumbUrl": "/images5/products_index/mambo.jpg",
    "url": "/black/mambo.html",
    "steepInfo": "Steep at 212&deg; for 3-5 minutes."
  },
  {
    "category": "black",
    "imageUrl": "/images5/products/keemun_rhapsody.jpg",
    "description": "Black tea from the Anhui province of China. Perhaps the most famous of Chinese varieties, prized for its rich, toasty flavor, mineral flinty notes and smoky, sometimes incense aroma. Our Keemun Rhapsody is a complex showing of an excellent quality Keemun. Toasty, biscuity aroma with a browned apple sweetness. Earthy fruit flavor, notes of aromatic lychee fruit. Lingering perfumy smokiness long after the cup is finished.",
    "name": "keemun rhapsody",
    "score": 92,
    "thumbUrl": "/images5/products_index/keemun_rhapsody.jpg",
    "url": "/black/keemun_rhapsody.html",
    "steepInfo": "Steep at 212&deg; for 3-5 minutes."
  },
  {
    "category": "black",
    "imageUrl": "/images5/products/darjeeling_no22.jpg",
    "description": "Darjeeling Sungma Summer is a second flush black tea from the famous Darjeeling region of India. Darjeeling tea is treasured for its rich golden liquor and distinctive muscatel (a type of grape) flavor. This tea scores high on both counts. Bright and aromatic, floral muscat grape aroma with notes of warm spice and sugary squash. Plush, tangy mouthfeel with a sweet finish and balanced astringency. This excellent summer harvest (second flush) of Darjeeling black tea comes from the highly regarded Sungma Estate.",
    "name": "darjeeling sungma summer",
    "score": 94,
    "thumbUrl": "/images5/products_index/darjeeling_no22.jpg",
    "url": "/black/darjeeling_no22.html",
    "steepInfo": "Steep at 212&deg; for 3-5 minutes."
  },
  {
    "category": "black",
    "imageUrl": "/images5/products/rwanda_rukeri.jpg",
    "description": "Located in Central Eastern Africa, Rwanda offers high elevation, tropical highland climate and rich volcanic soil to support its thriving tea gardens.  Rwanda's abundance of natural attractions, such as volcanic mountains, deep lakes and wildlife preserves, make it an alluring destination for tourists.",
    "name": "rwanda rukeri",
    "score": 92,
    "thumbUrl": "/images5/products_index/rwanda_rukeri.jpg",
    "url": "/black/rwanda_rukeri.html",
    "steepInfo": "Steep at 212&deg; for 3-5 minutes."
  },
  {
    "category": "black",
    "imageUrl": "/images5/products/darjeeling_no2.jpg",
    "description": "Black tea from the famous Darjeeling region of India. This summer harvest tea comes to us from one of our favorites, Puttabong Estate. These tea gardens are some of the highest in the world, at 6000 feet above sea level. At these high altitudes, the tea leaves grow more slowly, and have more time to develop their unique Darjeeling flavor. This one has sweet, white grape or dessert wine fragrance, slightly earthy, and smooth, sweet-tangy flavor with a more gentle astringency than typical for these teas.",
    "name": "darjeeling puttabong summer",
    "score": 94,
    "thumbUrl": "/images5/products_index/darjeeling_no2.jpg",
    "url": "/black/darjeeling_no2.html",
    "steepInfo": "Steep at 212&deg; for 3-5 minutes."
  },
  {
    "category": "black",
    "imageUrl": "",
    "description": "A wonderful introduction to the wide range of Chinese black teas. Each sample makes about 8-10 cups of tea. This set includes (though subject to infrequent change):<br><br><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>english breakfast<\/FONT> - Slightly smoky flavor and balanced astringency, with a honeyed aroma. <BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>pu erh poe<\/FONT> - Freshly damp forest aroma, soft earthy flavor and faintly dark chocolate texture. <BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>yunnan noir<\/FONT> - Hand-rolled black tea from Yunnan, China, with leaves curled into a 'black snail' shape. Sweet aroma, hints of honey and spice. Savory and winey on the palate, smooth fruity astringency, cinnamon bark and nutmeg finish. Very textured cup of tea.<BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>yunnan jig<\/FONT> - Rich and savory flavor, earthy, spicy and soft, smooth cocoa mouthfeel and finish. <BR><\/DIV>",
    "name": "silk road sampler",
    "score": 94,
    "thumbUrl": "/images5/products_index/black_chinese_sampler.jpg",
    "url": "/black/black_chinese_sampler.html",
    "steepInfo": ""
  },
  {
    "category": "black",
    "imageUrl": "/images5/products/keemun_encore.jpg",
    "description": "A wonderful China black tea of the Hao Ya A grade, from Anhui province. Keemun, perhaps the most famous of Chinese black tea varieties, is prized for its rich flavor, fiery amber color liquor and toasty, sumptuous aroma. Smoky, slightly malty and smooth, aromatic finish. This year's version boasts lovely small leaves with the glint of golden tips. Fresh cocoa and baked bread aroma.",
    "name": "keemun encore",
    "score": 93,
    "thumbUrl": "/images5/products_index/keemun_encore.jpg",
    "url": "/black/keemun_encore.html",
    "steepInfo": "Steep at 212&deg; for 3-5 minutes."
  },
  {
    "category": "black",
    "imageUrl": "/images5/products/ceylon_waltz.jpg",
    "description": "'Ceylon Waltz' is another lively tea from the Vithanakande estate, also in the Dimbula region of Sri Lanka. Its leaves are marked by long silver lines. Another great tea for a lazy afternoon.",
    "name": "ceylon waltz",
    "score": 91,
    "thumbUrl": "/images5/products_index/ceylon_waltz.jpg",
    "url": "/black/ceylon_waltz.html",
    "steepInfo": "Steep at 212&deg; for 3-5 minutes."
  },
  {
    "category": "black",
    "imageUrl": "",
    "description": "A wonderful introduction to the wide range of Indian black teas. Each sample makes about 8-10 cups of tea. This set includes (though subject to infrequent change):<br><br><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>irish breakfast<\/FONT> - Seamless blend of bright, citrusy Ceylon with malty, pungent Assam. <BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>assam melody<\/FONT> - Rich, malty and sweet with hints of molasses and dates in the flavor. <BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>ceylon sonata<\/FONT> - Fresh, bright, citrusy aroma balanced with sweet juicy notes of mandarin peel or grapefruit.<BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>darjeeling sungma summer<\/FONT> - Aromatic and floral with white grape and sugary squash notes, plush with warm spice.<BR><\/DIV>",
    "name": "raja sampler",
    "score": 94,
    "thumbUrl": "/images5/products_index/black_sampler.jpg",
    "url": "/black/black_sampler.html",
    "steepInfo": ""
  },
  {
    "category": "black",
    "imageUrl": "/images5/products/brigadoon.jpg",
    "description": "Like the fictional Scottish town of Brigadoon, this special Leap Year tea only appears once every few years. Luckily, it's every four years instead of a hundred!<br><br>",
    "name": "brigadoon breakfast",
    "score": 0,
    "thumbUrl": "/images5/products_index/brigadoon.jpg",
    "url": "/black/brigadoon.html",
    "steepInfo": "Steep at 212&deg; for 3-5 minutes."
  },
  {
    "category": "pu erh",
    "imageUrl": "/images5/products/pu_erh_hazelberry.jpg",
    "description": "The earthy smoothness of Pu Erh creates a warm foundation for the rich flavor of hazelnut while playful, tangy-sweet strawberries peek through the nutty opulence. A hint of cream adds a soft, dreamy note to the blend.",
    "name": "pu erh hazelberry",
    "score": 94,
    "thumbUrl": "/images5/products_index/pu_erh_hazelberry.jpg",
    "url": "/pu_erh/pu_erh_hazelberry.html",
    "steepInfo": "Steep at 212&deg; for 5 minutes."
  },
  {
    "category": "pu erh",
    "imageUrl": "",
    "description": "A wonderful introduction to the wide range of pu erh teas. Each sample makes about 8-10 cups of tea. This set includes (though subject to infrequent change):<br><br><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>pu erh spice<\/FONT> - Perky spices and mellow pu erh in a soul soothing blend.<BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>pu erh tahiti<\/FONT> - Tropical flavors of coconut and papaya with pu erh for an exotic delight.<BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>pu erh hazelberry<\/FONT> - Pu Erh with rich hazelnut and playful strawberry with a hint of cream.<BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>pu erh chorange<\/FONT> - Rich chocolate and sweet orange with pu erh for a festive treat.<BR><\/DIV>",
    "name": "terra sampler",
    "score": 92,
    "thumbUrl": "/images5/products_index/pu_erh_sampler.jpg",
    "url": "/pu_erh/pu_erh_sampler.html",
    "steepInfo": ""
  },
  {
    "category": "pu erh",
    "imageUrl": "/images5/products/pu_erh_spice.jpg",
    "description": "Pleasantly perky spices add warmth and sweetness to the mellow mineral notes of Pu Erh. Sweet cinnamon and anise with tingly ginger liven up the palate while soothing the soul. A great companion for a chilly day.",
    "name": "pu erh spice",
    "score": 94,
    "thumbUrl": "/images5/products_index/pu_erh_spice.jpg",
    "url": "/pu_erh/pu_erh_spice.html",
    "steepInfo": "Steep at 212&deg; for 5 minutes."
  },
  {
    "category": "pu erh",
    "imageUrl": "/images5/products/pu_erh_dante.jpg",
    "description": "One of the five main types of tea (white, green, oolong and black being the others), pu'erh tea stands apart with its uncommonly soft earthy flavor and woodsy tones. Unlike all other teas, pu'erh (pronounced 'poo-err') is actually aged. The tea leaves go through a natural fermentation process before the tea is gently dried. This creates a cup with zero astringency and deep, rich body. Pu'erh is extraordinarily smooth and deeply refreshing. Our Pu'erh Dante (the shou variety of pu'erh) gives a clean, damp forest aroma, dried mushrooms, leather and earth. Some sweetness of figs or dates and a slight creamy flavor. Mellow and grounding. If the flavor is too strong for you, simply dilute with water (which, interestingly, doesn't work for many other teas!) Pu'erh is extremely versatile - you can steep it for as little as 30 second or 30 minutes, whatever pleases your palate. It won't get bitter and is great for multiple infusions.",
    "name": "pu erh dante",
    "score": 88,
    "thumbUrl": "/images5/products_index/pu_erh_dante.jpg",
    "url": "/pu_erh/pu_erh_dante.html",
    "steepInfo": "Steep at 212&deg; for 3-5 minutes."
  },
  {
    "category": "pu erh",
    "imageUrl": "/images5/products/pu_erh_chorange.jpg",
    "description": "Rich chocolate and sweet orange bring a confectionary note to the gentle earthiness of pu erh. Lively citrus lifts the blend while the warm chocolate and easygoing pu erh are grounding and smooth. Reminiscent of a favorite treat.",
    "name": "pu erh chorange",
    "score": 94,
    "thumbUrl": "/images5/products_index/pu_erh_chorange.jpg",
    "url": "/pu_erh/pu_erh_chorange.html",
    "steepInfo": "Steep at 212&deg; for 5 minutes."
  },
  {
    "category": "pu erh",
    "imageUrl": "/images5/products/pu_erh_tahiti.jpg",
    "description": "Decadent coconut, the fruity mystique of papaya and the soft earthiness of pu erh come together for an exotic experience not unlike a walk on the black sand beaches of its namesake. Tropical fruit notes and hints of mineral evoke thoughts of Pacific breezes and rainforest hikes.",
    "name": "pu erh tahiti",
    "score": 90,
    "thumbUrl": "/images5/products_index/pu_erh_tahiti.jpg",
    "url": "/pu_erh/pu_erh_tahiti.html",
    "steepInfo": "Steep at 212&deg; for 5 minutes."
  },
  {
    "category": "pu erh",
    "imageUrl": "/images5/products/pu_erh_poe.jpg",
    "description": "One of the five main types of tea (white, green, oolong and black being the others), pu'erh tea stands apart with its uncommonly soft earthy flavor and woodsy tones. Unlike all other teas, pu'erh (pronounced 'poo-err') is actually aged. The tea leaves go through a natural fermentation process before the tea is gently dried. This creates a cup with zero astringency and deep, rich body. Pu'erh is extraordinarily smooth and deeply refreshing. Our Pu'erh Poe (the shou variety of pu'erh) gives a clean, woodsy aroma, warm hay inside a barn, mushrooms and savory vegetables. Wilted flower notes and a faint dark chocolate texture. Mellow and grounding. If the flavor is too strong for you, simply dilute with water (which, interestingly, doesn't work for many other teas!) Pu'erh is extremely versatile - you can steep it for as little as 30 second or 30 minutes, whatever pleases your palate. It won't get bitter and is great for multiple infusions.",
    "name": "pu erh poe",
    "score": 88,
    "thumbUrl": "/images5/products_index/pu_erh_poe.jpg",
    "url": "/pu_erh/pu_erh_poe.html",
    "steepInfo": "Steep at 212&deg; for 3-5 minutes."
  },
  {
    "category": "pu erh",
    "imageUrl": "/images5/products/pu_erh_pearls.jpg",
    "description": "Generously sized for teapot brewing, this extra large pearl gives the term tea ball new meaning. Compressed fermented five year old shou style pu erh leaves are wonderfully earthy, smooth and comforting.  They take second infusions well as they slowly unfurl or pop one in your travel tumbler for a day of smooth, earthy sips.",
    "name": "pu erh pearls",
    "score": 0,
    "thumbUrl": "/images5/products_index/pu_erh_pearls.jpg",
    "url": "/pu_erh/pu_erh_pearls.html",
    "steepInfo": "Steep at 212&deg; for 5 minutes."
  },
  {
    "category": "flavors",
    "imageUrl": "/images5/products/peach.jpg",
    "description": "In the famous poem 'The Love Song of J. Alfred Prufrock', T.S. Eliot wrote, 'Do I dare to eat a peach?' The literary-minded folks at Adagio have taken it upon themselves to provide Mr. Eliot with an answer: why not just steep a cup of our bright Ceylon black tea flavored with sweet peaches? Delightful peach-nectar fragrance, lingering floral aromas as you sip, pleasant astringency and 'peach fuzz' dryness. Simply peachy...",
    "name": "peach",
    "score": 94,
    "thumbUrl": "/images5/products_index/peach.jpg",
    "url": "/flavors/peach.html",
    "steepInfo": "Steep at 212&deg; for 3 minutes."
  },
  {
    "category": "flavors",
    "imageUrl": "/images5/products/caramel.jpg",
    "description": "Depending on where you're from, you may either say 'car-a-mel' or 'CAR-mel.' Anyway you put it, though, our bright, tangy Ceylon black tea accented with rich notes of caramel flavoring (sugar free, by the way!) is sure to have you saying, 'wow! that's good!' Rich, dark caramel aroma, molasses notes. Dense and decadent cup, with a sweet, brown sugar aftertaste.",
    "name": "caramel",
    "score": 92,
    "thumbUrl": "/images5/products_index/caramel.jpg",
    "url": "/flavors/caramel.html",
    "steepInfo": "Steep at 212&deg; for 3 minutes."
  },
  {
    "category": "flavors",
    "imageUrl": "/images5/products/hazelnut.jpg",
    "description": "This flavor combines the full, bright taste of Ceylon black tea with the cozy creaminess of hazelnuts. Very nutty and aromatic, slightly roasty with a rounded, sweet flavor. Toasty dryness. A mellow, very well-blended cup of tea. Great with just a touch of brown sugar.",
    "name": "hazelnut",
    "score": 94,
    "thumbUrl": "/images5/products_index/hazelnut.jpg",
    "url": "/flavors/hazelnut.html",
    "steepInfo": "Steep at 212&deg; for 3 minutes."
  },
  {
    "category": "flavors",
    "imageUrl": "/images5/products/vanilla.jpg",
    "description": "According to the International Ice Cream Association, Vanilla is by far the most popular flavor, getting a full 23% of all ice cream consumption. Inspired by this love, Adagio created Vanilla Black Tea, combining the rich, warm, sugar aroma of vanilla with bright Ceylon black tea. Soothing, sweet and very 'beany' vanilla fragrance, like warm sugar cookies made with fresh vanilla beans.",
    "name": "vanilla",
    "score": 93,
    "thumbUrl": "/images5/products_index/vanilla.jpg",
    "url": "/flavors/vanilla.html",
    "steepInfo": "Steep at 212&deg; for 3 minutes."
  },
  {
    "category": "flavors",
    "imageUrl": "/images5/products/raspberry.jpg",
    "description": "A blend of crisp of Ceylon black tea from Sri Lanka with sweetly tart red raspberry flavor. Very candy-like aroma, delicately tangy and jammy raspberry flavor. Rounded texture, balanced astringency and sweet, slightly dry finish. This fun, juicy cup is tangy without getting too 'cheeky.'",
    "name": "raspberry",
    "score": 93,
    "thumbUrl": "/images5/products_index/raspberry.jpg",
    "url": "/flavors/raspberry.html",
    "steepInfo": "Steep at 212&deg; for 3 minutes."
  },
  {
    "category": "flavors",
    "imageUrl": "/images5/products/cream.jpg",
    "description": "Which comes first, the cream or the tea? If you're not sure, don't worry... neither are the English. However, its unanimously agreed that, whether you prefer your tea first, or cream first, this dairy-free cream flavored Ceylon black tea is a treat for your teacup! Sweet, inviting and warm, with a delicate creamy consistency and aroma of fresh black tea. Pleasantly brisk and very refreshing. Teatime calls...",
    "name": "cream",
    "score": 93,
    "thumbUrl": "/images5/products_index/cream.jpg",
    "url": "/flavors/cream.html",
    "steepInfo": "Steep at 212&deg; for 3 minutes."
  },
  {
    "category": "flavors",
    "imageUrl": "/images5/products/summer_rose.jpg",
    "description": "Our Summer Rose tea invokes the sweet lingering fragrance of late summer roses winding up a garden trellis. Mellow and deliciously floral, this rose tea is balanced with the bright briskness of a Ceylon black tea. Served hot or iced, it will bring to mind green lawns, porch swings and sunny warm days.",
    "name": "summer rose",
    "score": 93,
    "thumbUrl": "/images5/products_index/summer_rose.jpg",
    "url": "/flavors/summer_rose.html",
    "steepInfo": "Steep at 212&deg; for 3 minutes."
  },
  {
    "category": "flavors",
    "imageUrl": "/images5/products/ginger_peach.jpg",
    "description": "Ginger peach tea has become an American classic. Adagio's Ginger Peach Black has the soft warmth of ginger with the sweet depth of summer ripe peaches and apricots, paired beautifully with tangy, naturally citrusy Ceylon black tea. Enjoyable anytime of year as a hot tea, we find it to be particularly refreshing iced.",
    "name": "ginger peach",
    "score": 90,
    "thumbUrl": "/images5/products_index/ginger_peach.jpg",
    "url": "/flavors/ginger_peach.html",
    "steepInfo": "Steep at 212&deg; for 3 minutes."
  },
  {
    "category": "flavors",
    "imageUrl": "/images5/products/mango.jpg",
    "description": "Our bestselling Mango black tea blend combines the citrusy quality of fine Ceylon black tea with the flavor of perfectly ripened mangoes. Juicy texture, creamy-dry finish with great floral aromatics and candy sweetness.",
    "name": "mango",
    "score": 94,
    "thumbUrl": "/images5/products_index/mango.jpg",
    "url": "/flavors/mango.html",
    "steepInfo": "Steep at 212&deg; for 3 minutes."
  },
  {
    "category": "flavors",
    "imageUrl": "/images5/products/coconut.jpg",
    "description": "Few things can pull off sweet and savory quite like coconut. And few teas can play with other flavors quite as seamlessly as a classic Ceylon. In one cup, you'll get the dense, creamy texture of fresh coconut with the balanced brightness and tang of Ceylon black tea. This Coconut blend showcases a perfectly sweet, warm and aroma, as well as a soft finish. Such a well-blended flavor, it's like they never existed without each other.",
    "name": "coconut",
    "score": 93,
    "thumbUrl": "/images5/products_index/coconut.jpg",
    "url": "/flavors/coconut.html",
    "steepInfo": "Steep at 212&deg; for 3 minutes."
  },
  {
    "category": "flavors",
    "imageUrl": "/images5/products/passionfruit.jpg",
    "description": "Our Passionfruit black tea artfully combines the pleasantly sweet tropical flavor of a fresh passionfruit with the bright, lively taste of Ceylon black tea. Rich and heavy fruit-floral aroma. Sweet and very fruity flavor, lifted by the natural citrusy quality of Ceylon tea. Balanced astringency and slightly dry finish. All qualities that make this an excellent iced tea, too. So, if you're passionate about great flavored teas, look no further.",
    "name": "passionfruit",
    "score": 92,
    "thumbUrl": "/images5/products_index/passionfruit.jpg",
    "url": "/flavors/passionfruit.html",
    "steepInfo": "Steep at 212&deg; for 3 minutes."
  },
  {
    "category": "flavors",
    "imageUrl": "/images5/products/blueberry.jpg",
    "description": "A delightful blend of bright Ceylon black tea, fresh blueberry flavor and playfully accented with dried blueberries. An aromatic cup, definitely more like the 'highbush' variety of blueberry (highly fragrant and delicately tart). Fresh flavor, slightly sweet and rounded texture - not too juicy. Great hot or iced and easy to blend with other teas, too. Try it with Vanilla Black or Cream for added creamy texture.",
    "name": "blueberry",
    "score": 92,
    "thumbUrl": "/images5/products_index/blueberry.jpg",
    "url": "/flavors/blueberry.html",
    "steepInfo": "Steep at 212&deg; for 3 minutes."
  },
  {
    "category": "flavors",
    "imageUrl": "/images5/products/almond.jpg",
    "description": "The tangy, bright and perfectly balanced flavors of Ceylon black tea are a great canvas for many flavor expressions. The very best Ceylons blend easily with flavors giving them excellent depth and complexity. Take our Almond Black, for example. Touch of raw almond aroma, plush mouthfeel reminiscent of creamy marzipan, with nutty sweetness upfront and a balanced, clean astringency.",
    "name": "almond",
    "score": 92,
    "thumbUrl": "/images5/products_index/almond.jpg",
    "url": "/flavors/almond.html",
    "steepInfo": "Steep at 212&deg; for 3 minutes."
  },
  {
    "category": "flavors",
    "imageUrl": "/images5/products/strawberry.jpg",
    "description": "Strawberry black tea combines the succulent taste of sweet strawberries with bright Ceylon black tea. Fresh sweet-floral and berry flavor, smooth and sugary texture. It's a treat you'll want to keep for yourself!",
    "name": "strawberry",
    "score": 93,
    "thumbUrl": "/images5/products_index/strawberry.jpg",
    "url": "/flavors/strawberry.html",
    "steepInfo": "Steep at 212&deg; for 3 minutes."
  },
  {
    "category": "flavors",
    "imageUrl": "/images5/products/apricot.jpg",
    "description": "Imagine being whisked away to a perfumy, fresh apricot orchard... That's the sensation you'll get with your first sip of our delectable Apricot Black tea. Combining the sweet flavor of ripe summer apricots with the tangy bright taste of Ceylon black tea, you can experience it year-round. Soft, mellow mouthfeel, succulent flavor and balanced astringency.",
    "name": "apricot",
    "score": 94,
    "thumbUrl": "/images5/products_index/apricot.jpg",
    "url": "/flavors/apricot.html",
    "steepInfo": "Steep at 212&deg; for 3 minutes."
  },
  {
    "category": "flavors",
    "imageUrl": "/images5/products/blackberry.jpg",
    "description": "Looking to share something different with your tea friends? Surprise your friends by serving our refreshingly delicious Blackberry black tea. Bright, citrusy Ceylon black tea infused with sweetly tart blackberries is an adventure for your palate. Pleasantly sweet and bakey aroma, like fresh berry scones, floral-fruity aroma and slightly dry finish. Perfect hot or iced and an easy tea to blend with others, too.",
    "name": "blackberry",
    "score": 92,
    "thumbUrl": "/images5/products_index/blackberry.jpg",
    "url": "/flavors/blackberry.html",
    "steepInfo": "Steep at 212&deg; for 3 minutes."
  },
  {
    "category": "flavors",
    "imageUrl": "",
    "description": "A wonderful introduction to the wide range of flavored teas. Each sample makes about 8-10 cups of tea. This set includes (though subject to infrequent change):<br><br><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>coconut<\/FONT> - Creamy texture of fresh coconut flavor with the balanced brightness of Ceylon. Perfectly sweet and very well-blended.<BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>mango<\/FONT> - An Adagio favorite. Citrusy Ceylon black tea, lush mango flavor. Juicy texture and floral aroma, creamy-dry finish.<BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>passionfruit<\/FONT> - Tropical passionfruit with lively black tea. Rich, fruit-floral flavor, lifted by the natural citrus of Ceylon tea.<BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>peach<\/FONT> - Bright Ceylon tea flavored with lush peaches. Delightful nectar aroma, lingering floral flavor and \"peach fuzz\" dry.<BR><\/DIV>",
    "name": "tropical sampler",
    "score": 92,
    "thumbUrl": "/images5/products_index/flavors_tropical_sampler.jpg",
    "url": "/flavors/flavors_tropical_sampler.html",
    "steepInfo": ""
  },
  {
    "category": "flavors",
    "imageUrl": "/images5/products/valentines.jpg",
    "description": "Have you been looking for true love in a teacup? Then you're sure to fall 'head over heels' for our Valentine's tea. It deliciously combines the luxurious flavor of fresh-dipped chocolate-covered strawberries with the taste of premium Ceylon black tea. Selecting this for your Valentine? He or she is sure to welcome this sinfully-rich, yet calorie-free gift.",
    "name": "valentines",
    "score": 93,
    "thumbUrl": "/images5/products_index/valentines.jpg",
    "url": "/flavors/valentines.html",
    "steepInfo": "Steep at 212&deg; for 3 minutes."
  },
  {
    "category": "flavors",
    "imageUrl": "",
    "description": "A wonderful introduction to the wide range of flavored teas. Each sample makes about 8-10 cups of tea. This set includes (though subject to infrequent change):<br><br><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>hazelnut<\/FONT> - Ceylon tea with cozy, creamy hazelnuts. Aromatic, slightly roasty with a rounded, sweet flavor and toasty dryness.<BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>almond<\/FONT> - Plush mouthfeel, creamy marzipan notes, nutty sweet, balanced astringency.<BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>oriental spice<\/FONT> - A great introduction to spiced teas. Tangy Ceylon tea blended with fresh, herby-sweet spices. Balanced and warming.<BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>vanilla<\/FONT> - Bright Ceylon tea with pure vanilla. Soothing and cozy, like warm sugar cookies made with fresh vanilla beans.<BR><\/DIV>",
    "name": "nut & spice sampler",
    "score": 93,
    "thumbUrl": "/images5/products_index/flavors_nut_spice_sampler.jpg",
    "url": "/flavors/flavors_nut_spice_sampler.html",
    "steepInfo": ""
  },
  {
    "category": "flavors",
    "imageUrl": "",
    "description": "A wonderful introduction to the wide range of flavored teas. Each sample makes about 8-10 cups of tea. This set includes (though subject to infrequent change):<br><br><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>strawberry<\/FONT> - Fresh strawberry flavor and bright Ceylon black tea. Fresh sweet-floral and berry flavor, smooth and sugary texture.<BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>blueberry<\/FONT> - Ceylon black tea with fresh blueberry flavor. Highly aromatic, slightly sweet, rounded texture. Perfect hot or iced!<BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>raspberry<\/FONT> - Crisp black tea with playful raspberry flavor. Candy-like aroma, jammy flavor, tangy dry finish, not too 'cheeky.'<BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>forest berries<\/FONT> - Brisk Ceylon tea and savory summer berries create a cup with a comforting, sweet earthy aroma, deeply fruity flavor.<BR><\/DIV>",
    "name": "berries sampler",
    "score": 93,
    "thumbUrl": "/images5/products_index/flavors_sampler.jpg",
    "url": "/flavors/flavors_sampler.html",
    "steepInfo": ""
  },
  {
    "category": "flavors",
    "imageUrl": "/images5/products/grapefruit.jpg",
    "description": "A wake up call to the senses! Our Grapefruit tea is invigorating both in scent as well as taste. This blend of tangy, full Ceylon black tea and grapefruit is fantastic choice for a morning cup, or any time you need a citrus-infused pick-me-up.",
    "name": "grapefruit",
    "score": 92,
    "thumbUrl": "/images5/products_index/grapefruit.jpg",
    "url": "/flavors/grapefruit.html",
    "steepInfo": "Steep at 212&deg; for 3 minutes."
  },
  {
    "category": "flavors",
    "imageUrl": "/images5/products/tiger_eye.jpg",
    "description": "The gemstone Tiger Eye is described as being chatoyant - having a shimmery light reflecting quality with \"undulating, contrasting bands of color and luster.\" Our tiger eye blend will do the same for your palate with rich notes of chocolate and caramel. Enjoy it in lieu of or with your favorite indulgence.",
    "name": "tiger eye",
    "score": 93,
    "thumbUrl": "/images5/products_index/tiger_eye.jpg",
    "url": "/flavors/tiger_eye.html",
    "steepInfo": "Steep at 212&deg; for 3 minutes."
  },
  {
    "category": "flavors",
    "imageUrl": "/images5/products/forest_berries.jpg",
    "description": "Rescue experts say that if you ever get separated from your party while hiking through the woods, your best bet is to stay where you are. You probably shouldn't eat the berries you find there, either. But, as long as you've got a cup of Forest Berries Black tea, you'll have nothing to worry about. Brisk Ceylon black tea, savory ripe summer berries create a tea with a comforting, sweet earthy aroma and deeply fruity flavor and finish.",
    "name": "forest berries",
    "score": 91,
    "thumbUrl": "/images5/products_index/forest_berries.jpg",
    "url": "/flavors/forest_berries.html",
    "steepInfo": "Steep at 212&deg; for 3 minutes."
  },
  {
    "category": "flavors",
    "imageUrl": "/images5/products/oriental_spice.jpg",
    "description": "In Indian culture, 'Masala' means 'a blend of spices', and 'chai' simply means 'tea.' So, the celebrated Masala Chai is literally 'spiced tea.' If you're new to spiced tea, our warm and approachable Oriental Spice is a great place to start. Tangy and bright Ceylon black tea is blended with cinnamon, cardamom, ginger and orange rinds. Fresh and herby-sweet aromas, spicy flavor balanced with citrusy tea, pleasantly dry finish.",
    "name": "oriental spice",
    "score": 92,
    "thumbUrl": "/images5/products_index/oriental_spice.jpg",
    "url": "/flavors/oriental_spice.html",
    "steepInfo": "Steep at 212&deg; for 3 minutes."
  },
  {
    "category": "flavors",
    "imageUrl": "",
    "description": "A wonderful introduction to the wide range of flavored teas. Each sample makes about 8-10 cups of tea. This set includes (though subject to infrequent change):<br><br><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>peach<\/FONT> - Bright Ceylon tea flavored with lush peaches. Delightful nectar aroma, lingering floral flavor and \"peach fuzz\" dry.<BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>grapefruit<\/FONT> - A wake up call to the senses! Invigorating grapefruit flavor with tangy, citrusy Ceylon black tea.<BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>apricot<\/FONT> - Get whisked away to a fresh apricot orchard with our Ceylon black tea, flavored with ripe apricot. Mellow, soft cup.<BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>orange<\/FONT> - Brisk tea flavored with juicy oranges. Zesty orange rind dryness, hints of soft, sweet juice. Perfectly balanced cup.<BR><\/DIV>",
    "name": "orchard sampler",
    "score": 93,
    "thumbUrl": "/images5/products_index/flavors_orchard_sampler.jpg",
    "url": "/flavors/flavors_orchard_sampler.html",
    "steepInfo": ""
  },
  {
    "category": "flavors",
    "imageUrl": "/images5/products/cinnamon.jpg",
    "description": "In the Middle Ages, having cinnamon in one's home was a status symbol for Europe's elite. A combination of spicy cinnamon with bright, full Ceylon black tea, having our Cinnamon Black tea in your cabinet today is equally as prestigious. Very warm and high cinnamon flavor, with a clean, richly aromatic freshness. Spicy, crisp finish. Great blended with other teas, too!",
    "name": "cinnamon",
    "score": 92,
    "thumbUrl": "/images5/products_index/cinnamon.jpg",
    "url": "/flavors/cinnamon.html",
    "steepInfo": "Steep at 212&deg; for 3 minutes."
  },
  {
    "category": "flavors",
    "imageUrl": "/images5/products/chocolate_chip.jpg",
    "description": "Dark chocolate chips melt into the infusion of this Ceylon black tea to create the ultimate coupling of two taste bud tantalizers. Dense and soft chocolate flavor - seriously, for a second you think you're just eating a bag of cookies! Clean, slightly tangy finish brings you back to tea, and the balanced astringency compliments the dark chocolate nicely.",
    "name": "chocolate chip",
    "score": 91,
    "thumbUrl": "/images5/products_index/chocolate_chip.jpg",
    "url": "/flavors/chocolate_chip.html",
    "steepInfo": "Steep at 212&deg; for 3 minutes."
  },
  {
    "category": "flavors",
    "imageUrl": "/images5/products/ginger.jpg",
    "description": "In the West, ginger is a very popular ingredient in many seasonal desserts. In the East, it's celebrated as a digestive and palate cleanser. At Adagio Teas, ginger is renowned as one of our favorite teas, combining the fresh, warming heat of ginger with the rich tang of Ceylon black tea.",
    "name": "ginger",
    "score": 89,
    "thumbUrl": "/images5/products_index/ginger.jpg",
    "url": "/flavors/ginger.html",
    "steepInfo": "Steep at 212&deg; for 3 minutes."
  },
  {
    "category": "flavors",
    "imageUrl": "/images5/products/currant.jpg",
    "description": "A classic tea combination: full, tangy Ceylon black tea flavored with jammy, aromatic currants. Smooth, deeply fruity with a ripe juiciness and bright finish. Makes a warming, cozy cup in the winter and a refreshing, crisp iced tea when the summer sun is shining high.",
    "name": "currant",
    "score": 91,
    "thumbUrl": "/images5/products_index/currant.jpg",
    "url": "/flavors/currant.html",
    "steepInfo": "Steep at 212&deg; for 3 minutes."
  },
  {
    "category": "flavors",
    "imageUrl": "/images5/products/chocolate.jpg",
    "description": "While the greatest chocolates may come from Europe, the best chocolate tea undoubtedly comes from Adagio. Our Chocolate Black tea starts with the bright, full qualities of Ceylon black tea, infused with the flavor of rich dark chocolate. Very smooth, clean and liquid texture, much like a chocolate liquor, rather than cocoa powder. Decadent and divine.",
    "name": "chocolate",
    "score": 90,
    "thumbUrl": "/images5/products_index/chocolate.jpg",
    "url": "/flavors/chocolate.html",
    "steepInfo": "Steep at 212&deg; for 3 minutes."
  },
  {
    "category": "flavors",
    "imageUrl": "/images5/products/lemon_soleil.jpg",
    "description": "Lemon and tea seem made for each other. Adagio's Lemon Soleil tea combines the lively taste of bright and brisk Ceylon black tea with the tangy flavor of lemons. Fresh and sweet like Meyer lemons, with a crisp mouthfeel and clean, refreshing finish. This fresh version of this classic pairing will be sure to warm you up on a cold day or brighten your summer day iced!",
    "name": "lemon soleil",
    "score": 90,
    "thumbUrl": "/images5/products_index/lemon_soleil.jpg",
    "url": "/flavors/lemon_soleil.html",
    "steepInfo": "Steep at 212&deg; for 3 minutes."
  },
  {
    "category": "flavors",
    "imageUrl": "/images5/products/christmas.jpg",
    "description": "The tea to get you into the holiday spirit! This blend of bright, tangy Ceylon black tea flavored with warm cinnamon, pungent cloves, and orange peels is a Christmas delight. Spicy and fresh aroma, outdoorsy and cozy, with a balanced tangy flavor and slightly sweet finish. Perfect to sip while decking the halls, being jolly, or dreaming of a white Christmas.",
    "name": "christmas",
    "score": 92,
    "thumbUrl": "/images5/products_index/christmas.jpg",
    "url": "/flavors/christmas.html",
    "steepInfo": "Steep at 212&deg; for 3 minutes."
  },
  {
    "category": "flavors",
    "imageUrl": "/images5/products/orange.jpg",
    "description": "Lemons and black tea make such a natural pair, so why not try oranges? Our Orange Black tea combines fresh and brisk Ceylon black tea with the flavor of juicy, ripe Florida oranges, playfully accented with orange peel. Zesty orange rind dryness, with hints of soft, sweet orange juice (makes a great balance). Crisp and refreshing cup. Orange and tea, you make quite the pair!",
    "name": "orange",
    "score": 91,
    "thumbUrl": "/images5/products_index/orange.jpg",
    "url": "/flavors/orange.html",
    "steepInfo": "Steep at 212&deg; for 3 minutes."
  },
  {
    "category": "flavors",
    "imageUrl": "/images5/products/hibiscus.jpg",
    "description": "Hibiscus tea has been the preferred drink of many cultures, dating as far back as ancient Egypt. Pharaohs would refresh themselves from the Nile Valley heat by enjoying a sour-sweet cupful. Our delicious Hibiscus Black pairs this tangy flower with bright and brisk Ceylon tea. Layered, fruity-spicy aroma and flavor. Rich, tangy and punchy, great hot or iced!",
    "name": "hibiscus",
    "score": 91,
    "thumbUrl": "/images5/products_index/hibiscus.jpg",
    "url": "/flavors/hibiscus.html",
    "steepInfo": "Steep at 212&deg; for 3 minutes."
  },
  {
    "category": "flavors",
    "imageUrl": "/images5/products/cherry.jpg",
    "description": "This premium Ceylon tea flavored with summer cherries is treat for any Chekhov fans musing in their cherry orchard. Lovely candied cherry aroma, juicy flavor and slightly dry finish. If you've never read Chekhov, it doesn't have a happy ending. If you'd never tried our Cherry Black tea, it'll make up for it.",
    "name": "cherry",
    "score": 88,
    "thumbUrl": "/images5/products_index/cherry.jpg",
    "url": "/flavors/cherry.html",
    "steepInfo": "Steep at 212&deg; for 3 minutes."
  },
  {
    "category": "flavors",
    "imageUrl": "/images5/products/pomegranate.jpg",
    "description": "Pomegranate has historically been a symbol of fertility, marriage, abundance, as well as righteousness. We promise none of these things upon consumption, but trust you will enjoy this blend of bright Ceylon black tea from Sri Lanka, sweetly tart pomegranate flavor, and decorative raspberry pieces. Subtle fruit flavor, refreshingly crisp texture and airy, evaporating finish. Not an overly fruity cup, just beautifully accented.",
    "name": "pomegranate",
    "score": 90,
    "thumbUrl": "/images5/products_index/pomegranate.jpg",
    "url": "/flavors/pomegranate.html",
    "steepInfo": "Steep at 212&deg; for 3 minutes."
  },
  {
    "category": "chai",
    "imageUrl": "/images5/products/masala_chai.jpg",
    "description": "Our Masala Chai tea blend combines premium Ceylon black tea with warming cinnamon, cardamom and ginger. In Indian culture, 'Masala' means 'a blend of spices', and 'chai' simply means 'tea.' So, Masala Chai is literally 'spiced tea'. Our interpretation tries to stay true to its definition thanks to a warm and inviting fragrance, zesty flavor (without being too hot or spicy) and invigorating, aromatic finish. We suggest two heaping teaspoons per 8 oz cup. Sugar, cream or soy milk if desired.",
    "name": "masala chai",
    "score": 95,
    "thumbUrl": "/images5/products_index/masala_chai.jpg",
    "url": "/chai/masala_chai.html",
    "steepInfo": "Steep at 212&deg; for 7-10 minutes."
  },
  {
    "category": "chai",
    "imageUrl": "/images5/products/rooibos_vanilla_chai.jpg",
    "description": "Masala chai spices in a South African rooibos herb base, with a hint of vanilla. This blend of rooibos vanilla, ginger, cardamom, cloves, and cinnamon pieces will dance on your palate and sing to your soul. Beautiful clear and bright cup, with a crisp and tangy-sweet flavor. The heat of the spices is balanced beautifully with the natural smooth, mellow quality of the rooibos. Naturally caffeine free for an anytime treat. We suggest two heaping teaspoons per 6 oz cup. Sugar, cream or soy if desired.",
    "name": "rooibos vanilla chai",
    "score": 95,
    "thumbUrl": "/images5/products_index/rooibos_vanilla_chai.jpg",
    "url": "/chai/rooibos_vanilla_chai.html",
    "steepInfo": "Steep at 212&deg; for 7-10 minutes."
  },
  {
    "category": "chai",
    "imageUrl": "",
    "description": "A wonderful introduction to the wide range of chai teas. Each sample makes about 8-10 cups of tea. This set includes (though subject to infrequent change):<br><br><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>thai chai<\/FONT> - Creamy coconut and playfully floral lemongrass highlight this succulent chai blend. <BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>masala chai<\/FONT> - Warm and inviting fragrance, zesty flavor (without being too hot or spicy) and invigorating, aromatic finish.<BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>chocolate chai<\/FONT> - Exotic Masala Chai flavors from India paired with dark chocolate. Soothing cocoa, zesty warmth, seamless texture.<BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>rooibos vanilla chai<\/FONT> - Masala Chai spices in an herbal rooibos vanilla base. Beautiful clear and bright cup, and crisp, tangy-sweet flavor.<BR><\/DIV>",
    "name": "chai sampler",
    "score": 94,
    "thumbUrl": "/images5/products_index/chai_sampler.jpg",
    "url": "/chai/chai_sampler.html",
    "steepInfo": ""
  },
  {
    "category": "chai",
    "imageUrl": "/images5/products/thai_chai.jpg",
    "description": "Creamy sweet coconut and playfully floral lemongrass highlight this succulent black tea chai blend. Let the aroma draw you in and you'll swear, you hear it beckoning to come closer, just take a sip. We suggest two heaping teaspoons per 8 oz cup, sugar, cream or coconut milk if desired.",
    "name": "thai chai",
    "score": 94,
    "thumbUrl": "/images5/products_index/thai_chai.jpg",
    "url": "/chai/thai_chai.html",
    "steepInfo": "Steep at 212&deg; for 5 minutes."
  },
  {
    "category": "chai",
    "imageUrl": "/images5/products/spiced_apple_chai.jpg",
    "description": "Our Spiced Apple Chai features the timeless, comforting combination of apples and spice. A lively blend of black tea, classic spices from Indian Masala Chai and bright notes of crisp apple. Juicy and pleasantly sweet, like warm applesauce, with a clean, refreshing texture. A delight for the senses. We suggest two heaping teaspoons per 8 oz cup. Sugar, cream or soy if desired.",
    "name": "spiced apple chai",
    "score": 94,
    "thumbUrl": "/images5/products_index/spiced_apple_chai.jpg",
    "url": "/chai/spiced_apple_chai.html",
    "steepInfo": "Steep at 212&deg; for 5 minutes."
  },
  {
    "category": "chai",
    "imageUrl": "/images5/products/chocolate_chai.jpg",
    "description": "We've taken one of the world's favorite indulgences - chocolate - and combined it with the exotic flavors and spices of Masala Chai to create the ultimate treat. Chocolate flavored Ceylon black tea blended with cardamom, ginger, cloves, cinnamon. Soothing spicy cocoa notes, zesty, warming quality and soft liquid chocolate texture. Very seamless combination. Make it extra rich by preparing with freshly-warmed milk.",
    "name": "chocolate chai",
    "score": 92,
    "thumbUrl": "/images5/products_index/chocolate_chai.jpg",
    "url": "/chai/chocolate_chai.html",
    "steepInfo": "Steep at 212&deg; for 3 minutes."
  },
  {
    "category": "chai",
    "imageUrl": "/images5/products/green_chai.jpg",
    "description": "Our smooth China green tea with a chakra warming spice combination. Cardamom, clove and ginger aromas, clean and refreshing flavor, soothing finish with a balanced astringency. The natural sweetness and fiery kick will bring you back to center, no matter how polarized you've become. OMMmmmmm... We suggest two heaping teaspoons per 8 oz cup. Sugar, cream or soy if desired.",
    "name": "green chai",
    "score": 93,
    "thumbUrl": "/images5/products_index/green_chai.jpg",
    "url": "/chai/green_chai.html",
    "steepInfo": "Steep at 180&deg; for 3 minutes."
  },
  {
    "category": "chai",
    "imageUrl": "/images5/products/white_chai.jpg",
    "description": "White tea, chai spices with lemongrass, coconut, fruit pieces and peppercorn combine for a light bodied zesty cup. Light yellow with complex notes of lemongrass, fruit and spice that dance on the palate. A fiery kick of the peppercorn lingers in the soft sweetness of the fruit.",
    "name": "white chai",
    "score": 92,
    "thumbUrl": "/images5/products_index/white_chai.jpg",
    "url": "/chai/white_chai.html",
    "steepInfo": "Steep at 195&deg; for 3 minutes."
  },
  {
    "category": "oolong",
    "imageUrl": "/images5/products/ali_shan.jpg",
    "description": "Ali Shan is an alpine green oolong tea from Taiwan. While relatively new, Ali Shan is one of Taiwan's most famous tea growing areas, producing beautiful high mountain oolong teas from its misty peaks. Warm sugar and deeply layered floral aromas, with a melting, creamy mouthfeel. Mellow and light bodied, this hand-crafted Ali Shan oolong is also excellent for multiple infusions on a quiet afternoon.",
    "name": "ali shan",
    "score": 95,
    "thumbUrl": "/images5/products_index/ali_shan.jpg",
    "url": "/oolong/ali_shan.html",
    "steepInfo": "Steep at 195&deg; for 2-3 minutes."
  },
  {
    "category": "oolong",
    "imageUrl": "/images5/products/jade_oolong.jpg",
    "description": "Jade oolong tea from Nantou county, Taiwan. A highly prized tea, similar in style to Tung Ting, Jade oolongs are a beautiful deep green in appearance, with large, tightly rolled leaves. Once infused, these lightly oxidized leaves gradually unfurl to release their essential oils. Jade oolongs are known for their fresh green-floral aroma, sweet flavor and clean, delicate mouthfeel.",
    "name": "jade oolong",
    "score": 94,
    "thumbUrl": "/images5/products_index/jade_oolong.jpg",
    "url": "/oolong/jade_oolong.html",
    "steepInfo": "Steep at 180&deg; for 3-5 minutes."
  },
  {
    "category": "oolong",
    "imageUrl": "/images5/products/peach_oolong.jpg",
    "description": "This Peach Oolong is made with the darker, more oxidized oolongs of Taiwan are known for having lush, playful flavors. Deeply floral, honey and juicy, it's not uncommon to have a lovely cup that's almost like a succulent slice of peach. Why not let the tea play with some actual peaches? Fragrant and sweet like a perfectly ripe fruit, with a smooth astringency and lingering floral aroma. Please, be a peach, try this oolong!",
    "name": "peach oolong",
    "score": 95,
    "thumbUrl": "/images5/products_index/peach_oolong.jpg",
    "url": "/oolong/peach_oolong.html",
    "steepInfo": "Steep at 212&deg; for 3-5 minutes."
  },
  {
    "category": "oolong",
    "imageUrl": "/images5/products/formosa.jpg",
    "description": "Formosa Oolong is a darker style oolong tea from Taiwan, formerly known as Formosa (which means 'beautiful', given by the Portuguese explorers of the island). Deep raisiny and ripe fruit aroma, autumn 'leafy' notes. Lingering sweet flavor and smooth, refreshingly fruity astringency. This Formosa Oolong is easy to prepare and remains a lovely introduction to Taiwanese tea.",
    "name": "formosa oolong",
    "score": 92,
    "thumbUrl": "/images5/products_index/formosa.jpg",
    "url": "/oolong/formosa.html",
    "steepInfo": "Steep at 212&deg; for 3-5 minutes."
  },
  {
    "category": "oolong",
    "imageUrl": "/images5/products/formosa_fancy.jpg",
    "description": "Formosa Bai Hao is known by many names - Oriental Beauty, White Tip Oolong, Champagne oolong and Fancy Formosa Silver Tip, to name just a few. This heavily oxidized Taiwanese tea is one of the most prized oolongs in the world. Incredibly sweet, fruity and lush with a delicate warm spicy undertone. Striking and thought-provoking tea, perfect for multiple infusions.",
    "name": "formosa bai hao",
    "score": 94,
    "thumbUrl": "/images5/products_index/formosa_fancy.jpg",
    "url": "/oolong/formosa_fancy.html",
    "steepInfo": "Steep at 212&deg; for 3-5 minutes."
  },
  {
    "category": "oolong",
    "imageUrl": "/images5/products/vanilla_oolong.jpg",
    "description": "Fresh sugar cookies, anyone? For this Vanilla Oolong we start with a naturally sweet oolong from Taiwan. The warm dark sugar quality of vanilla bean adds a perfect flavor and texture element to this already complex tea. So, cookies? Well, that's just one of several sweet, sugary treats that came to mind when tasting this cup. Brown sugar and honey notes, smooth mouthfeel, lingering fragrance.",
    "name": "vanilla oolong",
    "score": 94,
    "thumbUrl": "/images5/products_index/vanilla_oolong.jpg",
    "url": "/oolong/vanilla_oolong.html",
    "steepInfo": "Steep at 212&deg; for 3-5 minutes."
  },
  {
    "category": "oolong",
    "imageUrl": "",
    "description": "A wonderful introduction to the fun discovery of flavored oolong teas. This set includes (though subject to infrequent change):<br><br><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>peach oolong<\/FONT> - Naturally lush, fruity Taiwanese oolong paired with succulent peach. Fragrant, sweet, smooth and fruit-floral.<BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>grapefruit oolong<\/FONT> - Invigorating grapefruit and fruity Taiwan oolong. Zesty and warming, full boded and slightly dry finish.<BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>almond oolong<\/FONT> - Savory almond with Taiwan oolong tea. Smooth, nutty aroma, full and rounded body, sweet marzipan flavor.<BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>vanilla oolong<\/FONT> - Naturally sweet oolong from Taiwan and pure vanilla. Brown sugar, honey notes and warm cookie-like flavor.<BR><\/DIV>",
    "name": "orchard sampler",
    "score": 95,
    "thumbUrl": "/images5/products_index/oolong_flavors_sampler.jpg",
    "url": "/oolong/oolong_flavors_sampler.html",
    "steepInfo": ""
  },
  {
    "category": "oolong",
    "imageUrl": "/images5/products/almond_oolong.jpg",
    "description": "Combining savory almond with the bright, fruity-floral taste of Taiwan oolong tea, our Almond Oolong is a great on its own, as well as the perfect dessert complement. Smooth, clean and unroasted almond nutty aroma. Full, rounded body and sweet marzipan flavor. The only question now is, is it ok to have two desserts in one evening?",
    "name": "almond oolong",
    "score": 92,
    "thumbUrl": "/images5/products_index/almond_oolong.jpg",
    "url": "/oolong/almond_oolong.html",
    "steepInfo": "Steep at 212&deg; for 3-5 minutes."
  },
  {
    "category": "oolong",
    "imageUrl": "/images5/products/coconut_pouchong.jpg",
    "description": "Pouchong tea is a very lightly oxidized, green oolong from Taiwan. It's highly valued for its rich, naturally sweet fragrance of honey, flowers, and quite often, coconut. We thought the flavor of fresh coconut, then, would be the perfect complement to this delicate cup. The result is soothing and mellow and perfectly harmonious. The sweet flavor and soft texture of our Coconut Pouchong is an easy way to take your island vacation anytime.",
    "name": "coconut pouchong",
    "score": 92,
    "thumbUrl": "/images5/products_index/coconut_pouchong.jpg",
    "url": "/oolong/coconut_pouchong.html",
    "steepInfo": "Steep at 212&deg; for 3-5 minutes."
  },
  {
    "category": "oolong",
    "imageUrl": "/images5/products/ti_kuan_yin.jpg",
    "description": "Ti Kuan Yin (also spelled Tieguanyin) is a legendary oolong tea from the Fujian province in China. It is one of China's most beloved oolongs and is extremely time-consuming to produce (well over a dozen distinct steps in the processing are observed). Our fine version of Ti Kuan Yin produces a cup that is warm, soft and soothingly mineral in texture. Notes of toasted walnut and tender collard greens. Intriguing lingering floral aroma, lightly orchid and gentle astringency. A meditative cup.",
    "name": "ti kuan yin",
    "score": 94,
    "thumbUrl": "/images5/products_index/ti_kuan_yin.jpg",
    "url": "/oolong/ti_kuan_yin.html",
    "steepInfo": "Steep at 195&deg; for 2-3 minutes."
  },
  {
    "category": "oolong",
    "imageUrl": "/images5/products/grapefruit_oolong.jpg",
    "description": "A wake up call to the senses! Our Grapefruit Oolong is invigorating both in scent as well as taste. This blend of premium Taiwan oolong tea and grapefruit is fantastic choice for an afternoon respite, or anytime you need a citrus-infused pick-me-up. Zesty and warming, full boded and slightly dry finish. Refreshingly aromatic.",
    "name": "grapefruit oolong",
    "score": 93,
    "thumbUrl": "/images5/products_index/grapefruit_oolong.jpg",
    "url": "/oolong/grapefruit_oolong.html",
    "steepInfo": "Steep at 212&deg; for 3-5 minutes."
  },
  {
    "category": "oolong",
    "imageUrl": "/images5/products/pouchong.jpg",
    "description": "Pouchong, also known as Baozhong, is a very green oolong tea hailing from Taiwan. Pouchong is the most lightly oxidized of all oolongs - just 8-10%. This creates a beautiful balance of green tea freshness and heavenly floral notes found in darker oolongs. In Taiwan, pouchong tea is all about the aroma. In the cup, you'll find a buttery sweet and uplifting floral aroma that lingers on the palate long after your last sip. Our fine quality Pouchong displays a soft, succulent texture and a clean, refreshing finish.",
    "name": "pouchong",
    "score": 93,
    "thumbUrl": "/images5/products_index/pouchong.jpg",
    "url": "/oolong/pouchong.html",
    "steepInfo": "Steep at 195&deg; for 2-3 minutes."
  },
  {
    "category": "oolong",
    "imageUrl": "/images5/products/wuyi_ensemble.jpg",
    "description": "Wuyi Ensemble, known as Da Hong Pao or Wuyi rock tea, is a roasted oolong tea from the Wuyi mountains in Fujian province, China. The high fire treatment gives Wuyi oolong its specific smoky and minerally character. This is a beautifully balanced and complex tea with a deep, yet faint, ripe fruitiness in the background. The flavor is slightly honey-floral and nutty, with hints of white sesame, cinnamon and sweetened burdock root. There is a lingering sweet caramel aftertaste due to the high fire roasting technique. Wuyi Ensemble oolong is warming and satisfying. Being a good digestive tea it goes well with food or sweets. It is perfect for multiple infusions so you can tease out many layers of intriguing flavor.",
    "name": "wuyi ensemble",
    "score": 94,
    "thumbUrl": "/images5/products_index/wuyi_ensemble.jpg",
    "url": "/oolong/wuyi_ensemble.html",
    "steepInfo": "Steep at 195&deg; for 3-5 minutes."
  },
  {
    "category": "oolong",
    "imageUrl": "",
    "description": "A wonderful introduction to Chinese oolong teas. Each sample makes about 8-10 cups of tea. This set includes (though subject to infrequent change):<br><br><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>wuyi ensemble<\/FONT> - Honey-floral flavor and nutty, with white sesame, sweetened burdock root, or barley. <BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>dancong aria<\/FONT> - Perfumy, orchid and almond. Smooth and refined texture with flavors of fresh apricot, peach pit and honey.<BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>fujian rain<\/FONT> - High fired, medium grade oolong with a rich tasting amber cup and nuances of minerals, apricots and spice. <BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>ti kuan yin<\/FONT> - Warm, soft and soothingly mineral in texture. Notes of toasted walnut and tender collard greens. <BR><\/DIV>",
    "name": "dragon sampler",
    "score": 94,
    "thumbUrl": "/images5/products_index/oolong_sampler.jpg",
    "url": "/oolong/oolong_sampler.html",
    "steepInfo": ""
  },
  {
    "category": "oolong",
    "imageUrl": "/images5/products/dancong_aria.jpg",
    "description": "Dancong oolongs are a rare variety from Phoenix Mountain in Guangdong province, China. Our Dancong Aria (Mi Lan Xiang) exudes a perfumy aroma of orchids and almonds. Smooth and refined texture with flavors of fresh apricot, peach pit and honey. Incredibly long finish. Dancong Aria is a tea to take your time with - for maximum sweetness use lower water temperature than for most oolongs and be careful not to over-steep it, because for a tea that's got 'flowers' going on for days, this is no shrinking violet. A rich, grounding cup, perfect to enjoy in multiple infusions.",
    "name": "dancong aria",
    "score": 94,
    "thumbUrl": "/images5/products_index/dancong_aria.jpg",
    "url": "/oolong/dancong_aria.html",
    "steepInfo": "Steep at 195&deg; for 3-5 minutes."
  },
  {
    "category": "oolong",
    "imageUrl": "",
    "description": "Discover the finely crafted oolongs of Taiwan. Each sample makes about 8-10 cups of tea. This set includes (though subject to infrequent change):<br><br><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>pouchong<\/FONT> - Lightly oxidized yielding buttery sweet, uplifting and lingering wildflower fragrance with soft, succulent texture.<BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>jade oolong<\/FONT> - Lightly oxidized oolong with fresh green-floral aroma, sweet flavor and delicate texture.<BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>formosa bai hao<\/FONT> - Luxurious floral, peach-pit fragrance. Incredibly sweet and lush, delicate warm spicy undertone. <BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>formosa oolong<\/FONT> - Deep raisiny and ripe fruit aroma, autumn 'leafy' note. Lingering flavor and smooth, refreshingly fruity astringency.<BR><\/DIV>",
    "name": "formosa sampler",
    "score": 93,
    "thumbUrl": "/images5/products_index/formosa_sampler.jpg",
    "url": "/oolong/formosa_sampler.html",
    "steepInfo": ""
  },
  {
    "category": "oolong",
    "imageUrl": "/images5/products/ooooh_darjeeling.jpg",
    "description": "Ooooh Darjeeling is a rare oolong tea from Darjeeling, India, where it is fairly uncommon to produce anything other than black tea. However, the growers of Singbulli Estate have produced this exquisite exception. Complex muscat grape and apricot pit aroma (also a characteristic of fine Darjeeling black teas, interestingly), tangy dried fruit flavor and deep floral notes that linger like any great oolong should are reminiscent of Oriental Beauty oolong. This Darjeeling oolong is a must-try for anyone seeking to learn more about tea on a deeper level: this is an exercise in the taste of 'terroir', the place where the tea is grown.",
    "name": "ooooh darjeeling",
    "score": 0,
    "thumbUrl": "/images5/products_index/ooooh_darjeeling.jpg",
    "url": "/oolong/ooooh_darjeeling.html",
    "steepInfo": "Steep at 212&deg; for 3-4 minutes."
  },
  {
    "category": "oolong",
    "imageUrl": "/images5/products/twilight_ti_kuan_yin.jpg",
    "description": "A legendary oolong tea from the Fujian province of China. Ti Kuan Yin is one of China's most beloved oolongs and is extremely time-consuming to produce (well over a dozen distinct steps in the processing are observed). In this roasted version we find rich wildflower honey notes, hints of orchard fruit and roasted nuts that give way to a lilting floral finish.",
    "name": "twilight ti kuan yin",
    "score": 0,
    "thumbUrl": "/images5/products_index/twilight_ti_kuan_yin.jpg",
    "url": "/oolong/twilight_ti_kuan_yin.html",
    "steepInfo": "Steep at 195&deg; for 2-3 minutes."
  },
  {
    "category": "oolong",
    "imageUrl": "/images5/products/fujian_rain.jpg",
    "description": "Shui Xian, which translates to \"Water Sprite,\" is an oolong produced in a similar style to Wuyi Oolongs. Therefore they share some similar traits, such as peachy-honey notes and a mineral \"rock taste.\" This high-fired, medium grade version results in a rich tasting amber colored cup with the nuances of minerals, apricots and spice. Great for an everyday oolong option.",
    "name": "fujian rain",
    "score": 0,
    "thumbUrl": "/images5/products_index/fujian_rain.jpg",
    "url": "/oolong/fujian_rain.html",
    "steepInfo": "Steep at 195&deg; for 2-3 minutes."
  },
  {
    "category": "white",
    "imageUrl": "/images5/products/white_symphony.jpg",
    "description": "An exquisite version of the White Peony variety, this is a delicate tea made from unopened leaf buds and the newest two leaves to open on the tea bush. For White Symphony, many more buds are included than is typical for classic White Peony. The liquor is very light, similar to Silver Needles. But the flavor is much more complex: faintly floral, warm and sugary like honeydew or white nectarine. Soft mouthfeel and clean, uplifting finish. If you've been enjoying White Peony, we invite you to savor this more refined version.",
    "name": "white symphony",
    "score": 94,
    "thumbUrl": "/images5/products_index/white_symphony.jpg",
    "url": "/white/white_symphony.html",
    "steepInfo": "Steep at 195&deg; for 3-5 minutes."
  },
  {
    "category": "white",
    "imageUrl": "/images5/products/white_peach.jpg",
    "description": "White Peach tea combines this Southern gem of a fruit with delicate, naturally sweet white tea from the Fujian province in China. Flowery peach-nectar aroma, juicy and very ripe flavor, slightly dry finish (just like peach fuzz!). Enjoy White Peach hot or iced and don't blame us if you become hooked!",
    "name": "white peach",
    "score": 95,
    "thumbUrl": "/images5/products_index/white_peach.jpg",
    "url": "/white/white_peach.html",
    "steepInfo": "Steep at 180&deg; for 3-5 minutes."
  },
  {
    "category": "white",
    "imageUrl": "/images5/products/silver_needle.jpg",
    "description": "Silver Needle (or Bai Hao Yin Zhen) is one of the most revered of Chinese teas, produced in the Fuding and Zhenhe districts of its Fujian province. Gathered only for a few days in early spring, the dedication to perfection is evident in the pale, ivory colored liquor. The lingering fragrance of our Silver Needle is delicately honeysuckle floral, with a warmed sugar sweetness and a subtle hint of white grapes. Silver Needle feels refreshing, soft and airy on the palate. This is a high grade Bai Hao version of this exquisite tea, perfect to enjoy in multiple infusions.",
    "name": "silver needle",
    "score": 95,
    "thumbUrl": "/images5/products_index/silver_needle.jpg",
    "url": "/white/silver_needle.html",
    "steepInfo": "Steep at 195&deg; for 3-5 minutes."
  },
  {
    "category": "white",
    "imageUrl": "/images5/products/jasmine_silver_needle.jpg",
    "description": "Jasmine Silver Needle white tea is made up of young and elegant tea leaf buds with a whisper of jasmine aura. All the appeal and softly sweet nuances of a classic Silver Needle tea, enhanced with the graceful aroma of night-blooming jasmine flowers. Airy flavor, delicate mouthfeel and pleasantly dry finish. The quiet nature of this Jasmine Silver Needle white tea ensures it will make a gentle companion for your special moments.",
    "name": "jasmine silver needle",
    "score": 96,
    "thumbUrl": "/images5/products_index/jasmine_silver_needle.jpg",
    "url": "/white/jasmine_silver_needle.html",
    "steepInfo": "Steep at 195&deg; for 3-5 minutes."
  },
  {
    "category": "white",
    "imageUrl": "/images5/products/white_tangerine.jpg",
    "description": "Premium white tea from Fujian region of China with tender-tangy flavor of tangerines. Sweet and warming citrus aroma, with a clean and softly juicy flavor. A playful combination perfect for any white tea fan.",
    "name": "white tangerine",
    "score": 90,
    "thumbUrl": "/images5/products_index/white_tangerine.jpg",
    "url": "/white/white_tangerine.html",
    "steepInfo": "Steep at 180&deg; for 3-5 minutes."
  },
  {
    "category": "white",
    "imageUrl": "/images5/products/white_blueberry.jpg",
    "description": "White Blueberry tea blends together the taste of juicy blueberries with premium white tea from Fujian province, China. Very fragrant, like freshly harvested 'highbush' blueberries (the aromatic variety). Soft, rounded mouthfeel with a clean, refreshing finish. White Blueberry tea is a customer favorite, delectable both hot or iced.",
    "name": "white blueberry",
    "score": 94,
    "thumbUrl": "/images5/products_index/white_blueberry.jpg",
    "url": "/white/white_blueberry.html",
    "steepInfo": "Steep at 180&deg; for 3-5 minutes."
  },
  {
    "category": "white",
    "imageUrl": "/images5/products/white_grapefruit.jpg",
    "description": "Tangy grapefruit is paired with delicate, naturally sweet white tea from China to create a wonderfully sour-sweet tasting cup. Zesty citrus flavor, slightly dry, refreshing finish. Enjoy any time during the day, hot or iced!",
    "name": "white grapefruit",
    "score": 92,
    "thumbUrl": "/images5/products_index/white_grapefruit.jpg",
    "url": "/white/white_grapefruit.html",
    "steepInfo": "Steep at 180&deg; for 3-5 minutes."
  },
  {
    "category": "white",
    "imageUrl": "/images5/products/white_peony.jpg",
    "description": "Also known as Pai Mu Tan or Bai Mu Dan, White Peony is a sweet, mild Chinese tea made from unopened tea buds, as well as the two newest leaves to sprout. The freshly harvested leaf is allowed to wither dry in the sun. The natural oxidation that takes place during this withering gives White Peony beautiful, plush flavors. The nose is warm, floral and rich like fruit blossoms. The liquor is golden and bright. Clean, succulent floral-fruit flavor, melon sweetness, a touch of gentle savoriness and rounded mouthfeel. If you are beginning your exploration of white tea, or even just tea in general, our White Peony tea will serve a wonderful introduction.",
    "name": "white peony",
    "score": 94,
    "thumbUrl": "/images5/products_index/white_peony.jpg",
    "url": "/white/white_peony.html",
    "steepInfo": "Steep at 195&deg; for 3-5 minutes."
  },
  {
    "category": "white",
    "imageUrl": "/images5/products/white_strawberry.jpg",
    "description": "White tea from China with inherent melon notes makes a tasty base for this homage to the fabulous strawberry. Ever popular, strawberries can lift the spirit and please the palate. In this complex blend with strawberry overtones and a hint of vanilla, the Queen of Berries reigns supreme.",
    "name": "white strawberry",
    "score": 96,
    "thumbUrl": "/images5/products_index/white_strawberry.jpg",
    "url": "/white/white_strawberry.html",
    "steepInfo": "Steep at 180&deg; for 3-5 minutes."
  },
  {
    "category": "white",
    "imageUrl": "/images5/products/white_pear.jpg",
    "description": "Premium white tea from Fujian region of China infused with the taste of ripe pears. Warm and sugary aroma, like a freshly baked pear, with a pear skin crisp finish. Wonderfully smooth and rounded, perfect hot or iced.",
    "name": "white pear",
    "score": 91,
    "thumbUrl": "/images5/products_index/white_pear.jpg",
    "url": "/white/white_pear.html",
    "steepInfo": "Steep at 180&deg; for 3-5 minutes."
  },
  {
    "category": "white",
    "imageUrl": "/images5/products/white_tropics.jpg",
    "description": "Get swept away to paradise with this wonderful White Tropics blend of naturally sweet white tea from China and the flavor of coconuts and pineapple. Rounded mouthfeel, delightfully simple sweet finish. Soothing from start to finish. Even on a dreary, cold day you can be transported to a sunny beach by enjoying this unique White Tropics blend hot or iced. Don't forget your sunblock!",
    "name": "white tropics",
    "score": 90,
    "thumbUrl": "/images5/products_index/white_tropics.jpg",
    "url": "/white/white_tropics.html",
    "steepInfo": "Steep at 180&deg; for 3-5 minutes."
  },
  {
    "category": "white",
    "imageUrl": "/images5/products/white_cucumber.jpg",
    "description": "Stay cool with this refreshing, spa-inspired blend of cucumber and premium Chinese white tea. Vegetal aroma (think cucumber appetizers at a middle eastern restaurant), with a pleasantly dry, green melon finish. Excellent over ice, this unexpected pairing will leave you relaxed and centered; a lot more convenient than placing cucumber slices on your eyelids.",
    "name": "white cucumber",
    "score": 87,
    "thumbUrl": "/images5/products_index/white_cucumber.jpg",
    "url": "/white/white_cucumber.html",
    "steepInfo": "Steep at 180&deg; for 3-5 minutes."
  },
  {
    "category": "white",
    "imageUrl": "",
    "description": "A wonderful introduction to the wide range of white teas. Each sample makes about 5 cups of tea. This set includes (though subject to infrequent change):<br><br><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>silver needle<\/FONT> - Pale, ivory colored liquor. Delicately honeysuckle floral, with a warmed sugar sweetness.<BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>snowbud<\/FONT> - Airy, light tea, very delicate body, with a clean, barely sweet aroma and effervescent texture.<BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>white symphony<\/FONT> - A delicate tea made from tea buds collected and withered prior to opening. It create a pale yellow, light bodied, yet complex cup with hints of honeydew and a faint floral sweetness.<BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>jasmine silver needle<\/FONT> - Softly sweet nuances of Silver Needle enhanced with jasmine. Airy flavor, delicate mouthfeel and pleasantly dry finish.<BR><\/DIV>",
    "name": "silver sampler",
    "score": 94,
    "thumbUrl": "/images5/products_index/white_sampler.jpg",
    "url": "/white/white_sampler.html",
    "steepInfo": ""
  },
  {
    "category": "white",
    "imageUrl": "",
    "description": "A wonderful introduction to the wide range of flavored white teas. This set includes (though subject to infrequent change):<br><br><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>white tropics<\/FONT> - Delicate white tea from China with tropical coconuts and pineapple. Relaxing and delightfully simple sweet.<BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>white peach<\/FONT> - Sweet white tea from China with flowery flavor of juicy peaches. Smooth and playfully \"peach fuzz\" dry.<BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>white blueberry<\/FONT> - Juicy blueberry flavor and white tea from Fujian, China. Very fragrant, soft mouthfeel, refreshing finish.<BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>white pear<\/FONT> - White tea from Fujian, China infused with the flavor of ripe pears. A wonderfully smooth and subtle treat.<BR><\/DIV>",
    "name": "orchard sampler",
    "score": 93,
    "thumbUrl": "/images5/products_index/white_flavors_sampler.jpg",
    "url": "/white/white_flavors_sampler.html",
    "steepInfo": ""
  },
  {
    "category": "white",
    "imageUrl": "/images5/products/snowbud.jpg",
    "description": "White tea from the Fujian province of China. An airy, light tea, which yields a cup worthy of its name: very delicate body, with a clean, barely sweet aroma and effervescent texture. Snowbud is composed of only the newest leaves and buds, all gathered and dried in the early days of spring. Of all the teas we offer, our Snowbud is the lightest one. If you enjoy the subtle, gentle taste of white tea, we hope you'll give this one a try.",
    "name": "snowbud",
    "score": 0,
    "thumbUrl": "/images5/products_index/snowbud.jpg",
    "url": "/white/snowbud.html",
    "steepInfo": "Steep at 195&deg; for 3-5 minutes."
  },
  {
    "category": "white",
    "imageUrl": "/images5/products/white_eternal_spring.jpg",
    "description": "Spring brings the awakening of nature after a long winter slumber. Associated with rebirth, revival and renewal, spring imbues a sense of youthful freshness. Enjoy eternal rejuvenation in a cup with this refreshing blend of white tea and a medley of fruit and rose petals. Each sip will renew body and spirit with natural sweetness and floral notes.",
    "name": "white eternal spring",
    "score": 0,
    "thumbUrl": "/images5/products_index/white_eternal_spring.jpg",
    "url": "/white/white_eternal_spring.html",
    "steepInfo": "Steep at 180&deg; for 3-5 minutes."
  },
  {
    "category": "white",
    "imageUrl": "/images5/products/white_darjeeling.jpg",
    "description": "White tea from the Darjeeling region of India. A rare treat from the Avongrove estate, nestled along the picturesque slopes of the Himalayas. Similar in appearance to the justly-revered Silver Needle tea of China, the Darjeeling version is equally sublime. Composed solely of the tender unopened buds gathered in the second flush of early summer, this is an outstanding tea that fuses the gentle sweetness of white with a boisterous touch of muscatel. We promise, your taste buds will be singing.",
    "name": "white darjeeling",
    "score": 0,
    "thumbUrl": "/images5/products_index/white_darjeeling.jpg",
    "url": "/white/white_darjeeling.html",
    "steepInfo": "Steep at 195&deg; for 3-5 minutes."
  },
  {
    "category": "green",
    "imageUrl": "/images5/products/dragon_pearl.jpg",
    "description": "Jasmine Phoenix Pearls are perfumy, hand-rolled jewels of tea from Fuding, in Fujian province, China. Any fan of jasmine tea should try this specially crafted wonder. When added to hot water, Jasmine Phoenix Pearls majestically unfurl, releasing their delicate scent and flavor. Also known as 'Jasmine Dragon Pearls', their liquor is sweet and almost sugary. Very soft, airy mouthfeel. The delicate quality of the flavor is due in part to the leaves used to produce this tea: two tender, tiny new leaves and one plump unopened leaf bud. Younger leaves will yield softer flavor.",
    "name": "jasmine phoenix pearls",
    "score": 96,
    "thumbUrl": "/images5/products_index/dragon_pearl.jpg",
    "url": "/green/dragon_pearl.html",
    "steepInfo": "Steep at 195&deg; for 2-3 minutes."
  },
  {
    "category": "green",
    "imageUrl": "/images5/products/matcha.jpg",
    "description": "Matcha, the focal point of the Japanese Tea Ceremony, is a fine powder made by grinding green tea leaves. Only the finest, young, shade-grown gyokuro tea leaves are used to create matcha. The leaves are plucked and laid out flat to dry. Veins are removed and the leaves, now called tencha, are carefully ground in granite mills until they become the precious powder. Easy preparation is achieved by placing 1 teaspoon of matcha per cup (or to taste) in a cup, adding a few drops of hot water (160-180F) and stirring with a spoon until a paste forms. Add the rest of the water and stir.",
    "name": "matcha",
    "score": 94,
    "thumbUrl": "/images5/products_index/matcha.jpg",
    "url": "/green/matcha.html",
    "steepInfo": "Steep at 170&deg; for 2 minutes."
  },
  {
    "category": "green",
    "imageUrl": "/images5/products/jasmine_yin_hao.jpg",
    "description": "Jasmine Yin Hao (meaning 'Silver Tip') is a deeply perfumy green tea from the Fujian province of China. Very layered and lingering floral aroma. Soft, full-bodied and sweet flavor with a slight dryness in the finish. Our Jasmine Yin Hao grade is among the highest for green jasmine teas. This jasmine green tea has been infused with jasmine many times over to create a truly unforgettable experience.",
    "name": "jasmine yin hao",
    "score": 94,
    "thumbUrl": "/images5/products_index/jasmine_yin_hao.jpg",
    "url": "/green/jasmine_yin_hao.html",
    "steepInfo": "Steep at 195&deg; for 2-3 minutes."
  },
  {
    "category": "green",
    "imageUrl": "/images5/products/citron_green.jpg",
    "description": "Citron Green tea combines green tea from China with delicate flavours of lemon and lime. The clean vegetal notes of the green tea blend seamlessly with the citrus crispness. Delightfully sweet, lifted by the freshness of the lemon-lime. Not too dry or too citrusy. Citrus Green is an Adagio customer favorite, perfect hot or iced.",
    "name": "citron green",
    "score": 94,
    "thumbUrl": "/images5/products_index/citron_green.jpg",
    "url": "/green/citron_green.html",
    "steepInfo": "Steep at 180&deg; for 2-3 minutes."
  },
  {
    "category": "green",
    "imageUrl": "/images5/products/gunpowder.jpg",
    "description": "Gunpowder is a classic green tea from Zhejiang province, China. As the name implies, Gunpowder tea is made up of leaves hand-rolled into tiny pellets. These resemble gunpowder, and give this tea its distinct name. Full-bodied cup with a hint of smokiness and a smooth mouthfeel. Blend Gunpowder tea with spearmint to create the famous 'Moroccan Mint' tea.",
    "name": "gunpowder",
    "score": 93,
    "thumbUrl": "/images5/products_index/gunpowder.jpg",
    "url": "/green/gunpowder.html",
    "steepInfo": "Steep at 180&deg; for 2 minutes."
  },
  {
    "category": "green",
    "imageUrl": "/images5/products/gyokuro.jpg",
    "description": "Gyokuro, a shade grown steamed green tea, is among the finest of Japanese teas. While the young leaves of the spring season develop, the Gyokuro plants are shaded from sun for several weeks. This slows the growth allowing, tea leaves more time to develop depth and flavor. The sun-deprived leaves are higher in chlorophyll, which explains their vivid green color. They're also higher in amino acids, most notably L-theanine, which accounts for the perfectly smooth, rich and soft flavor. Our fine Gyokuro green tea produces a deeply sweet aroma of freshly buttered greens and seaweed, with no grassiness or harshness. Think of tender new grass just sprouting in the spring. Soft on the palate with a balanced, delicate finish. Energizing and soothing cup of tea. Use lower water temperature and enjoy multiple infusions to get the most from this tea.",
    "name": "gyokuro",
    "score": 93,
    "thumbUrl": "/images5/products_index/gyokuro.jpg",
    "url": "/green/gyokuro.html",
    "steepInfo": "Steep at 170&deg; for 2 minutes."
  },
  {
    "category": "green",
    "imageUrl": "/images5/products/sencha_overture.jpg",
    "description": "Sencha is a steamed green tea from the Shizuoka prefecture of Japan, harvested in the early summer (the second flush). It produces a rich, brothy texture, with a clean, very refreshing green aroma. The cup develops a sweet flavor reminiscent of tender steamed veggies and fresh seaweed, with a rounded finish that coats the palate at the end. Our Sencha Overture has a classic sencha flavor, perfect for fans of all things 'green.'",
    "name": "sencha overture",
    "score": 92,
    "thumbUrl": "/images5/products_index/sencha_overture.jpg",
    "url": "/green/sencha.html",
    "steepInfo": "Steep at 170&deg; for 2 minutes."
  },
  {
    "category": "green",
    "imageUrl": "/images5/products/genmai_cha.jpg",
    "description": "Genmai Cha is a classic Japanese green tea, blended with toasted, popped rice. Originally created to stretch short supplies of tea, now enjoyed by tea lovers here and abroad. Warm and nutty taste, with a lovely savory quality. A hearty cup of tea that is easy to combine with food. Genmai Cha is a great solution for those seeking a substantial, but less astringent, flavor from their cup.",
    "name": "genmai cha",
    "score": 93,
    "thumbUrl": "/images5/products_index/genmai_cha.jpg",
    "url": "/green/genmai_cha.html",
    "steepInfo": "Steep at 180&deg; for 2 minutes."
  },
  {
    "category": "green",
    "imageUrl": "/images5/products/casablanca_twist.jpg",
    "description": "An interesting twist on classic Moroccan Mint tea, which traditionally combines Gunpowder green tea from China with fresh mint. We kept the latter, and replaced the smoky notes of Gunpowder with the muscatel highlights of a Darjeeling from India. The result is very a refreshing cup, with bold, cool minty notes, smooth and relaxing texture and flavor. Very intriguing cup.",
    "name": "casablanca twist",
    "score": 95,
    "thumbUrl": "/images5/products_index/casablanca_twist.jpg",
    "url": "/green/casablanca_twist.html",
    "steepInfo": "Steep at 180&deg; for 2 minutes."
  },
  {
    "category": "green",
    "imageUrl": "",
    "description": "A chance to broaden your discovery with the very best of green teas. Each sample makes about 8-10 cups of tea. This set includes (though subject to infrequent change):<br><br><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>gyokuro<\/FONT> - Deeply sweet, aroma of freshly buttered greens - no grassiness or harshness. Soft with a balanced, delicate finish.<BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>jasmine chun hao<\/FONT> - Sweet perfumy cup, notes of warmed sugar, slightly toasty like a fresh biscuit. Light, refreshing and not overwhelmingly floral.<BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>jade snail<\/FONT> - The tightly rolled fuzzy buds unfurl to deliver intricate notes of roasted nuts, soft smokiness and a hop-like crispness. Delicate yet bold.<BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>dragonwell<\/FONT> - Inviting, toasty aroma and sweet rounded flavor. Nutty, buttery texture, pleasantly dry finish.<BR><\/DIV>",
    "name": "emperor sampler",
    "score": 94,
    "thumbUrl": "/images5/products_index/green_savant_sampler.jpg",
    "url": "/green/green_savant_sampler.html",
    "steepInfo": ""
  },
  {
    "category": "green",
    "imageUrl": "/images5/products/dragonwell.jpg",
    "description": "Dragonwell (Lung Ching or Longjing in local parlance) is one of China's most famous green teas, originating from Hangzhou in Zhejiang province. This tea has a very distinctive shape: smooth and perfectly flattened along the inside vein of the leaf, the result of highly skilled shaping in a hot wok. This process, known as pan-firing or pan-frying, was perfected in China by tea masters over many centuries. It gives the tea an inviting, toasty aroma. Our fine Dragonwell green tea also has a sweet, rounded flavor, perhaps reminiscent of freshly roasted white corn. Full, nutty and buttery texture, and pleasantly dry finish. A truly satisfying cup of tea.",
    "name": "dragonwell",
    "score": 93,
    "thumbUrl": "/images5/products_index/dragonwell.jpg",
    "url": "/green/dragonwell.html",
    "steepInfo": "Steep at 180&deg; for 2 minutes."
  },
  {
    "category": "green",
    "imageUrl": "/images5/products/ginseng_green.jpg",
    "description": "Fresh and crisp green tea from China with the energizing flavor of ginseng, accented with dried ginger. Sweet, earthy green aroma, notes of fresh hay and delicately spicy herbs. Pleasantly bittersweet without being medicinal. Soothing, soft finish. A very grounding cup of tea.",
    "name": "ginseng green",
    "score": 90,
    "thumbUrl": "/images5/products_index/ginseng_green.jpg",
    "url": "/green/ginseng_green.html",
    "steepInfo": "Steep at 180&deg; for 2-3 minutes."
  },
  {
    "category": "green",
    "imageUrl": "/images5/products/mango_green.jpg",
    "description": "An ancient Hindu legend recounts the story of the mango tree growing from the ashes of the sun princess, who had been incinerated by an evil sorceress. When the mango ripened and fell, the beautiful princess emerged again. Our Mango Green tea combines the vegetal goodness of green tea with the flavor of perfectly ripened mangoes. Juicy texture, with floral aromatics and sweetness. Sun princess sold separately.",
    "name": "mango green",
    "score": 94,
    "thumbUrl": "/images5/products_index/mango_green.jpg",
    "url": "/green/mango_green.html",
    "steepInfo": "Steep at 180&deg; for 2-3 minutes."
  },
  {
    "category": "green",
    "imageUrl": "/images5/products/jasmine.jpg",
    "description": "A perfumy tea from the Fujian province of China, infused with the delicate scent of jasmine flowers. Sweet cup, notes of warmed sugar and jasmine in bloom on a summer evening. Slightly toasty like a fresh biscuit. Light, refreshing cup and not overwhelmingly floral. A perfect introduction to our selection of excellent jasmine teas.",
    "name": "jasmine chun hao",
    "score": 93,
    "thumbUrl": "/images5/products_index/jasmine.jpg",
    "url": "/green/jasmine.html",
    "steepInfo": "Steep at 195&deg; for 2-3 minutes."
  },
  {
    "category": "green",
    "imageUrl": "/images5/products/cherry_green.jpg",
    "description": "This premium tea is a treat for any Chekhov fans musing in their cherry orchard. Fresh green tea flavored with ripe summer cherries. Candied cherry aroma, juicy texture and slightly dry finish. Great hot or iced.",
    "name": "cherry green",
    "score": 88,
    "thumbUrl": "/images5/products_index/cherry_green.jpg",
    "url": "/green/cherry_green.html",
    "steepInfo": "Steep at 180&deg; for 2-3 minutes."
  },
  {
    "category": "green",
    "imageUrl": "/images5/products/apricot_green.jpg",
    "description": "Apricot Green tea combines green tea leaves from China with the delicate flavor of apricots. Warm, dense fruit-floral aroma, succulent texture. Our naturally flavored Apricot Green tea makes a light and refreshing drink that's popular both hot and iced. An Adagio customer favorite.",
    "name": "apricot green",
    "score": 94,
    "thumbUrl": "/images5/products_index/apricot_green.jpg",
    "url": "/green/apricot_green.html",
    "steepInfo": "Steep at 180&deg; for 2-3 minutes."
  },
  {
    "category": "green",
    "imageUrl": "/images5/products/vanilla_green.jpg",
    "description": "According to the International Ice Cream Association, Vanilla is by far the most popular flavor, getting a full 23% of all ice cream consumption. Inspired by this love, Adagio has created Vanilla Green Tea, combining the rich, warm dark sugar aroma of vanilla with delicate Chinese green tea. Soothing, sweet and very 'beany' vanilla fragrance (like warm sugar cookies made with fresh vanilla beans).",
    "name": "vanilla green",
    "score": 93,
    "thumbUrl": "/images5/products_index/vanilla_green.jpg",
    "url": "/green/vanilla_green.html",
    "steepInfo": "Steep at 180&deg; for 2-3 minutes."
  },
  {
    "category": "green",
    "imageUrl": "/images5/products/jade_snail.jpg",
    "description": "Jade Snail is a Chinese green tea made up of tightly rolled fuzzy buds that resemble spiral shells or the scroll of a violin. While steeping, they unfurl to deliver intricate notes of roasted nuts, soft smokiness and a hop-like crispness. As it fades, a dry white grape character lingers. Our Jade Snail green tea is intriguingly delicate and bold.",
    "name": "jade snail",
    "score": 92,
    "thumbUrl": "/images5/products_index/jade_snail.jpg",
    "url": "/green/jade_snail.html",
    "steepInfo": "Steep at 180&deg; for 2-3 minutes."
  },
  {
    "category": "green",
    "imageUrl": "/images5/products/pomegranate_green.jpg",
    "description": "Pomegranate has historically been a symbol of fertility, marriage, abundance, and righteousness. We promise none of these upon consumption, but trust you'll enjoy the green tea, tart pomegranate flavor, and raspberry pieces. Fruit flavor, crisp texture and airy finish. Not an overly fruity cup, just beautifully accented.",
    "name": "pomegranate green",
    "score": 91,
    "thumbUrl": "/images5/products_index/pomegranate_green.jpg",
    "url": "/green/pomegranate_green.html",
    "steepInfo": "Steep at 180&deg; for 2-3 minutes."
  },
  {
    "category": "green",
    "imageUrl": "",
    "description": "A wonderful introduction to the wide range of flavored green teas. Each sample makes about 8-10 cups of tea. This set includes (though subject to infrequent change):<br><br><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>citron green<\/FONT> - Chinese green tea with the delicate flavors of lemon and lime. An Adagio favorite, refreshing hot and iced.<BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>mango green<\/FONT> - Vegetal goodness of China green tea and floral flavor of ripe mango. Juicy, creamy finish, candy sweet.<BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>apricot green<\/FONT> - Green tea from China with delicate apricot flavor. Warm, dense fruit-floral aroma, succulent texture.<BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>pomegranate green<\/FONT> - China green tea and sweet-tart pomegranate. Subtle fruit flavor, refreshing crisp texture and airy finish.<BR><\/DIV>",
    "name": "orchard sampler",
    "score": 94,
    "thumbUrl": "/images5/products_index/green_flavors_sampler.jpg",
    "url": "/green/green_flavors_sampler.html",
    "steepInfo": ""
  },
  {
    "category": "green",
    "imageUrl": "",
    "description": "A wonderful introduction to the wide range of Chinese green teas. Each sample makes about 8-10 cups of tea. This set includes (though subject to infrequent change):<br><br><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>jasmine chun hao<\/FONT> - Sweet perfumy cup, notes of warmed sugar, slightly toasty like a fresh biscuit. Light, refreshing and not overwhelmingly floral.<BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>sleeping dragon<\/FONT> - Has a soft, fruity sweetness enfolded by a rich, smoky note similar to gunpowder, but more complex and crisp. <BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>gunpowder<\/FONT> - These leaves are hand-rolled into tiny pellets, and yield a full-bodied cup with a hint of smokiness.<BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>green pekoe<\/FONT> - Pale liquor, pleasant aroma of fresh artichokes or okra. Slightly toasty, balanced astringency.<BR><\/DIV>",
    "name": "shanghai sampler",
    "score": 94,
    "thumbUrl": "/images5/products_index/green_sampler.jpg",
    "url": "/green/green_sampler.html",
    "steepInfo": ""
  },
  {
    "category": "green",
    "imageUrl": "/images5/products/raspberry_green.jpg",
    "description": "Raspberry Green is a blend of fresh, crisp green tea from China with sweetly tart red raspberry flavor. Very candy-like aroma, delicately tangy and jammy raspberry taste. Clean finish and rounded texture. This fun, juicy Raspberry Green tea is tangy in the cup, without getting too 'cheeky'.",
    "name": "raspberry green",
    "score": 93,
    "thumbUrl": "/images5/products_index/raspberry_green.jpg",
    "url": "/green/raspberry_green.html",
    "steepInfo": "Steep at 180&deg; for 2-3 minutes."
  },
  {
    "category": "green",
    "imageUrl": "/images5/products/cocomint_green.jpg",
    "description": "Like wine and cheese, burgers and fries, chocolate and mint is a famous partnership in the world of food. We bring that popular flavor combination here, blended with green tea leaves to create a delicious, lip-smacking treat. Fresh and cool, with a smooth, sweet minty flavor and whisps of chocolate. Just like a stick of zesty peppermint bark chocolate. Bon appetit!",
    "name": "cocomint green",
    "score": 92,
    "thumbUrl": "/images5/products_index/cocomint_green.jpg",
    "url": "/green/cocomint_green.html",
    "steepInfo": "Steep at 180&deg; for 2-3 minutes."
  },
  {
    "category": "green",
    "imageUrl": "/images5/products/anhui_emerald_seed.jpg",
    "description": "One of the ten famous teas in China, Lu An Gua Pian originates from Anhui province. The deep green, long, curled leaves smell sweet and fresh. Once steeped, they yield a light yellow colored cup with delicate vegetal notes and a roasted seed-like quality reminiscent of toasted pumpkin seeds.",
    "name": "anhui emerald seed",
    "score": 94,
    "thumbUrl": "/images5/products_index/anhui_emerald_seed.jpg",
    "url": "/green/anhui_emerald_seed.html",
    "steepInfo": "Steep at 180&deg; for 2-3 minutes."
  },
  {
    "category": "green",
    "imageUrl": "/images5/products/calypso_green.jpg",
    "description": "Calypso is a fun and festive blend of luscious fruits and coconut with green tea leaves from China. Juicy, sweet and punch-like with Caribbean flair, one sip and you can almost hear the steel drum band. Ah, paradise!",
    "name": "calypso green",
    "score": 94,
    "thumbUrl": "/images5/products_index/calypso_green.jpg",
    "url": "/green/calypso_green.html",
    "steepInfo": "Steep at 180&deg; for 2-3 minutes."
  },
  {
    "category": "green",
    "imageUrl": "/images5/products/hojicha.jpg",
    "description": "Green tea from Japan that is rendered brown by roasting Bancha (a summer crop tea, harvested after Sencha) tea leaves. An Adagio customer favorite, with a toasty nutty flavor and slightly mesquite note. Earthy and warm quality, soothing, clean finish.",
    "name": "hojicha",
    "score": 92,
    "thumbUrl": "/images5/products_index/hojicha.jpg",
    "url": "/green/hojicha.html",
    "steepInfo": "Steep at 180&deg; for 2 minutes."
  },
  {
    "category": "green",
    "imageUrl": "/images5/products/green_pekoe.jpg",
    "description": "Green tea from the Fujian province of China. In professional tea terms, 'Pekoe' is actually just a grade of tea, referring to the size of the leaf. Many tea drinkers have seen this term on packages of everyday black teas (most famously, 'Orange Pekoe'). Our Green Pekoe is a lovely everyday green tea: delicate pale yellow liquor, soft texture and pleasant aroma like freshly roasted artichokes or okra. Slightly toasty and very balanced, mellow astringency.",
    "name": "green pekoe",
    "score": 92,
    "thumbUrl": "/images5/products_index/green_pekoe.jpg",
    "url": "/green/green_pekoe.html",
    "steepInfo": "Steep at 180&deg; for 2 minutes."
  },
  {
    "category": "green",
    "imageUrl": "/images5/products/earl_grey_green.jpg",
    "description": "Earl Grey Green tea represents a different take on a classic combination: Indian black tea with tangy bergamot flavor. It features a fresh green tea with a delicious crisp texture that pairs perfectly with the orange rind zestiness of the bergamot. Earl Grey Green has a pleasantly dry finish with lingering citrus sweetness.",
    "name": "earl grey green",
    "score": 93,
    "thumbUrl": "/images5/products_index/earl_grey_green.jpg",
    "url": "/green/earl_grey_green.html",
    "steepInfo": "Steep at 180&deg; for 2-3 minutes."
  },
  {
    "category": "green",
    "imageUrl": "/images5/products/rhubarb_green.jpg",
    "description": "Commonly used in pies and other treats, rhubarb's sweet and tart flavor is blended with a subtle Chinese green tea to create another form of delight. Sugary fruity aroma, almost creamy, with a subtly sweet and clean finish. You can now have your pie and in this case, drink it too. Quirky and lovely in one sip.",
    "name": "rhubarb green",
    "score": 91,
    "thumbUrl": "/images5/products_index/rhubarb_green.jpg",
    "url": "/green/rhubarb_green.html",
    "steepInfo": "Steep at 180&deg; for 2-3 minutes."
  },
  {
    "category": "green",
    "imageUrl": "/images5/products/sleeping_dragon.jpg",
    "description": "Sleeping Dragon green tea is grown at about 3,000 feet in the mountainous Fujian province. The tightly rolled leaves and silvery fuzzy buds give this tea its signature shape and name. In the cup, it delivers a soft, fruity sweetness enfolded by a rich smokey note similar to a gunpowder, but more complex and crisp in the finish. Sleeping Dragon remains a great cup for a green tea novice or those who oppose the grassy character of some varieties.",
    "name": "sleeping dragon",
    "score": 92,
    "thumbUrl": "/images5/products_index/sleeping_dragon.jpg",
    "url": "/green/sleeping_dragon.html",
    "steepInfo": "Steep at 180&deg; for 2-3 minutes."
  },
  {
    "category": "green",
    "imageUrl": "/images5/products/mandarin_green.jpg",
    "description": "Green tea from China with the delicate flavor of mandarin orange. Fresh citus zest aroma, soothing sweetness with a soft and cozy texture. A subtle treat for green tea fans and newcomers alike.",
    "name": "mandarin green",
    "score": 90,
    "thumbUrl": "/images5/products_index/mandarin_green.jpg",
    "url": "/green/mandarin_green.html",
    "steepInfo": "Steep at 180&deg; for 2-3 minutes."
  },
  {
    "category": "green",
    "imageUrl": "/images5/products/kukicha.jpg",
    "description": "A warm, rounded and playful green tea from Japan. Kukicha is a blend of tea leaves and tea leaf stems. The lightness of the stems translates into the cup as a sweet, white sesame seed or chestnut note. Tender quality to the texture, like soft white rice. Very balanced and, for a Japanese tea, very low in astringency.",
    "name": "kukicha",
    "score": 93,
    "thumbUrl": "/images5/products_index/kukicha.jpg",
    "url": "/green/kukicha.html",
    "steepInfo": "Steep at 180&deg; for 2 minutes."
  },
  {
    "category": "green",
    "imageUrl": "/images5/products/kai_hua_crescendo.jpg",
    "description": "Kai Hua Long Ding is one of the top ten most famous green teas in China, its name meaning 'Dragon Peak.' A crescendo is a musical peak not unlike each sip building toward its pinnacle with lovely orchid notes and a light bodied, semi-sweet character. We hope you will experience this wonderful tea and all it has to offer - it might just be the highest point of your day.",
    "name": "kai hua crescendo",
    "score": 89,
    "thumbUrl": "/images5/products_index/kai_hua_crescendo.jpg",
    "url": "/green/kai_hua_crescendo.html",
    "steepInfo": "Steep at 180&deg; for 2 minutes."
  },
  {
    "category": "green",
    "imageUrl": "/images5/products/tai_lake_pi_lo_chun.jpg",
    "description": "This \"new style\" pi lo chun has a sweet aromatic leaf; is complex and fruity with soft smoky-meatiness underneath. It does not have fuzzy buds like a traditional pi lo chun, but more of a thin, wirey dry leaf appearance. Plummy notes, with apricots and white grapes linger on your tongue revealing the secret of this tea's origin - the Tai Lake area is populated with fruit trees that lend their sweet character to this light bodied green.",
    "name": "tai lake pi lo chun",
    "score": 90,
    "thumbUrl": "/images5/products_index/tai_lake_pi_lo_chun.jpg",
    "url": "/green/tai_lake_pi_lo_chun.html",
    "steepInfo": "Steep at 180&deg; for 2 minutes."
  },
  {
    "category": "green",
    "imageUrl": "/images5/products/sencha_premier.jpg",
    "description": "Steamed green tea from the Shizuoka prefecture of Japan, harvested in the early spring (the first flush). Sencha is one of Japan's most popular and beloved teas. The higher grades, like our Sencha Premier, tend to have more delicate flavor profiles.  A crisp and clean cup with notes of freshly steamed edamame.  Refreshing, sweet, and much more delicate than most Senchas.  If you're new to Sencha (and the vibrant teas of Japan in general), this would be a great place to start.",
    "name": "sencha premier",
    "score": 93,
    "thumbUrl": "/images5/products_index/sencha_premier.jpg",
    "url": "/green/sencha_premier.html",
    "steepInfo": "Steep at 170&deg; for 2 minutes."
  },
  {
    "category": "green",
    "imageUrl": "/images5/products/spiced_green.jpg",
    "description": "Fresh green tea from China with the warm flavors of cinnamon, cardamom, and ginger. Rich, inviting aroma, zesty flavor and hearty finish. Not as potent as a some chai blends can be, so if you're interested in spiced tea, this lightly flavored cup is a very good place to start.",
    "name": "spiced green",
    "score": 93,
    "thumbUrl": "/images5/products_index/spiced_green.jpg",
    "url": "/green/spiced_green.html",
    "steepInfo": "Steep at 180&deg; for 2-3 minutes."
  },
  {
    "category": "green",
    "imageUrl": "",
    "description": "A wonderful introduction to the wide range of Japanese green teas. Each sample makes about 8-10 cups of tea. This set includes (though subject to infrequent change):<br><br><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>sencha overture<\/FONT> - Rich, brothy texture, refreshing aroma and sweet flavor reminiscent of tender steamed veggies and fresh seaweed.<BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>kukicha<\/FONT> - This blend of leaves and stems yields a sweet sesame seed or chestnut note. Tender like soft white rice. Balanced and low in astringency.<BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>genmai cha<\/FONT> - Classic Japanese green tea, blended with toasted, popped rice. Warm, nutty with a lovely savory and hearty quality.<BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>hojicha<\/FONT> - An Adagio customer favorite, with a toasty nutty flavor and slightly mesquite note. Earthy and warm quality, soothing finish.<BR><\/DIV>",
    "name": "samurai sampler",
    "score": 93,
    "thumbUrl": "/images5/products_index/green_japanese_sampler.jpg",
    "url": "/green/green_japanese_sampler.html",
    "steepInfo": ""
  },
  {
    "category": "green",
    "imageUrl": "/images5/products/green_dragon_pearls.jpg",
    "description": "Softly sweet with nut-like notes, this China green large pearl takes its time to fully unfurl. Great as a travel or outdoor brewing tea with no need to premeasure. These pearls weigh an average of 4 to 5 grams- enough for two cups or a small teapot.",
    "name": "green dragon pearls",
    "score": 91,
    "thumbUrl": "/images5/products_index/green_dragon_pearls.jpg",
    "url": "/green/green_dragon_pearls.html",
    "steepInfo": "Steep at 180&deg; for 3 minutes."
  },
  {
    "category": "green",
    "imageUrl": "/images5/products/artichoke_green.jpg",
    "description": "Most people will describe green tea, in general, as being very 'vegetal.' Usually, that means grass, spinach, asparagus... and quite often, artichoke. Considering the culinary appeal sweet and savory artichokes already enjoy, we thought it would be a natural pairing. Complex and slightly different, with a fresh, toasty and buttery aroma, slightly dry finish and rounded, gently cooked greens flavor. Listen to mom - enjoy your veggies!",
    "name": "artichoke green",
    "score": 92,
    "thumbUrl": "/images5/products_index/artichoke_green.jpg",
    "url": "/green/artichoke_green.html",
    "steepInfo": "Steep at 180&deg; for 2-3 minutes."
  },
  {
    "category": "green",
    "imageUrl": "/images5/products/silver_sprout.jpg",
    "description": "Fine twisted young leaf that resembles a chun mee style but interspersed with silvery down covered buds.  The aroma is quietly floral but gives way to a smokiness, reminicent of a gunpowder but not nearly as bold. The cup is light, yet smoky  with a semi buttery mouthfeel. In the finish a dry white grape note, and lingering smoke.",
    "name": "silver sprout",
    "score": 88,
    "thumbUrl": "/images5/products_index/silver_sprout.jpg",
    "url": "/green/silver_sprout.html",
    "steepInfo": "Steep at 180&deg; for 3 minutes."
  },
  {
    "category": "green",
    "imageUrl": "/images5/products/pi_lo_chun.jpg",
    "description": "Green tea from the Jiangsu province of China. Pi Lo Chun (sometimes written biluochun) is made from the finest tender buds, gathered and processed exclusively by hand. Perfumy and sweet floral, with a full body and slight earthiness. Lingering, aromatic finish and interestingly floral-smoky. Pi Lo Chun is known for having a very distinct character; you'll find ours to be quite friendly to the palate and savory. Enjoy!",
    "name": "pi lo chun",
    "score": 0,
    "thumbUrl": "/images5/products_index/pi_lo_chun.jpg",
    "url": "/green/pi_lo_chun.html",
    "steepInfo": "Steep at 180&deg; for 2 minutes."
  },
  {
    "category": "green",
    "imageUrl": "/images5/products/white_monkey.jpg",
    "description": "White Monkey or Bai Mao Hou is a green tea (do not be confused by its name) that grows along the slopes of the Taimu mountains in the Fujian province of China. The young leaves and unopened buds are carefully gathered and processed exclusively by hand. The result is a tea that appears intricately woven with large and beautiful white tips looking like white-haired monkey's paws, hence the name. It produces a warm colored cup, fresh and subtly seaweedy aroma infused with delicate sweetness and a slightly dry finish.",
    "name": "white monkey",
    "score": 0,
    "thumbUrl": "/images5/products_index/white_monkey.jpg",
    "url": "/green/white_monkey.html",
    "steepInfo": "Steep at 180&deg; for 2 minutes."
  },
  {
    "category": "herbal",
    "imageUrl": "/images5/products/blood_orange.jpg",
    "description": "The blood orange is a culinary favorite, with its deep vibrant color and sweet, tangy flavor. A perfect ingredient for a refreshing herbal blend! Our Blood Orange tea pairs blood orange peels with hibiscus flowers and rose hips for a naturally sweet, caffeine-free flavor. Rich, hearty and tangy, with a good balance of orange peel dryness and fruit juiciness.",
    "name": "blood orange",
    "score": 94,
    "thumbUrl": "/images5/products_index/blood_orange.jpg",
    "url": "/herbal/blood_orange.html",
    "steepInfo": "Steep at 212&deg; for 5-10 minutes."
  },
  {
    "category": "herbal",
    "imageUrl": "/images5/products/chamomile.jpg",
    "description": "Our Chamomile tea is made of the finest chamomile flowers from the Nile River Valley in Egypt. Considered a remedy for all ills by the ancient Egyptians, this golden herb remains a modern favorite to promote calm and relieve anxiety. When steeped, these fragrant chamomile blossoms smell of freshly cut apples and produce a rich, golden cup with calming flavor and sweet, floral finish. Our Chamomile tea is made with whole flower pieces and produces a delicious, caffeine-free infusion. It may also be served with a dash of honey.",
    "name": "chamomile",
    "score": 96,
    "thumbUrl": "/images5/products_index/chamomile.jpg",
    "url": "/herbal/chamomile.html",
    "steepInfo": "Steep at 212&deg; for 5-10 minutes."
  },
  {
    "category": "herbal",
    "imageUrl": "/images5/products/wild_strawberry.jpg",
    "description": "Even when the strawberry harvest is waning for the year, our Wild Strawberry herbal blend will have you smiling like the first pick of the season. Fresh strawberries, apple pieces, hibiscus flowers and rose hips create a mellow, almost dessert-like tea. Sweet strawberry and sugared rhubarb aroma, beautiful warm berry color, pleasantly aromatic and not super sweet. A caffeine-free cup of pure delight.",
    "name": "wild strawberry",
    "score": 94,
    "thumbUrl": "/images5/products_index/wild_strawberry.jpg",
    "url": "/herbal/wild_strawberry.html",
    "steepInfo": "Steep at 212&deg; for 5-10 minutes."
  },
  {
    "category": "herbal",
    "imageUrl": "/images5/products/peppermint.jpg",
    "description": "A native of the Mediterranean, peppermint leaves were often used to crown luminaries in ancient Greece and Rome. It continues to be revered for its cooling, crisp aroma, deeply refreshing flavor and smooth finish. If you have yet to try gourmet peppermint tea, made from just pure peppermint (no added oils or sweeteners), you'll be pleasantly surprised by its superior flavor.",
    "name": "peppermint",
    "score": 97,
    "thumbUrl": "/images5/products_index/peppermint.jpg",
    "url": "/herbal/peppermint.html",
    "steepInfo": "Steep at 212&deg; for 5-10 minutes."
  },
  {
    "category": "herbal",
    "imageUrl": "/images5/products/berry_blast.jpg",
    "description": "Berry Blast is a delicious blend of natural fruits and spices that brews up a mouthwatering cup of herbal tea. Entirely caffeine-free, this blend holds a special appeal for kids and sweet-toothed adults. The flavor is all natural, emanating from black currants, cranberries, raspberries, elderberries, bilberries, hibiscus flowers and rose hip peels. The cup has a bold and slightly tart flavor, with a juicy clean finish.",
    "name": "berry blast",
    "score": 94,
    "thumbUrl": "/images5/products_index/berry_blast.jpg",
    "url": "/herbal/berry_blast.html",
    "steepInfo": "Steep at 212&deg; for 5-10 minutes."
  },
  {
    "category": "herbal",
    "imageUrl": "/images5/products/foxtrot.jpg",
    "description": "Like the dance that inspired its name, our Foxtrot tea is an overnight success that will leave you giddy with joy. It is an herbal cocktail of Egyptian chamomile, South African rooibos (with a touch of vanilla) and fresh peppermint. A soothing blend of familiar tastes that produces a pleasantly original combination. It's entirely caffeine-free, but you'll still have a spring in your step from the delightful, delicately clean and sweet flavor.",
    "name": "foxtrot",
    "score": 96,
    "thumbUrl": "/images5/products_index/foxtrot.jpg",
    "url": "/herbal/foxtrot.html",
    "steepInfo": "Steep at 212&deg; for 5-10 minutes."
  },
  {
    "category": "herbal",
    "imageUrl": "/images5/products/cha_cha.jpg",
    "description": "Much like the Cuban dance for which it is named, famous for its three quick steps ('cha-cha-cha'), Cha Cha deliciously mingles chamomile, peppermint and lemongrass into a wonderful herbal concoction sure to send your taste buds dancing with delight. Zesty flavor, layered in aromatics: cool earthiness from the mint, sweet, uplifting floral from the chamomile and lemongrass. This cup has a lot of depth. Enjoy any time of the day - this blend is naturally caffeine-free.",
    "name": "cha cha",
    "score": 95,
    "thumbUrl": "/images5/products_index/cha_cha.jpg",
    "url": "/herbal/cha_cha.html",
    "steepInfo": "Steep at 212&deg; for 5-10 minutes."
  },
  {
    "category": "herbal",
    "imageUrl": "/images5/products/watermelon_cooler.jpg",
    "description": "Sweet, juicy and refreshing - these are the thoughts that come to mind when thinking of watermelon. Sips of our Watermelon Cooler will invoke the same delightful sensations.  The sweetness of watermelon and the lively notes of cranberries and hibiscus when iced make this a perfect poolside treat. Add a pinch of mint or a twist of lime to create a tasty watermelon mocktail.",
    "name": "watermelon cooler",
    "score": 94,
    "thumbUrl": "/images5/products_index/watermelon_cooler.jpg",
    "url": "/herbal/watermelon_cooler.html",
    "steepInfo": "Steep at 212&deg; for 5-10 minutes."
  },
  {
    "category": "herbal",
    "imageUrl": "/images5/products/raspberry_patch.jpg",
    "description": "Raspberry is a complex flavor. It can be more sweet than tart, warm and chewy like a jam, or a fruit-floral accent. This blend plays to all of those nuances. Fresh raspberries, apple pieces, rose hips and hibiscus come together to tell the story of a raspberry. Zesty, tart and slightly sweet. A balanced cup that, because it's caffeine free, you can enjoy anytime.",
    "name": "raspberry patch",
    "score": 95,
    "thumbUrl": "/images5/products_index/raspberry_patch.jpg",
    "url": "/herbal/raspberry_patch.html",
    "steepInfo": "Steep at 212&deg; for 5-10 minutes."
  },
  {
    "category": "herbal",
    "imageUrl": "/images5/products/fruit_medley.jpg",
    "description": "Fruit Medley is a jammy sweet mix of strawberry, hibiscus flowers, apples, rose hips and lemongrass. Deep, rich fruity flavor, sweet-spicy aroma, full bodied and refreshing. Gentle herb notes help lighten up the fruitiness and give the cup some bounce. Completely caffeine free with no sugar or other sweeteners.",
    "name": "fruit medley",
    "score": 93,
    "thumbUrl": "/images5/products_index/fruit_medley.jpg",
    "url": "/herbal/fruit_medley.html",
    "steepInfo": "Steep at 212&deg; for 5-10 minutes."
  },
  {
    "category": "herbal",
    "imageUrl": "/images5/products/lemon_grass.jpg",
    "description": "A native of Southeast Asia, lemon grass was introduced to the American palate with the growing popularity of Thai cuisine. It has a delicate Meyer lemon taste, with slight hint of sweet ginger, and very aromatic floral fragrance. Smooth and fragrant when steeped as a simple cup of tea, soft mouthfeel and clean finish. Greatly uplifting, yet naturally caffeine free.",
    "name": "lemon grass",
    "score": 93,
    "thumbUrl": "/images5/products_index/lemon_grass.jpg",
    "url": "/herbal/lemon_grass.html",
    "steepInfo": "Steep at 212&deg; for 5-10 minutes."
  },
  {
    "category": "herbal",
    "imageUrl": "/images5/products/pina_colada.jpg",
    "description": "From the sweet aroma to the beautiful rose colored cup, this tropical favorite will have you counting the days until your next island getaway. A mouthwatering blend of ripe pineapple, coconut, fresh apples, rose hips and tangy hibiscus. Fruit flavor with citrus notes and grounding sweetness from the coconut. Completely caffeine free, with no added sweeteners. There's a hammock in the shade that's calling your name...",
    "name": "pina colada",
    "score": 89,
    "thumbUrl": "/images5/products_index/pina_colada.jpg",
    "url": "/herbal/pina_colada.html",
    "steepInfo": "Steep at 212&deg; for 5-10 minutes."
  },
  {
    "category": "herbal",
    "imageUrl": "/images5/products/berry_blues.jpg",
    "description": "Just like the blues, this cup's got soul. A smooth and slightly tart blend of blueberries, apple pieces and hibiscus flowers. Sweet like a fresh blueberry pie, but without any added sugar or sweeteners. Good for kids or the kid at heart.",
    "name": "berry blues",
    "score": 94,
    "thumbUrl": "/images5/products_index/berry_blues.jpg",
    "url": "/herbal/berry_blues.html",
    "steepInfo": "Steep at 212&deg; for 5-10 minutes."
  },
  {
    "category": "herbal",
    "imageUrl": "/images5/products/spearmint.jpg",
    "description": "A native of the Mediterranean, spearmint was revered by ancient Romans for its ability to 'stir up the mind.' It continues to be savored for its refreshingly clear aroma and soothing qualities. If you find peppermint a bit too cool sometimes, spearmint is definitely for you. This herb has a rounded, slightly smoother and more grounded taste than peppermint, with warming and cooling notes. Very gentle to the palate, and naturally caffeine free.",
    "name": "spearmint",
    "score": 96,
    "thumbUrl": "/images5/products_index/spearmint.jpg",
    "url": "/herbal/spearmint.html",
    "steepInfo": "Steep at 212&deg; for 5-10 minutes."
  },
  {
    "category": "herbal",
    "imageUrl": "/images5/products/mango_melange.jpg",
    "description": "Fresh mango pieces, apple and hibiscus flowers come together for a tangy, fruity tropical blend. Deep, rosy red cup with a juicy texture and sweet, soft mango finish. Completely caffeine free and no sugar or other sweeteners. Summertime calls...",
    "name": "mango melange",
    "score": 91,
    "thumbUrl": "/images5/products_index/mango_melange.jpg",
    "url": "/herbal/mango_melange.html",
    "steepInfo": "Steep at 212&deg; for 5-10 minutes."
  },
  {
    "category": "herbal",
    "imageUrl": "",
    "description": "A wonderful introduction to the wide range of mate teas. Each sample makes about 6-8 cups of tea. This set includes (though subject to infrequent change):<br><br><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>citrus mate<\/FONT> - The herbal-grassy notes of Argentine Yerba Mate enhanced with the lively taste of ripe citrus fruits. Delicious hot or iced.<BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>mocha nut mate<\/FONT> - Our Brazilian toasted mate with its mellow chicoary notes enhanced with the indulgent flavors or chocolate and hazelnut.<BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>spiced mate<\/FONT> - Brazilian toasted mate blended with spices and citrus peels to add a little zest to an energizing brew. We find it perfect for chilly days.<BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>yerba mate<\/FONT> - Argentine Yerba Mate with lively, tangy, herbaceous notes. Faint hints of tobacco and grass. <BR><\/DIV>",
    "name": "mate sampler",
    "score": 90,
    "thumbUrl": "/images5/products_index/mate_sampler.jpg",
    "url": "/herbal/mate_sampler.html",
    "steepInfo": ""
  },
  {
    "category": "herbal",
    "imageUrl": "",
    "description": "A wonderful introduction to the wide range of herbal teas. Each sample makes about 6-8 cups of tea. This set includes (though subject to infrequent change):<br><br><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>berry blues<\/FONT> - Just like the blues, this cup's got soul. Smooth, slightly tart, with sweetness like fresh blueberry pie.<BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>blood orange<\/FONT> - Deep vibrant color and sweet flavor. Hearty with a good balance of orange peel dryness and fruit juiciness.<BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>raspberry patch<\/FONT> - Like fresh homemade jam: juicy and tart, slightly sweet, not overwhelmingly tangy and a lovely fragrance.<BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>sour apple<\/FONT> - A celebration of the apple! Sweetness like a candied apple, fresh tart-floral notes of crispy crab apples.<BR><\/DIV>",
    "name": "orchard sampler",
    "score": 93,
    "thumbUrl": "/images5/products_index/herbal_flavors_sampler.jpg",
    "url": "/herbal/herbal_flavors_sampler.html",
    "steepInfo": ""
  },
  {
    "category": "herbal",
    "imageUrl": "/images5/products/mocha_nut_mate.jpg",
    "description": "The mellow chicory-like character of our Brazilian toasted mate is a perfect platform for a favorite indulgence: chocolate! Add a bit of hazelnut and you have the perfect treat. Great straight up or enhanced with cream and sugar. If you're a fan of chocolate mate teas, we invite you to give this formula a try.  Please note that all Mate varieties contains caffeine; we would not suggest it as a nightcap.",
    "name": "mocha nut mate",
    "score": 91,
    "thumbUrl": "/images5/products_index/mocha_nut_mate.jpg",
    "url": "/herbal/mocha_nut_mate.html",
    "steepInfo": "Steep at 150&deg; for 3-5 minutes."
  },
  {
    "category": "herbal",
    "imageUrl": "/images5/products/sour_apple.jpg",
    "description": "A celebration of the apple! Fresh apple pieces, hibiscus flowers and rose hips create a slightly tangy, juicy treat. Sweetness like a candied apple, fresh tart-floral notes of crispy crab apples. A delightfully refreshing cup, naturally caffeine free and with no sugar or other sweeteners.",
    "name": "sour apple",
    "score": 92,
    "thumbUrl": "/images5/products_index/sour_apple.jpg",
    "url": "/herbal/sour_apple.html",
    "steepInfo": "Steep at 212&deg; for 5-10 minutes."
  },
  {
    "category": "herbal",
    "imageUrl": "",
    "description": "A wonderful introduction to the wide range of herbal teas. Each sample makes about 6-8 cups of tea. This set includes (though subject to infrequent change):<br><br><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>lemon grass<\/FONT> - Native of Southeast Asia, with delicate Meyer lemon flavor, hint of sweet ginger and uplifting floral aroma.<BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>chamomile<\/FONT> - A beloved herb from Egypt's Nile River Valley. Aroma of freshly cut apples, calming floral-sweet flavor.<BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>peppermint<\/FONT> - A native of the Mediterranean, revered for its cool, crisp aroma, deeply fresh flavor and smooth finish.<BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>spearmint<\/FONT> - Refreshingly clear, soothing aroma. Slightly smoother, more grounded than peppermint, gentle to the palate.<BR><\/DIV>",
    "name": "garden sampler",
    "score": 94,
    "thumbUrl": "/images5/products_index/herbal_sampler.jpg",
    "url": "/herbal/herbal_sampler.html",
    "steepInfo": ""
  },
  {
    "category": "herbal",
    "imageUrl": "/images5/products/spiced_mate.jpg",
    "description": "Brazilian toasted mate blended with spices and citrus peels to add a little zest to an energizing brew. We find it perfect for chilly days, by the fire or iced with milk and sugar for when you crave a sweet treat. Please note that all Mate varieties contains caffeine; we would not suggest it as a nightcap.",
    "name": "spiced mate",
    "score": 90,
    "thumbUrl": "/images5/products_index/spiced_mate.jpg",
    "url": "/herbal/spiced_mate.html",
    "steepInfo": "Steep at 150&deg; for 3-5 minutes."
  },
  {
    "category": "herbal",
    "imageUrl": "/images5/products/dewy_cherry.jpg",
    "description": "Cherry pie, anyone? This delicious blend of sour cherries, apples, orange peels, rosehips and hibiscus flowers is an easy stand-in for dessert any day. Cheeky sweet and tart, with a clean finish. Naturally sweet and caffeine free.",
    "name": "dewy cherry",
    "score": 91,
    "thumbUrl": "/images5/products_index/dewy_cherry.jpg",
    "url": "/herbal/dewy_cherry.html",
    "steepInfo": "Steep at 212&deg; for 5-10 minutes."
  },
  {
    "category": "herbal",
    "imageUrl": "/images5/products/yerba_mate.jpg",
    "description": "Long hailed in South American countries as a healthy, energizing social beverage, Yerba Mate is finding a new audience in North America. Notable is its ability to provide energy without the jitteriness suffered by coffee imbibers.<br><br>",
    "name": "yerba mate",
    "score": 92,
    "thumbUrl": "/images5/products_index/yerba_mate.jpg",
    "url": "/herbal/yerba_mate.html",
    "steepInfo": "Steep at 150&deg; for 3-5 minutes."
  },
  {
    "category": "herbal",
    "imageUrl": "/images5/products/mango_mate.jpg",
    "description": "Long hailed in South American countries, Yerba Mate is finding a new audience in North America. It provides energy without the jitteriness suffered by coffee imbibers. Argentine Yerba Mate herbaceous and grassy character dances with succulent mangoes for a fun-filled cup that is great hot or iced.<br><br>",
    "name": "mango mate",
    "score": 90,
    "thumbUrl": "/images5/products_index/mango_mate.jpg",
    "url": "/herbal/mango_mate.html",
    "steepInfo": "Steep at 150&deg; for 3-5 minutes."
  },
  {
    "category": "herbal",
    "imageUrl": "/images5/products/citrus_mate.jpg",
    "description": "Energizing Argentine Yerba Mate blended with the refreshing taste of citrus fruits. Enjoyed hot or iced it is sure to please mate fans with its lively character and renew your zest for life. Please note that all Mate varieties contains caffeine; we would not suggest it as a nightcap.",
    "name": "citrus mate",
    "score": 93,
    "thumbUrl": "/images5/products_index/citrus_mate.jpg",
    "url": "/herbal/citrus_mate.html",
    "steepInfo": "Steep at 150&deg; for 3-5 minutes."
  },
  {
    "category": "herbal",
    "imageUrl": "/images5/products/toasted_mate.jpg",
    "description": "Long hailed in South American countries as a healthy, energizing social beverage, Yerba Mate is finding a new audience in North America. Notable is its ability to provide energy without the jitteriness suffered by coffee imbibers.<br><br>",
    "name": "toasted mate",
    "score": 91,
    "thumbUrl": "/images5/products_index/toasted_mate.jpg",
    "url": "/herbal/toasted_mate.html",
    "steepInfo": "Steep at 150&deg; for 3-5 minutes."
  },
  {
    "category": "rooibos",
    "imageUrl": "/images5/products/rooibos_vanilla.jpg",
    "description": "Our Rooibos Vanilla combines the rich and warm dark sugar aroma of vanilla with mellow and grounding organic Rooibos herb from South Africa. Soothing, sweet and very 'beany' vanilla fragrance (like warm sugar cookies made with fresh vanilla beans). Naturally caffeine free!",
    "name": "rooibos vanilla",
    "score": 94,
    "thumbUrl": "/images5/products_index/rooibos_vanilla.jpg",
    "url": "/rooibos/rooibos_vanilla.html",
    "steepInfo": "Steep at 212&deg; for 5 minutes."
  },
  {
    "category": "rooibos",
    "imageUrl": "/images5/products/green_rooibos_bonita.jpg",
    "description": "Light bodied with a natural subtle sweetness, green rooibos plays well with a variety of flavors. This summer fruit inspired blend of organic green rooibos with peaches, strawberries and citrus is juicy, nectar-like and supremely refreshing. This \"palate pretty\" medley of flavors is muy delicioso; hot or iced and naturally caffeine-free.",
    "name": "green rooibos bonita",
    "score": 95,
    "thumbUrl": "/images5/products_index/green_rooibos_bonita.jpg",
    "url": "/rooibos/green_rooibos_bonita.html",
    "steepInfo": "Steep at 212&deg; for 5 minutes."
  },
  {
    "category": "rooibos",
    "imageUrl": "/images5/products/rooibos.jpg",
    "description": "Rooibos, colloquially known as 'Red Tea' (although not from the actual tea bush), is a naturally caffeine-free herbal plant that grows only in South Africa. A flavorful alternative for those seeking a stimulant free beverage, our certified organic rooibos is fruity, sweet, rounded, mild and smooth with a refreshingly herbal texture. Very forgiving, it will not oversteep and blends well with other flavors such as nuts, herbs and fruits.",
    "name": "rooibos",
    "score": 92,
    "thumbUrl": "/images5/products_index/rooibos.jpg",
    "url": "/rooibos/rooibos.html",
    "steepInfo": "Steep at 212&deg; for 5 minutes."
  },
  {
    "category": "rooibos",
    "imageUrl": "/images5/products/honeybush_vanilla.jpg",
    "description": "Our Honeybush Vanilla combines the rich, warm dark sugar aroma of vanilla with the honeyed aroma and gentle earthy quality of organic Honeybush herb from South Africa. Soft, sweet and very 'beany' vanilla fragrance (like warm sugar cookies made with fresh vanilla beans). A comforting, caffeine free treat.",
    "name": "honeybush vanilla",
    "score": 92,
    "thumbUrl": "/images5/products_index/honeybush_vanilla.jpg",
    "url": "/rooibos/honeybush_vanilla.html",
    "steepInfo": "Steep at 212&deg; for 5 minutes."
  },
  {
    "category": "rooibos",
    "imageUrl": "/images5/products/honeybush.jpg",
    "description": "Honeybush is a sibling of Rooibos, cultivated in South Africa's Eastern Cape region. Its flowers smell of honey, earning this plant a sweet name. The taste of our organic honeybush tea is similar to that of rooibos, though arguably a little sweeter. Smooth, gentle roasty flavor and slightly fuller bodied than rooibos. Clean, refreshing finish and naturally caffeine free.",
    "name": "honeybush",
    "score": 91,
    "thumbUrl": "/images5/products_index/honeybush.jpg",
    "url": "/rooibos/honeybush.html",
    "steepInfo": "Steep at 212&deg; for 5 minutes."
  },
  {
    "category": "rooibos",
    "imageUrl": "/images5/products/green_rooibos.jpg",
    "description": "Green rooibos is harvested from the same South African plant as the traditional red rooibos but is processed differently. Whereas the red rooibos leaves are bruised and oxidized, the green rooibos leaves are specially treated to prevent oxidation, leaving them closer to their natural state. The resulting brew is lighter bodied, less citric-piney than red rooibos and delivers a woody-grassy cup with natural sweetness and fruit notes. This natural sweetness and low tannin content ensures a smooth, never bitter brew that requires little, if any, sweetener. Like red rooibos it is also naturally caffeine free and great plain or flavored, hot or iced for anytime enjoyment.",
    "name": "green rooibos",
    "score": 92,
    "thumbUrl": "/images5/products_index/green_rooibos.jpg",
    "url": "/rooibos/green_rooibos.html",
    "steepInfo": "Steep at 212&deg; for 5 minutes."
  },
  {
    "category": "rooibos",
    "imageUrl": "/images5/products/green_rooibos_blueberry.jpg",
    "description": "In recent years, blueberries have garnered much attention as a nutrient powerhouse. This may be so, but to us they are delicious little jewels that shine in our lightly fruity, caffeine-free green rooibos. We've added blueberries, cranberries, rosehips, hibiscus and raspberry leaves for a tasty, berry-licious treat.",
    "name": "green rooibos blueberry",
    "score": 95,
    "thumbUrl": "/images5/products_index/green_rooibos_blueberry.jpg",
    "url": "/rooibos/green_rooibos_blueberry.html",
    "steepInfo": "Steep at 212&deg; for 5 minutes."
  },
  {
    "category": "rooibos",
    "imageUrl": "",
    "description": "A wonderful introduction to the wide range of honeybush teas. Each sample makes about 8-10 cups of tea. This set includes (though subject to infrequent change):<br><br><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>honeybush hazelnut<\/FONT> - Mellow, sweet-toasty flavor of organic Honeybush herb from South Africa with hazelnuts. Creamy, cozy and nutty.<BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>honeybush vanilla<\/FONT> - Rich, warm vanilla with the honeyed aroma and gentle toasty quality of organic Honeybush herb from South Africa.<BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>honeybush<\/FONT> - Sweet, gently roasty and fuller bodied than rooibos. Clean, refreshing finish and naturally caffeine free. <BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>honeybush mango<\/FONT> - Naturally honeyed and delicately toasty organic Honeybush herb from South Africa with lush, softly floral mango.<BR><\/DIV>",
    "name": "honeybush sampler",
    "score": 93,
    "thumbUrl": "/images5/products_index/honeybush_sampler.jpg",
    "url": "/rooibos/honeybush_sampler.html",
    "steepInfo": ""
  },
  {
    "category": "rooibos",
    "imageUrl": "/images5/products/honeybush_hazelnut.jpg",
    "description": "Our Honeybush Hazelnut combines the mellow smoothness of organic honeybush tea with the cozy creaminess of hazelnuts. Very nutty and aromatic, slightly roasty with a rounded, sweet flavor. Lingering honey-roasted nut finish. A mellow, very well-blended cup of tea. Great with just a touch of brown sugar. Completely caffeine free.",
    "name": "honeybush hazelnut",
    "score": 92,
    "thumbUrl": "/images5/products_index/honeybush_hazelnut.jpg",
    "url": "/rooibos/honeybush_hazelnut.html",
    "steepInfo": "Steep at 212&deg; for 5 minutes."
  },
  {
    "category": "rooibos",
    "imageUrl": "/images5/products/rooibos_caramel.jpg",
    "description": "Depending on where you're from, you may either say 'car-a-mel' or 'CAR-mel.' Anyway you put it, though, this naturally caffeine-free treat with rich notes of caramel flavoring (that is sugar free!) is sure to have you saying, 'wow! that's good!' Soft and satiny, like a melty caramel. Rounded, sweet and mellow finish.",
    "name": "rooibos caramel",
    "score": 92,
    "thumbUrl": "/images5/products_index/rooibos_caramel.jpg",
    "url": "/rooibos/rooibos_caramel.html",
    "steepInfo": "Steep at 212&deg; for 5 minutes."
  },
  {
    "category": "rooibos",
    "imageUrl": "/images5/products/rooibos_cinnamon_apple.jpg",
    "description": "Like freshly baked apple pie, this blend of cinnamon, apples and Rooibos tea will send your tastebuds into overdrive. If you want to satisfy your sweet tooth without a guilty conscience, indulge in a cup for an after-dinner treat. Naturally caffeine-free.",
    "name": "rooibos cinnamon apple",
    "score": 92,
    "thumbUrl": "/images5/products_index/rooibos_cinnamon_apple.jpg",
    "url": "/rooibos/rooibos_cinnamon_apple.html",
    "steepInfo": "Steep at 212&deg; for 5 minutes."
  },
  {
    "category": "rooibos",
    "imageUrl": "",
    "description": "A wonderful introduction to the wide range of green rooibos teas. Each sample makes about 8-10 cups of tea. This set includes (though subject to infrequent change):<br><br><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>green rooibos key west<\/FONT> - Blend of sweet passionfruit, luscious mango and a hint of tangy apricot will whisk you away to sunny shores.<BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>green rooibos citron<\/FONT> - Citrus flavors of lemon and orange paired with the light bodied natural fruitiness of organic green rooibos.<BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>green rooibos bonita<\/FONT> - This summer fruit inspired blend of organic green rooibos with peaches, strawberries and citrus is juicy, nectar-like and refreshing.<BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>green rooibos<\/FONT> - Lighter bodied, less citric-piney than red rooibos, it delivers a woody-grassy cup with natural sweetness and fruit notes. <BR><\/DIV>",
    "name": "green rooibos sampler",
    "score": 95,
    "thumbUrl": "/images5/products_index/green_rooibos_sampler.jpg",
    "url": "/rooibos/green_rooibos_sampler.html",
    "steepInfo": ""
  },
  {
    "category": "rooibos",
    "imageUrl": "/images5/products/honeybush_chocolate.jpg",
    "description": "The finest chocolates are from Belgium, and the best chocolate teas are from Adagio. Our Honeybush Chocolate tea is a prime example, combining the smoothness of Honeybush with sinful aroma and taste of dark chocolate. Smooth, rich and luxurious, like a chocolate liquor. Decadent, divine and completely caffeine free.",
    "name": "honeybush chocolate",
    "score": 90,
    "thumbUrl": "/images5/products_index/honeybush_chocolate.jpg",
    "url": "/rooibos/honeybush_chocolate.html",
    "steepInfo": "Steep at 212&deg; for 5 minutes."
  },
  {
    "category": "rooibos",
    "imageUrl": "",
    "description": "A wonderful introduction to the wide range of rooibos teas. Each sample makes about 8-10 cups of tea. This set includes (though subject to infrequent change):<br><br><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>rooibos vanilla<\/FONT> - Rich vanilla and sweet, lightly fruity organic Rooibos herb. Warm sugar cookies, mellow flavor, smooth finish. Yum!<BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>rooibos earl grey<\/FONT> - Caffeine-free twist on a classic blend. Zesty citrus, but smoother and sweeter than traditional Earl Grey.<BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>rooibos<\/FONT> - Our certified organic rooibos is fruity, sweet, rounded, mild and smooth with a refreshingly herbal texture.<BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>rooibos mango<\/FONT> - A lush, fruity and mellow cup of caffeine-free goodness. Sweet organic rooibos herb and creamy, floral mango.<BR><\/DIV>",
    "name": "rooibos sampler",
    "score": 92,
    "thumbUrl": "/images5/products_index/rooibos_sampler.jpg",
    "url": "/rooibos/rooibos_sampler.html",
    "steepInfo": ""
  },
  {
    "category": "rooibos",
    "imageUrl": "/images5/products/rooibos_lemon_cloud.jpg",
    "description": "The lemon is such a universal fruit with so many uses. Arguably two of its best applications are desserts and tea. We have combined the tangy citrus flavor with creamy vanilla and a hint of lemongrass. Soft, fluffy, lemon cream taste and naturally caffeine-free. Soothing and uplifting; dreamy and dessert-like.",
    "name": "rooibos lemon cloud",
    "score": 92,
    "thumbUrl": "/images5/products_index/rooibos_lemon_cloud.jpg",
    "url": "/rooibos/rooibos_lemon_cloud.html",
    "steepInfo": "Steep at 212&deg; for 5 minutes."
  },
  {
    "category": "rooibos",
    "imageUrl": "/images5/products/honeybush_orange.jpg",
    "description": "A juicy cup of herbal sunshine, sweet and refreshing like freshly squeezed OJ. The orange flavor balances the honey sweetness. Our Honeybush Orange makes the perfect partner for your morning meal. Completely caffeine free, so treat yourself to a cup in the evening, too.",
    "name": "honeybush orange",
    "score": 93,
    "thumbUrl": "/images5/products_index/honeybush_orange.jpg",
    "url": "/rooibos/honeybush_orange.html",
    "steepInfo": "Steep at 212&deg; for 5 minutes."
  },
  {
    "category": "rooibos",
    "imageUrl": "/images5/products/rooibos_earl_grey.jpg",
    "description": "A classic blend with a twist, using organic South African Rooibos.  Zesty fresh citrus aroma, slightly dry, with a rounded and balanced orange rind flavor. Pleasantly smooth texture from the Rooibos (not as dry and brisk as traditional Earl Grey made from black tea). Lingering citrus sweetness. Naturally caffeine free.",
    "name": "rooibos earl grey",
    "score": 91,
    "thumbUrl": "/images5/products_index/rooibos_earl_grey.jpg",
    "url": "/rooibos/rooibos_earl_grey.html",
    "steepInfo": "Steep at 212&deg; for 5 minutes."
  },
  {
    "category": "rooibos",
    "imageUrl": "/images5/products/green_rooibos_key_west.jpg",
    "description": "Green rooibos is a lighter bodied, un-oxidized version of the traditional \"red tea.\" Its natural fruitiness is a perfect base for tropical flavors. Our Key West blend of sweet passionfruit, luscious mango and a hint of tangy apricot will whisk you away to the sunny shores and ocean breezes of Papa's paradise.  Naturally caffeine-free for your \"Sunset Celebration.\"",
    "name": "green rooibos key west",
    "score": 94,
    "thumbUrl": "/images5/products_index/green_rooibos_key_west.jpg",
    "url": "/rooibos/green_rooibos_key_west.html",
    "steepInfo": "Steep at 212&deg; for 5 minutes."
  },
  {
    "category": "rooibos",
    "imageUrl": "/images5/products/rooibos_almond.jpg",
    "description": "Combining savory almond flavor with the bright, sweet taste of organic Rooibos herbal tea. Smooth and almost marzipan sweet, with a soft clean finish. Our Rooibos Almond is great on its own, as well as the perfect, mellow dessert complement. Naturally caffeine free.",
    "name": "rooibos almond",
    "score": 92,
    "thumbUrl": "/images5/products_index/rooibos_almond.jpg",
    "url": "/rooibos/rooibos_almond.html",
    "steepInfo": "Steep at 212&deg; for 5 minutes."
  },
  {
    "category": "rooibos",
    "imageUrl": "/images5/products/honeybush_mango.jpg",
    "description": "A lush, fruity and mellow cup of caffeine-free goodness. The tropical aroma pairs perfectly with the naturally honeyed and delicately earthy organic honeybush herb from South Africa. A rounded, balanced experience. Juicy and soft, with an airy finish. A lovely tropical escape any time of day, or season!",
    "name": "honeybush mango",
    "score": 93,
    "thumbUrl": "/images5/products_index/honeybush_mango.jpg",
    "url": "/rooibos/honeybush_mango.html",
    "steepInfo": "Steep at 212&deg; for 5 minutes."
  },
  {
    "category": "rooibos",
    "imageUrl": "/images5/products/rooibos_jasmine.jpg",
    "description": "Organic Rooibos herbal tea from South Africa infused with the delicate scent of night-blooming jasmine flowers. If you enjoy classic jasmine tea, keep this one on hand, too, for when you need a caffeine-free treat. Mellow and smooth, delicately sugary notes from the Rooibos. Lingering airy jasmine fragrance, like fine Jasmine Pearl tea (which tends to be more delicate and lightly perfumy). Rounded, fresh finish.",
    "name": "rooibos jasmine",
    "score": 91,
    "thumbUrl": "/images5/products_index/rooibos_jasmine.jpg",
    "url": "/rooibos/rooibos_jasmine.html",
    "steepInfo": "Steep at 212&deg; for 5 minutes."
  },
  {
    "category": "rooibos",
    "imageUrl": "/images5/products/rooibos_peach.jpg",
    "description": "In the famous poem 'The Love Song of J. Alfred Prufrock', T.S. Eliot wrote, 'do I dare to eat a peach?' The literary-minded folks at Adagio have taken it upon themselves to provide Mr. Eliot with an answer: no need to eat one. Just steep a cup of our delicately sweet and smooth organic Rooibos herb, paired with succulent peach flavor. Fragrant, juicy and fruit-floral. Please, be a peach. Give this tea a try. Naturally caffeine free!",
    "name": "rooibos peach",
    "score": 92,
    "thumbUrl": "/images5/products_index/rooibos_peach.jpg",
    "url": "/rooibos/rooibos_peach.html",
    "steepInfo": "Steep at 212&deg; for 5 minutes."
  },
  {
    "category": "rooibos",
    "imageUrl": "/images5/products/green_rooibos_citron.jpg",
    "description": "Citrus flavors of lemon and orange paired with the light bodied natural fruitiness of organic green rooibos will carry you away to orange groves and lemon trees. Great hot or iced this naturally caffeine-free juicy, uplifting blend will bring a ray of sunshine to your cup.",
    "name": "green rooibos citron",
    "score": 96,
    "thumbUrl": "/images5/products_index/green_rooibos_citron.jpg",
    "url": "/rooibos/green_rooibos_citron.html",
    "steepInfo": "Steep at 212&deg; for 5 minutes."
  },
  {
    "category": "rooibos",
    "imageUrl": "/images5/products/rooibos_cocomint.jpg",
    "description": "Like wine and cheese or burgers and fries, chocolate and mint is a perfect partnership. We bring that popular flavor combination here, blended with Rooibos herbal tea from South Africa to create a delicious, lip-smacking treat. Smooth and slightly cooling, not unlike chocolate peppermint bark candy. Naturally caffeine free.",
    "name": "rooibos cocomint",
    "score": 91,
    "thumbUrl": "/images5/products_index/rooibos_cocomint.jpg",
    "url": "/rooibos/rooibos_cocomint.html",
    "steepInfo": "Steep at 212&deg; for 5 minutes."
  },
  {
    "category": "rooibos",
    "imageUrl": "/images5/products/rooibos_mango.jpg",
    "description": "A lush, fruity and mellow cup of caffeine free goodness. The tropical aroma pairs perfectly with the naturally sweet organic rooibos. Delicate deep fruity notes from the rooibos, against the creamy texture and floral nose of the mango. Juicy and soft, dry finish. A lovely tropical escape any time of day, or season!",
    "name": "rooibos mango",
    "score": 91,
    "thumbUrl": "/images5/products_index/rooibos_mango.jpg",
    "url": "/rooibos/rooibos_mango.html",
    "steepInfo": "Steep at 212&deg; for 5 minutes."
  },
  {
    "category": "rooibos",
    "imageUrl": "/images5/products/honeybush_apricot.jpg",
    "description": "Imagine being whisked away to an fragrant, fresh apricot orchard... That's the sensation you'll get with each sip of our delectable Honeybush Apricot herbal tea. It combines the soft flavor of ripe apricots with the smooth, roasted flavor of sweet Honeybush tea. Soft, mellow mouthfeel and balanced crispness. Completely caffeine free.",
    "name": "honeybush apricot",
    "score": 93,
    "thumbUrl": "/images5/products_index/honeybush_apricot.jpg",
    "url": "/rooibos/honeybush_apricot.html",
    "steepInfo": "Steep at 212&deg; for 5 minutes."
  },
  {
    "category": "rooibos",
    "imageUrl": "/images5/products/rooibos_berry.jpg",
    "description": "Rooibos is a very mellow cup on its own, with some subtle, deep fruity notes. This comes from the sun-curing process the fresh herb goes through during harvest. Paired with ripe summer berries, our Rooibos Berry tea is soft and juicy. Not heavy or tangy, so you can enjoy it anytime. Naturally caffeine free.",
    "name": "rooibos berry",
    "score": 87,
    "thumbUrl": "/images5/products_index/rooibos_berry.jpg",
    "url": "/rooibos/rooibos_berry.html",
    "steepInfo": "Steep at 212&deg; for 5 minutes."
  },
  {
    "category": "rooibos",
    "imageUrl": "/images5/products/rooibos_orange.jpg",
    "description": "A juicy cup of herbal sunshine, sweet and refreshing as a glass of freshly squeezed OJ. The slight dryness of the Florida orange flavor balances with the naturally sweet, mellow and mineral rooibos. Our organic Rooibos blended with fresh orange flavor makes the perfect partner for your morning meal. Because it's completely caffeine free, you can enjoy another cup in the evening, too.",
    "name": "rooibos orange",
    "score": 90,
    "thumbUrl": "/images5/products_index/rooibos_orange.jpg",
    "url": "/rooibos/rooibos_orange.html",
    "steepInfo": "Steep at 212&deg; for 5 minutes."
  },
  {
    "category": "rooibos",
    "imageUrl": "/images5/products/rooibos_tropics.jpg",
    "description": "Get swept away to paradise with this wonderful blend of organic Rooibos herbal tea and the tropical flavors of coconut and pineapple. Even on a dreary, cold day you can be transported to a sunny beach by enjoying this unique, naturally caffeine-free blend hot or iced. Time for a lounge in the warm sun patch...",
    "name": "rooibos tropics",
    "score": 88,
    "thumbUrl": "/images5/products_index/rooibos_tropics.jpg",
    "url": "/rooibos/rooibos_tropics.html",
    "steepInfo": "Steep at 212&deg; for 5 minutes."
  },
  {
    "category": "decaf",
    "imageUrl": "/images5/products/decaf_ceylon.jpg",
    "description": "Classic black tea from the island of Sri Lanka. Clean, tangy aroma, medium body, with sweet citrus notes like mandarin, and refreshing astringency. A gentle, natural decaffeination process retains the delicate shape and flavor of the tea leaves.",
    "name": "decaf ceylon",
    "score": 93,
    "thumbUrl": "/images5/products_index/decaf_ceylon.jpg",
    "url": "/decaf/decaf_ceylon.html",
    "steepInfo": "Steep at 212&deg; for 3-5 minutes."
  },
  {
    "category": "decaf",
    "imageUrl": "/images5/products/decaf_earl_grey.jpg",
    "description": "Decaf blend of tangy Ceylon black tea, flavored with bergamot - a citrus fruit. Makes a zesty cup of tea, both hot and iced.  A gentle, natural decaffeination process retains the delicate shape and flavor of the tea leaves.",
    "name": "decaf earl grey",
    "score": 94,
    "thumbUrl": "/images5/products_index/decaf_earl_grey.jpg",
    "url": "/decaf/decaf_earl_grey.html",
    "steepInfo": "Steep at 212&deg; for 3 minutes."
  },
  {
    "category": "decaf",
    "imageUrl": "/images5/products/decaf_vanilla.jpg",
    "description": "Adagio's Decaf Vanilla Black combines the pure, sugary-spicy flavor of vanilla with bright Ceylon black tea from Sri Lanka. Soothing, sweet and very 'beany' vanilla fragrance (like warm sugar cookies made with fresh vanilla beans). Very well-blended and pleasant astringency in the finish. A gentle, natural decaffeination process retains the delicate shape and flavor of the tea leaves.",
    "name": "decaf vanilla",
    "score": 94,
    "thumbUrl": "/images5/products_index/decaf_vanilla.jpg",
    "url": "/decaf/decaf_vanilla.html",
    "steepInfo": "Steep at 212&deg; for 3 minutes."
  },
  {
    "category": "decaf",
    "imageUrl": "/images5/products/decaf_peach.jpg",
    "description": "Bright decaf Ceylon black tea flavored with ripe summer peaches. Sweet, syrupy peach fragrance, lingering floral aromas as you sip, pleasant astringency and 'peach fuzz' dryness. A gentle, natural decaffeination process retains the delicate shape and flavor of the tea leaves.",
    "name": "decaf peach",
    "score": 95,
    "thumbUrl": "/images5/products_index/decaf_peach.jpg",
    "url": "/decaf/decaf_peach.html",
    "steepInfo": "Steep at 212&deg; for 3 minutes."
  },
  {
    "category": "decaf",
    "imageUrl": "/images5/products/decaf_apricot.jpg",
    "description": "Our Decaf Apricot Black tea combines the sweet flavor of ripe summer apricots with the tangy bright taste of decaf Ceylon black tea. Soft, mellow mouthfeel, succulent flavor and balanced astringency. A gentle, natural decaffeination process retains the delicate shape and flavor of the tea leaves.",
    "name": "decaf apricot",
    "score": 95,
    "thumbUrl": "/images5/products_index/decaf_apricot.jpg",
    "url": "/decaf/decaf_apricot.html",
    "steepInfo": "Steep at 212&deg; for 3 minutes."
  },
  {
    "category": "decaf",
    "imageUrl": "",
    "description": "A wonderful introduction to the wide range of decaf black teas. Each sample makes about 8-10 cups of tea. This set includes (though subject to infrequent change):<br><br><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>decaf vanilla<\/FONT> - Decaf Ceylon black tea with pure vanilla. Soothing and cozy, like warm sugar cookies made with fresh vanilla beans.<BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>decaf tropics<\/FONT> - Bright decaf Ceylon tea flavored with coconuts and pineapple. Rounded body, gentle tang, delightfully sweet finish.<BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>decaf orange<\/FONT> - Brisk decaf black tea flavored with juicy oranges. Zesty orange rind dryness, hints of soft, sweet juice.<BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>decaf apricot<\/FONT> - The flavor of ripe apricots and bright decaf Ceylon tea. Soft mouthfeel, succulent flavor, balanced astringency.<BR><\/DIV>",
    "name": "decaf black sampler",
    "score": 92,
    "thumbUrl": "/images5/products_index/decaf_black_sampler.jpg",
    "url": "/decaf/decaf_sampler.html",
    "steepInfo": ""
  },
  {
    "category": "decaf",
    "imageUrl": "/images5/products/decaf_mango.jpg",
    "description": "Our Decaf Mango Black tea combines the natural citrusy quality of premium Ceylon black tea with the flavor of perfectly ripened mangoes. Juicy texture, creamy-dry finish with great floral aromatics and candy sweetness. A gentle, natural decaffeination process retains the delicate shape and flavor of the tea leaves.",
    "name": "decaf mango",
    "score": 94,
    "thumbUrl": "/images5/products_index/decaf_mango.jpg",
    "url": "/decaf/decaf_mango.html",
    "steepInfo": "Steep at 212&deg; for 3 minutes."
  },
  {
    "category": "decaf",
    "imageUrl": "/images5/products/decaf_strawberry.jpg",
    "description": "Succulent taste of strawberries with decaf Ceylon black tea. Fresh sweet-floral and berry flavor, smooth and sugary texture.  A gentle, natural decaffeination process retains the delicate shape and flavor of the tea leaves.",
    "name": "decaf strawberry",
    "score": 94,
    "thumbUrl": "/images5/products_index/decaf_strawberry.jpg",
    "url": "/decaf/decaf_strawberry.html",
    "steepInfo": "Steep at 212&deg; for 3 minutes."
  },
  {
    "category": "decaf",
    "imageUrl": "/images5/products/decaf_spice.jpg",
    "description": "Decaf Ceylon tea with fresh, herby-sweet spices. Balanced and warming. Perfect for newcomers to spiced tea. A gentle, natural decaffeination process retains the delicate shape and flavor of the tea leaves.",
    "name": "decaf spice",
    "score": 91,
    "thumbUrl": "/images5/products_index/decaf_spice.jpg",
    "url": "/decaf/decaf_spice.html",
    "steepInfo": "Steep at 212&deg; for 3 minutes."
  },
  {
    "category": "decaf",
    "imageUrl": "/images5/products/decaf_raspberry.jpg",
    "description": "Crisp decaf Ceylon tea with playful raspberry. Candy-like aroma, jammy flavor, tangy dry finish, not too 'cheeky.' A gentle, natural decaffeination process retains the delicate shape and flavor of the tea leaves.",
    "name": "decaf raspberry",
    "score": 94,
    "thumbUrl": "/images5/products_index/decaf_raspberry.jpg",
    "url": "/decaf/decaf_raspberry.html",
    "steepInfo": "Steep at 212&deg; for 3 minutes."
  },
  {
    "category": "decaf",
    "imageUrl": "/images5/products/decaf_orange.jpg",
    "description": "Brisk decaf black tea, flavored with juicy oranges. Zesty orange rind dry notes, with hints of soft, sweet juice. A gentle, natural decaffeination process retains the delicate shape and flavor of the tea leaves.",
    "name": "decaf orange",
    "score": 92,
    "thumbUrl": "/images5/products_index/decaf_orange.jpg",
    "url": "/decaf/decaf_orange.html",
    "steepInfo": "Steep at 212&deg; for 3 minutes."
  },
  {
    "category": "decaf",
    "imageUrl": "/images5/products/decaf_tropics.jpg",
    "description": "A blend of bright, citrusy decaf Ceylon black tea and the flavor of coconuts and pineapple. Rounded mouthfeel, gentle astringency, delightfully simple sweet finish. Soothing from start to finish. A gentle, natural decaffeination process retains the delicate shape and flavor of the tea leaves.",
    "name": "decaf tropics",
    "score": 88,
    "thumbUrl": "/images5/products_index/decaf_tropics.jpg",
    "url": "/decaf/decaf_tropics.html",
    "steepInfo": "Steep at 212&deg; for 3 minutes."
  },
  {
    "category": "decaf",
    "imageUrl": "/images5/products/decaf_blueberry.jpg",
    "description": "Decaf Ceylon tea with fresh blueberry flavor. Highly aromatic cup, with a slightly sweet and rounded texture.  A gentle, natural decaffeination process retains the delicate shape and flavor of the tea leaves.",
    "name": "decaf blueberry",
    "score": 92,
    "thumbUrl": "/images5/products_index/decaf_blueberry.jpg",
    "url": "/decaf/decaf_blueberry.html",
    "steepInfo": "Steep at 212&deg; for 3 minutes."
  },
  {
    "category": "masters",
    "imageUrl": "/images5/products/formosa_pouchong.jpg",
    "description": "A rare, very green oolong tea from Taiwan. Pouchong is the most lightly oxidized of all oolong teas - just 8-10%. In Taiwan, this tea is extremely valued and celebrated for its aroma - as one tea master said, 'if there's no fragrance, it's not worth the effort!' Our Masters Pouchong starts with a deep, inviting sugary-floral nose. The bright, pale golden-green liquor has a soft, melting butter texture, uplifting floral notes and mild, succulent flavor. True to its character, the sweetly complex floral nose lingers on long after the last sip. You'll definitely want to do a second steeping on this tea, as it will take another infusion for the leaves to fully unfurl and release their treasure.",
    "name": "formosa pouchong",
    "score": 97,
    "thumbUrl": "/images5/products_index/formosa_pouchong.jpg",
    "url": "/masters/formosa_pouchong.html",
    "steepInfo": ""
  },
  {
    "category": "masters",
    "imageUrl": "/images5/products/shizuoka_shincha.jpg",
    "description": "The Shinchas are here! The 2014 Shinchas are here! Each year, the first harvest of Japanese Green Tea is cause for celebration in Japan and among green tea lovers around the world.  All winter long the plants have been storing up nutrients to fight through the spring frost and sprout the first buds of the year. These precious leaves are extremely rare (especially outside of Japan) and widely considered to be the finest green teas in the world.  This year Adagio is proud to offer a very limited supply of premium, deep-steamed Shincha from the Shizuoka prefecture.  The brilliant, dark green, needle-like leaves of this incredible specialty deliver a fragrant aroma, translucent cup and a flavor profile that is surprisingly full bodied yet light, and sweet on the finish.",
    "name": "shizuoka shincha",
    "score": 93,
    "thumbUrl": "/images5/products_index/shizuoka_shincha.jpg",
    "url": "/masters/shizuoka_shincha.html",
    "steepInfo": "Steep at 170&deg; for 2 minutes."
  },
  {
    "category": "masters",
    "imageUrl": "/images5/products/formosa_ali_shan.jpg",
    "description": "Formosa Ali Shan is a beautiful green high mountain oolong tea from Taiwan. High altitude slows the growth of the tea plant, allowing more time for the leaves to develop great complexity and flavor. Formosa Ali Shan from our Masters Collection compares with the best Dong Dings. Deeply perfumy, buttery and intoxicating floral aroma, the mark of an excellent green oolong. Honeysuckle and lilacs. The golden-green liquor of this Ali Shan yields a layered, delicately creamy cup, with notes of warmed sugar. A just barely dry finish, more of an airy evaporating sensation. Prolong the dream with multiple, short infusions of this very fine Ali Shan oolong.",
    "name": "formosa ali shan",
    "score": 97,
    "thumbUrl": "/images5/products_index/formosa_ali_shan.jpg",
    "url": "/masters/formosa_ali_shan.html",
    "steepInfo": ""
  },
  {
    "category": "masters",
    "imageUrl": "/images5/products/yunnan_golden_pu_erh.jpg",
    "description": "One of the five main types of tea (white, green, oolong and black being the others), pu'erh tea stands apart with its uncommonly soft earthy flavor and woodsy tones. Unlike all other teas, pu'erh (pronounced 'poo-err') is actually aged. The tea leaves go through a natural fermentation process before the tea is gently dried. This creates a cup with zero astringency and deep, rich body. Pu'erh is extraordinarily smooth and deeply refreshing. Our Masters Pu'erh Gold (the shou variety of pu'erh) is a rare find, composed of long, golden leaf buds, very difficult to maintain through the aging process. Clean, damp forest aroma, with full flavors of mushrooms, roasted root vegetables, leather and earth. Mellow and grounding. If the flavor is too strong for you, simply dilute with water (which, interestingly, doesn't work for many other teas!) Pu'erh is extremely versatile - you can steep it for as little as 30 second or 30 minutes, whatever pleases your palate. It won't get bitter and is great for multiple infusions.",
    "name": "yunnan pu erh gold",
    "score": 90,
    "thumbUrl": "/images5/products_index/yunnan_golden_pu_erh.jpg",
    "url": "/masters/yunnan_golden_pu_erh.html",
    "steepInfo": ""
  },
  {
    "category": "masters",
    "imageUrl": "/images5/products/hsinchu_oriental_beauty.jpg",
    "description": "Beautiful leaves of white, green, yellow, red and brown make up this top grade Formosa Oriental Beauty oolong from Hsinchu County, in northwestern Taiwan. Highly oxidized, yet super smooth, the layered cup offers much to delight. Summer fruits like peach and nectarine, with a soft sweetness of honey and dwell in these leaves. Our Hsinchu Oriental Beauty bears a clean mouthfeel that gently reveals each nuance like an unfolding blossom, and a slight mineral finish.",
    "name": "hsinchu oriental beauty",
    "score": 95,
    "thumbUrl": "/images5/products_index/hsinchu_oriental_beauty.jpg",
    "url": "/masters/hsinchu_oriental_beauty.html",
    "steepInfo": ""
  },
  {
    "category": "masters",
    "imageUrl": "/images5/products/wuyi_da_hong_pao.jpg",
    "description": "Da Hong Pao, which means 'Big Red Robe', is a rare oolong tea from the WuYi Mountains in the Fujian province of China. WuYi 'rock' oolongs grow defiantly in the gaps of the mountain boulders, rendering cultivation both arduous and spellbindingly beautiful. These teas are highly prized for their 'yan yun' or 'rock taste', and only the real WuYi teas grown from these rocks - not teas from nearby hills or flatter landscapes - will have that mineral flavour. Premium grade WuYi Da Hong Pao from our Masters Collection offers rich aromas of roasted vegetables, sweet honey and wet river stones. The liquor takes this masterpiece one step further, with the color of warm peach brandy. Delicately spicy, robust and rounded texture, with pit-fruit flavors and subtle ripe peach juiciness. A truly thought-provoking cup.",
    "name": "wuyi da hong pao",
    "score": 95,
    "thumbUrl": "/images5/products_index/wuyi_da_hong_pao.jpg",
    "url": "/masters/wuyi_da_hong_pao.html",
    "steepInfo": ""
  },
  {
    "category": "masters",
    "imageUrl": "/images5/products/anhui_keemun.jpg",
    "description": "Keemun is a black tea from the Anhui province of China. Perhaps the most famous of Chinese varieties, prized for its toasty flavor, dark chocolate or red wine notes, mineral flinty sparks and sweetly smoky aroma. Anhui Keemun, our most prized Keemun from the Masters Collection, is a hand-made limited production. The tea brews to a fiery reddish brown color, with incense smokiness, deep brown sugar and a slight earthy fruitiness. Textured and layered mouthfeel with incredible depth: sweetness of dates or lychee fruit, brightness of fresh black pepper, warm fresh biscuits and smooth earthy cocoa notes. Soft, smoky finish and intriguing lingering fragrance. An extremely fine Keemun not to be missed!",
    "name": "anhui keemun",
    "score": 93,
    "thumbUrl": "/images5/products_index/anhui_keemun.jpg",
    "url": "/masters/anhui_keemun.html",
    "steepInfo": ""
  },
  {
    "category": "masters",
    "imageUrl": "/images5/products/darjeeling_spring_tip.jpg",
    "description": "Nestled in the slopes of the majestic Himalayas, Darjeeling is an Indian region famous for producing \"the Champagne of tea.\" Misty mountain air and loamy soil combine to create some of the world's finest teas. Tea aficionados eagerly await the spring harvest tea, with its lingering floral character and crisp, dry finish. Light-bodied, yet rich in flavor, our Darjeeling Spring Tip offers the essence of nature awakening. Crisp, floral and complex.",
    "name": "darjeeling spring tip",
    "score": 94,
    "thumbUrl": "/images5/products_index/darjeeling_spring_tip.jpg",
    "url": "/masters/darjeeling_spring_tip.html",
    "steepInfo": ""
  },
  {
    "category": "masters",
    "imageUrl": "/images5/products/yunnan_pu_erh_white.jpg",
    "description": "White buds from old Yunnan Pu Erh trees  are used to created this delicate new form of Pu Erh. While a 2012 harvest, these leaves are fermented in the traditional style but only using unopened fuzzy leaf buds. The result is a Silver Needle-like delicate cup but with notes of wildflower honey and classic Yunnan pepper.",
    "name": "yunnan pu erh white",
    "score": 96,
    "thumbUrl": "/images5/products_index/yunnan_pu_erh_white.jpg",
    "url": "/masters/yunnan_pu_erh_white.html",
    "steepInfo": ""
  },
  {
    "category": "masters",
    "imageUrl": "/images5/products/zhejiang_lung_ching.jpg",
    "description": "One of the most famous of all Chinese green teas, Lung Ching is available in a wide range of grades. This high grade is a fine plucking of young spring leaves, with a deliciously sweet aroma. Pan-firing in a hot wok brings out the classic warm, roasted chestnut notes inherent in the leaf and in this case a hint caramelized sugar and crisp floral essence. Complex and layered, yet subtle in the cup, mellow and softly sweet with a crisp finish.",
    "name": "zhejiang lung ching",
    "score": 88,
    "thumbUrl": "/images5/products_index/zhejiang_lung_ching.jpg",
    "url": "/masters/zhejiang_lung_ching.html",
    "steepInfo": ""
  },
  {
    "category": "masters",
    "imageUrl": "/images5/products/fujian_silver_needle.jpg",
    "description": "Our Masters Collection premium Silver Needle, or Bai Hao Yin Zhen, is made with fine silvery down bearing buds from carefully reared tea bushes in the Fuding area of Fujian, China. Hand picked, this precious white tea shows the care and skill of the proud farmers. In the cup, these extra fine Silver Needle buds offer a buttery-creamy mouthfeel and wonderfully sweet, honeydew melon notes with a creamy cucumber lingering finish.",
    "name": "fujian silver needle",
    "score": 96,
    "thumbUrl": "/images5/products_index/fujian_silver_needle.jpg",
    "url": "/masters/fujian_silver_needle.html",
    "steepInfo": ""
  },
  {
    "category": "masters",
    "imageUrl": "/images5/products/fujian_jasmine_pearl.jpg",
    "description": "A rare, hand-rolled green tea from the Fujian province of China, infused with the delicate scent of night-blooming jasmine. An incredibly fresh aroma drew us to these exceptional pearls. Each pearl is made up of just one bud and leaf set. Refined, clear and delicate floral fragrance, pleasantly soft texture and delicately dry finish. While the pearls themselves are not the largest or most evenly rolled we have seen, we could not pass up the complex elegance of this tea and its quietly hypnotic jasmine fragrance. A treat for the jasmine lover and connoisseur alike.",
    "name": "fujian jasmine pearl",
    "score": 0,
    "thumbUrl": "/images5/products_index/fujian_jasmine_pearl.jpg",
    "url": "/masters/fujian_jasmine_pearl.html",
    "steepInfo": ""
  },
  {
    "category": "masters",
    "imageUrl": "/images5/products/yunnan_teas_collection.jpg",
    "description": "The Yunnan province in China's southwestern edge holds a wealth of biodiversity in its slightly wild, highly mountainous terrain. Cradled among these natural treasures are teas revered for their sweetness, earthiness and smooth complexity. Fine fermented Pu'erh teas with their earthy richness speak of the mountains on which they grow while the precious golden buds of Dianhong, or Yunnan red tea, offer their own delicacy of diversity: spice, earth, fruit, cream and even hints of cocoa; offering a true excursion for those of an adventurous palate.",
    "name": "yunnan teas collection",
    "score": 0,
    "thumbUrl": "/images5/products_index/yunnan_teas_collection.jpg",
    "url": "/masters/yunnan_teas_collection.html",
    "steepInfo": ""
  },
  {
    "category": "masters",
    "imageUrl": "/images5/products/fujian_teas_collection.jpg",
    "description": "The rustic rocky hillsides and misty green mountains of Fujian province lend their terroir to the fine teas cultivated on their terraced slopes. Located on mainland China's southeast coast, Fujian is noted for the development of the processes that make white, oolong and black teas. Among these, the mineral or 'rock taste' of Wuyi oolong is highly prized as well as the soft, creamy melon notes of Silver Needle and the sweet, heady aroma of Jasmine Pearls. Each of these teas retains the essence of their celebrated ancestry and imparts it delicately into the cup.",
    "name": "fujian teas collection",
    "score": 0,
    "thumbUrl": "/images5/products_index/fujian_teas_collection.jpg",
    "url": "/masters/fujian_teas_collection.html",
    "steepInfo": ""
  },
  {
    "category": "masters",
    "imageUrl": "/images5/products/masters_sampler_1.jpg",
    "description": "Discover the sublime aroma and superior taste of our Masters Collection teas with a combination of samples that's priced 25% less than the cost of these teas purchased separately.  Enjoy the finest in tea with substantial savings and free shipping. This set includes (though subject to infrequent change):<br><br><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>fujian silver needle<\/FONT> - Buttery-creamy mouthfeel and a wonderfully sweet, honeydew melon note and a creamy cucumber lingering finish.<BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>fujian jasmine pearl<\/FONT> - Refined, clear and quietly hypnotic jasmine fragrance, pleasantly soft texture and delicately dry finish.<BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>wuyi da hong pao<\/FONT> - Rich aroma of roasted vegetables, sweet honey, river stones. Delicately spicy, rounded texture, and pit-fruit flavors.<BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>formosa ali shan<\/FONT> - Buttery and intoxicating floral aroma of honeysuckle and lilacs. Yields a layered, delicate cup, with notes of warmed sugar.<BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>formosa pouchong<\/FONT> - Inviting sugary-floral nose, the pale golden liquor yields a soft, melting butter texture and uplifting honeysuckle aroma.<BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>hsinchu oriental beauty<\/FONT> - Hsinchu Oriental beauty bears a clean mouthfeel that gently reveals each nuance like an unfolding blossom.<BR><\/DIV>",
    "name": "fujian & formosa sampler",
    "score": 0,
    "thumbUrl": "/images5/products_index/masters_sampler_1.jpg",
    "url": "/masters/masters_sampler_1.html",
    "steepInfo": ""
  },
  {
    "category": "masters",
    "imageUrl": "/images5/products/masters_sampler_2.jpg",
    "description": "Discover the sublime aroma and superior taste of our Masters Collection teas with a combination of samples that's priced 25% less than the cost of these teas purchased separately.  Enjoy the finest in tea with substantial savings and free shipping. This set includes (though subject to infrequent change):<br><br><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>fujian ti kuan yin<\/FONT> - This lightly oxidized tea yields a pale golden cup with a soft, buttery texture and orchid and honeydew melon notes.<BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>zhejiang lung ching<\/FONT> - Complex and layered, yet subtle in the cup, mellow and softly sweet with a crisp finish.<BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>yunnan pu erh gold<\/FONT> - Clean, damp forest aroma, with flavors of mushrooms, roasted root vegetables, leather and earth. Mellow and grounding.<BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>yunnan pu erh white<\/FONT> - Delicate cup with notes of wildflower honey and classic Yunnan pepper.<BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>yunnan golden curls<\/FONT> - Deeply layered cocoa and spice aromas. Creamy and savory flavor of warm toffee and sweet potatoes with a velvety finish.<BR><\/DIV><DIV STYLE=\"padding-bottom:5px;\"><FONT COLOR='#993300'>anhui keemun<\/FONT> - Incredible depth of flavor: dates and brown sugar sweetness, hints of cocoa powder, bright black pepper, and toasty biscuit finish.<BR><\/DIV>",
    "name": "yunnan & famous sampler",
    "score": 0,
    "thumbUrl": "/images5/products_index/masters_sampler_2.jpg",
    "url": "/masters/masters_sampler_2.html",
    "steepInfo": ""
  },
  {
    "category": "masters",
    "imageUrl": "/images5/products/famous_teas_collection.jpg",
    "description": "These select teas are among China's Famous Teas, which are those considered most eminent in their homeland. While available in a range of grades of varying quality, the very finest are highly prized and considered suitable as gifts for heads of state, royalty and other venerated posts. Each graciously offers its own gifts to the fortunate sipper in the form of classic character, layered texture and legendary craftsmanship.",
    "name": "famous teas collection",
    "score": 0,
    "thumbUrl": "/images5/products_index/famous_teas_collection.jpg",
    "url": "/masters/famous_teas_collection.html",
    "steepInfo": ""
  },
  {
    "category": "masters",
    "imageUrl": "/images5/products/formosa_teas_collection.jpg",
    "description": "Formosa is the name given to Taiwan in the 16th century by Portuguese explorers who found it to be a 'beautiful island' and named it thusly. The lovely, fragrant teas grown there still retain this eloquent name from long ago.  Taiwan is held in high esteem by the fine tea world for its complex, fragrant high mountain oolongs. They range from deeply roasted to very lightly oxidized and offer a vast range of palate experiences: rich mineral notes, complex fruitiness and ethereal floral essences.",
    "name": "formosa teas collection",
    "score": 0,
    "thumbUrl": "/images5/products_index/formosa_teas_collection.jpg",
    "url": "/masters/formosa_teas_collection.html",
    "steepInfo": ""
  },
  {
    "category": "masters",
    "imageUrl": "/images5/products/yunnan_golden_curls.jpg",
    "description": "A beautiful, rare black tea from the Yunnan province of China, the birthplace of all tea. Our hand-produced Masters Yunnan Golden Curls is composed exclusively of silky soft, golden leaf-buds with an unusual curled shape. Deeply layered with cocoa and spice notes, black pepper and raisins. Creamy and savory from the first whiff. The flavor and texture of the cup itself is just as complex, with warm toffee, sweet potatoes, and a velvety mouthfeel. Tremendous depth of flavor, a clean, mineral finish and lingering fragrance. Powdery soft astringency, like cocoa. Teas of this caliber are increasingly rare from Yunnan, so take time to appreciate these wonders of tea and the artisans who continue to craft them.",
    "name": "yunnan golden curls",
    "score": 0,
    "thumbUrl": "/images5/products_index/yunnan_golden_curls.jpg",
    "url": "/masters/yunnan_golden_curls.html",
    "steepInfo": ""
  },
  {
    "category": "masters",
    "imageUrl": "/images5/products/fujian_ti_kuan_yin.jpg",
    "description": "Ti Kuan Yin (also spelled Tieguanyin) is a legendary oolong tea from the Fujian province of China. It is one of China's most beloved oolongs and is extremely time-consuming to produce (well over a dozen distinct steps in the processing are observed). This loosely rolled, lightly oxidized or 'green' Fujian Ti Kuan Yin from our Masters Collection yields a pale golden cup with a soft, buttery texture and orchid notes that linger and reveal a subtle complexity that will delight a fine palate. As the liquor cools, a sweet finish becomes apparent and offers faint hints of honeydew melon. We highly recommend multiple steepings to fully open the hand-rolled leaves of our premium Tieguanyin, whose character will seemingly evolve through three or more infusions.",
    "name": "fujian ti kuan yin",
    "score": 0,
    "thumbUrl": "/images5/products_index/fujian_ti_kuan_yin.jpg",
    "url": "/masters/fujian_ti_kuan_yin.html",
    "steepInfo": ""
  },
  {
    "category": "iced",
    "imageUrl": "/images5/products/gourmet_iced_tea_set.jpg",
    "description": "Savor the aroma and rich flavor of an iced tea made with fresh leaves, not powders or poor-quality tea bags. We make it easy. Simply <span style='font-weight:bold;'>place a quart-sized pouch in a pitcher of water and refrigerate overnight.<\/span> For quicker preparation, steep in hot water for five minutes and add ice. Made with tough borosilicate glass, our Glass Pitcher is able to go from boiling to freezing in seconds, making it the only vessel you'll need to brew and store iced tea in the refrigerator. The pitcher is 40 oz. (8.5\" tall and 3.75\" wide). Made in China. Microwave and dishwasher safe. <FONT STYLE=\"font-size:9pt;color:#993300\">The set includes pitcher and six quart-sized tea pouches. <i>Iced tea glasses sold separately.<\/i><\/FONT>",
    "name": "gourmet iced tea set",
    "score": 95,
    "thumbUrl": "/images5/products_index/gourmet_iced_tea_set.jpg",
    "url": "/iced/gourmet_iced_tea_set.html",
    "steepInfo": ""
  },
  {
    "category": "iced",
    "imageUrl": "/images5/products/peach_oolong.jpg",
    "description": "Full-leaf tea in pouches that make iced tea easy and delicious. Simply place overnight in a pitcher of water. Awake to find a tea rich in flavor and aroma, at a price that's a fraction of the supermarket-bought teas. For quicker preparation, steep in hot water for five minutes and add ice. Contains oolong tea from Taiwan with the summer flavor of perfectly ripened fruit. Be a peach and try this tea. Makes 40 ounces.",
    "name": "peach oolong iced pouch",
    "score": 97,
    "thumbUrl": "/images5/products_index/peach_oolong.jpg",
    "url": "/iced/peach_oolong_iced_pouch.html",
    "steepInfo": ""
  },
  {
    "category": "iced",
    "imageUrl": "",
    "description": "Full-leaf tea in pouches that make iced tea easy and delicious. Simply place overnight in a pitcher of water. Awake to find a tea rich in flavor and aroma, at a price that's a fraction of the supermarket-bought teas. For quicker preparation, steep in hot water for five minutes and add ice. Each pouch makes 40 ounces.  Try four teas that taste great iced, with two pouches each (eight total). This set includes (though subject to infrequent change):<br><br>",
    "name": "iced pouch sampler",
    "score": 93,
    "thumbUrl": "/images5/products_index/iced_pouch_sampler.jpg",
    "url": "/iced/iced_pouch_sampler.html",
    "steepInfo": ""
  },
  {
    "category": "iced",
    "imageUrl": "/images5/products/wild_strawberry.jpg",
    "description": "Premium herbal tea in cold-brew pouches. Simply place overnight in a pitcher of water. Awake to find a tea rich in flavor and aroma. For quicker preparation, steep in hot water for five minutes and add ice. Contains an herbal mixture of strawberries, apples, hibiscus flowers and rose hips.  Naturally caffeine-free, perfect anytime of day. Makes 40 ounces.",
    "name": "wild strawberry iced pouch",
    "score": 96,
    "thumbUrl": "/images5/products_index/wild_strawberry.jpg",
    "url": "/iced/wild_strawberry_iced_pouch.html",
    "steepInfo": ""
  },
  {
    "category": "iced",
    "imageUrl": "/images5/products/berry_blast.jpg",
    "description": "Premium herbal tea in cold-brew pouches. Simply place overnight in a pitcher of water. Awake to find a tea rich in flavor and aroma. For quicker preparation, steep in hot water for five minutes and add ice. Contains an herbal mixture of black currants, cranberries, raspberries, elderberries, bilberries, hibiscus flowers and rose hip.  Naturally caffeine-free, perfect anytime of day. Makes 40 ounces.",
    "name": "berry blast iced pouch",
    "score": 98,
    "thumbUrl": "/images5/products_index/berry_blast.jpg",
    "url": "/iced/berry_blast_iced_pouch.html",
    "steepInfo": ""
  },
  {
    "category": "iced",
    "imageUrl": "/images5/products/blood_orange.jpg",
    "description": "Premium herbal tea in cold-brew pouches. Simply place overnight in a pitcher of water. Awake to find a tea rich in flavor and aroma, at a price that's a fraction of the supermarket-bought teas. For quicker preparation, steep in hot water for five minutes and add ice. Contains an herbal mixture of blood orange peels, hibiscus flowers and rose hips.  Naturally caffeine-free, perfect anytime of day. Makes 40 ounces.",
    "name": "blood orange iced pouch",
    "score": 96,
    "thumbUrl": "/images5/products_index/blood_orange.jpg",
    "url": "/iced/blood_orange_iced_pouch.html",
    "steepInfo": ""
  },
  {
    "category": "iced",
    "imageUrl": "/images5/products/white_peach.jpg",
    "description": "Full-leaf white tea in cold-brew pouches. Simply place overnight in a pitcher of water. Awake to find a tea rich in flavor and aroma, at a price that's a fraction of the supermarket-bought teas. For quicker preparation, steep in hot water for five minutes and add ice. Contains white tea from China with the delicate flavor of ripe peaches. Juicy flavor with dry peach fuzz finish. Makes 40 ounces.",
    "name": "white peach iced pouch",
    "score": 95,
    "thumbUrl": "/images5/products_index/white_peach.jpg",
    "url": "/iced/white_peach_iced_pouch.html",
    "steepInfo": ""
  },
  {
    "category": "iced",
    "imageUrl": "/images5/products/yunnan_noir.jpg",
    "description": "Full-leaf black tea in cold-brew pouches. Simply place overnight in a pitcher of water. Awake to find a tea rich in flavor and aroma, at a price that's a fraction of the supermarket-bought teas. For quicker preparation, steep in hot water for five minutes and add ice. Contains black tea from the Yunnan province of China, offering a tremendous depth of flavor, with honey and spice aroma. Makes 40 ounces.",
    "name": "yunnan noir iced pouch",
    "score": 99,
    "thumbUrl": "/images5/products_index/yunnan_noir.jpg",
    "url": "/iced/yunnan_noir_iced_pouch.html",
    "steepInfo": ""
  },
  {
    "category": "iced",
    "imageUrl": "/images5/products/earl_grey_moonlight.jpg",
    "description": "Premium black tea in cold-brew pouches. Simply place overnight in a pitcher of water. Awake to find a tea rich in flavor and aroma. For quicker preparation, steep in hot water for five minutes and add ice. Contains black tea from Sri Lanka, flavored with vanilla and bergamot (a citrus fruit). The flavors of vanilla and cream combine to soften the citrus notes of a traditional Earl Grey. Makes 40 ounces.",
    "name": "e.g. moonlight iced pouch",
    "score": 97,
    "thumbUrl": "/images5/products_index/earl_grey_moonlight.jpg",
    "url": "/iced/earl_grey_moonlight_iced_pouch.html",
    "steepInfo": ""
  },
  {
    "category": "iced",
    "imageUrl": "/images5/products/darjeeling_no22.jpg",
    "description": "Full-leaf black tea in cold-brew pouches. Simply place overnight in a pitcher of water. Awake to find a tea rich in flavor and aroma, at a price that's a fraction of the supermarket-bought teas. For quicker preparation, steep in hot water for five minutes and add ice. Contains black tea from from the famous Darjeeling region of India, treasured for its rich golden liquor and distinctive muscatel (type of grape) flavor. Makes 40 ounces.",
    "name": "darjeeling sungma summer iced pouch",
    "score": 93,
    "thumbUrl": "/images5/products_index/darjeeling_no22.jpg",
    "url": "/iced/darjeeling_sungma_summer_iced_pouch.html",
    "steepInfo": ""
  },
  {
    "category": "iced",
    "imageUrl": "/images5/products/ceylon_sonata.jpg",
    "description": "Premium black tea in cold-brew pouches. Simply place overnight in a pitcher of water. Awake to find a tea rich in flavor and aroma, at a price that's a fraction of the supermarket-bought teas. For quicker preparation, steep in hot water for five minutes and add ice. Contains black tea from Sri Lanka, bright and lively, with a classic iced tea flavor and aroma. Makes 40 ounces.",
    "name": "ceylon sonata iced pouch",
    "score": 95,
    "thumbUrl": "/images5/products_index/ceylon_sonata.jpg",
    "url": "/iced/ceylon_sonata_iced_pouch.html",
    "steepInfo": ""
  },
  {
    "category": "iced",
    "imageUrl": "/images5/products/apricot_green.jpg",
    "description": "Full-leaf green tea in cold-brew pouches. <span style=\"font-weight:bold;\">Simply place overnight in a pitcher of water<\/span>. Awake to find a tea rich in flavor and aroma, at a price that's a fraction of the supermarket-bought teas. For quicker preparation, steep in hot water for five minutes and add ice. Contains green tea from China with the delicate flavor of summer apricots. Floral aroma and succulent texture. Makes 40 ounces.",
    "name": "apricot green iced pouch",
    "score": 93,
    "thumbUrl": "/images5/products_index/apricot_green.jpg",
    "url": "/iced/apricot_green_iced_pouch.html",
    "steepInfo": ""
  },
  {
    "category": "iced",
    "imageUrl": "/images5/products/mango.jpg",
    "description": "Full-leaf black tea in cold-brew pouches. Simply place overnight in a pitcher of water. Awake to find a tea rich in flavor and aroma, at a price that's a fraction of the supermarket-bought teas. For quicker preparation, steep in hot water for five minutes and add ice. Contains black tea from Sri Lanka with the tropical flavor of perfectly ripened mangoes. An ideal afternoon tea. Makes 40 ounces.",
    "name": "mango iced pouch",
    "score": 95,
    "thumbUrl": "/images5/products_index/mango.jpg",
    "url": "/iced/mango_iced_pouch.html",
    "steepInfo": ""
  },
  {
    "category": "iced",
    "imageUrl": "/images5/products/citron_green.jpg",
    "description": "Full-leaf green tea in cold-brew pouches. Simply place overnight in a pitcher of water. Awake to find a tea rich in flavor and aroma, at a price that's a fraction of the supermarket-bought teas. For quicker preparation, steep in hot water for five minutes and add ice. Contains green tea from China with the citrus crispness of lemon and lime. Not too dry or too citrusy. Makes 40 ounces.",
    "name": "citron green iced pouch",
    "score": 95,
    "thumbUrl": "/images5/products_index/citron_green.jpg",
    "url": "/iced/citron_green_iced_pouch.html",
    "steepInfo": ""
  },
  {
    "category": "iced",
    "imageUrl": "/images5/products/thai_chai.jpg",
    "description": "Full-leaf black tea in cold-brew pouches. Simply place overnight in a pitcher of water. Awake to find a tea rich in flavor and aroma, at a price that's a fraction of the supermarket-bought teas. For quicker preparation, steep in hot water for five minutes and add ice. Combines black tea from Sri Lanka with spices, sweet coconut and floral lemongrass. Makes 40 ounces.",
    "name": "thai chai iced pouch",
    "score": 95,
    "thumbUrl": "/images5/products_index/thai_chai.jpg",
    "url": "/iced/thai_chai_iced_pouch.html",
    "steepInfo": ""
  },
  {
    "category": "iced",
    "imageUrl": "/images5/products/irish_breakfast.jpg",
    "description": "Full-leaf black tea in cold-brew pouches. Simply place overnight in a pitcher of water. Awake to find a tea rich in flavor and aroma, at a price that's a fraction of the supermarket-bought teas. For quicker preparation, steep in hot water for five minutes and add ice. Combines the citrusy notes of a high-grown Ceylon with the malty underscore of a pungent Assam tea. Makes 40 ounces.",
    "name": "irish breakfast iced pouch",
    "score": 95,
    "thumbUrl": "/images5/products_index/irish_breakfast.jpg",
    "url": "/iced/irish_breakfast_iced_pouch.html",
    "steepInfo": ""
  },
  {
    "category": "iced",
    "imageUrl": "/images5/products/coconut.jpg",
    "description": "Full-leaf black tea in cold-brew pouches. Simply place overnight in a pitcher of water. Awake to find a tea rich in flavor and aroma, at a price that's a fraction of the supermarket-bought teas. For quicker preparation, steep in hot water for five minutes and add ice. Contains black tea from Sri Lanka with the sweet and savory taste of coconut. An ideal afternoon tea. Makes 40 ounces.",
    "name": "coconut iced pouch",
    "score": 91,
    "thumbUrl": "/images5/products_index/coconut.jpg",
    "url": "/iced/coconut_iced_pouch.html",
    "steepInfo": ""
  },
  {
    "category": "iced",
    "imageUrl": "/images5/products/assam_melody.jpg",
    "description": "Full-leaf black tea in cold-brew pouches. Simply place overnight in a pitcher of water. Awake to find a tea rich in flavor and aroma, at a price that's a fraction of the supermarket-bought teas. For quicker preparation, steep in hot water for five minutes and add ice. Contains bold black tea from the Assam region of India, known for a deep, burgundy-red cup and pungent flavor. Makes 40 ounces.",
    "name": "assam melody iced pouch",
    "score": 99,
    "thumbUrl": "/images5/products_index/assam_melody.jpg",
    "url": "/iced/assam_melody_iced_pouch.html",
    "steepInfo": ""
  },
  {
    "category": "iced",
    "imageUrl": "/images5/products/english_breakfast.jpg",
    "description": "Full-leaf black tea in cold-brew pouches. Simply place overnight in a pitcher of water. Awake to find a tea rich in flavor and aroma, at a price that's a fraction of the supermarket-bought teas. For quicker preparation, steep in hot water for five minutes and add ice. Contains black Keemun tea from Anhui province in China, prized for its rich, slightly smoky flavor and perfectly 'on point' astringency. Makes 40 ounces.",
    "name": "english breakfast iced pouch",
    "score": 90,
    "thumbUrl": "/images5/products_index/english_breakfast.jpg",
    "url": "/iced/english_breakfast_iced_pouch.html",
    "steepInfo": ""
  },
  {
    "category": "iced",
    "imageUrl": "/images5/products/rooibos_vanilla.jpg",
    "description": "Full-leaf tea in pouches that make iced tea easy and delicious. Simply place overnight in a pitcher of water. Awake to find a tea rich in flavor and aroma, at a price that's a fraction of the supermarket-bought teas. For quicker preparation, steep in hot water for five minutes and add ice. Contains herbal tea from South Africa with the delectable flavor of sweet vanilla beans. Naturally caffeine-free, perfect anytime of day. Makes 40 ounces.",
    "name": "rooibos vanilla iced pouch",
    "score": 92,
    "thumbUrl": "/images5/products_index/rooibos_vanilla.jpg",
    "url": "/iced/rooibos_vanilla_iced_pouch.html",
    "steepInfo": ""
  },
  {
    "category": "iced",
    "imageUrl": "/images5/products/cream.jpg",
    "description": "Full-leaf black tea in cold-brew pouches. Simply place overnight in a pitcher of water. Awake to find a tea rich in flavor and aroma, at a price that's a fraction of the supermarket-bought teas. For quicker preparation, steep in hot water for five minutes and add ice. Contains black tea from Sri Lanka with the flavor of dairy-free cream. A dreamy afternoon tea. Makes 40 ounces.",
    "name": "cream iced pouch",
    "score": 97,
    "thumbUrl": "/images5/products_index/cream.jpg",
    "url": "/iced/cream_iced_pouch.html",
    "steepInfo": ""
  },
  {
    "category": "iced",
    "imageUrl": "/images5/products/spiced_apple_chai.jpg",
    "description": "Full-leaf black tea in cold-brew pouches. Simply place overnight in a pitcher of water. Awake to find a tea rich in flavor and aroma, at a price that's a fraction of the supermarket-bought teas. For quicker preparation, steep in hot water for five minutes and add ice. Combines black tea from Sri Lanka with apples and exotic spices. Juicy and pleasantly sweet. Makes 40 ounces.",
    "name": "spiced apple chai iced pouch",
    "score": 92,
    "thumbUrl": "/images5/products_index/spiced_apple_chai.jpg",
    "url": "/iced/spiced_apple_chai_iced_pouch.html",
    "steepInfo": ""
  },
  {
    "category": "iced",
    "imageUrl": "/images5/products/rooibos_vanilla_chai.jpg",
    "description": "Full-leaf tea in pouches that make iced tea easy and delicious. Simply place overnight in a pitcher of water. Awake to find a tea rich in flavor and aroma, at a price that's a fraction of the supermarket-bought teas. For quicker preparation, steep in hot water for five minutes and add ice. Contains herbal tea from South Africa with spices reminiscent of a Masala chai. Naturally caffeine-free, perfect anytime of day. Makes 40 ounces.",
    "name": "rooibos vanilla chai iced pouch",
    "score": 80,
    "thumbUrl": "/images5/products_index/rooibos_vanilla_chai.jpg",
    "url": "/iced/rooibos_vanilla_chai_iced_pouch.html",
    "steepInfo": ""
  },
  {
    "category": "iced",
    "imageUrl": "/images5/products/vanilla.jpg",
    "description": "Full-leaf black tea in cold-brew pouches. Simply place overnight in a pitcher of water. Awake to find a tea rich in flavor and aroma, at a price that's a fraction of the supermarket-bought teas. For quicker preparation, steep in hot water for five minutes and add ice. Contains black tea from Sri Lanka with vanilla's rich, warm, sugary aroma. A perfect afternoon tea. Makes 40 ounces.",
    "name": "vanilla iced pouch",
    "score": 95,
    "thumbUrl": "/images5/products_index/vanilla.jpg",
    "url": "/iced/vanilla_iced_pouch.html",
    "steepInfo": ""
  },
  {
    "category": "iced",
    "imageUrl": "/images5/products/peppermint.jpg",
    "description": "Premium herbal tea in cold-brew pouches. Simply place overnight in a pitcher of water. Awake to find a tea rich in flavor and aroma, at a price that's a fraction of the supermarket-bought teas. For quicker preparation, steep in hot water for five minutes and add ice. Contains premium peppermint leaves from Oregon, USA. Naturally caffeine-free, perfect anytime of day. Makes 40 ounces.",
    "name": "peppermint iced pouch",
    "score": 96,
    "thumbUrl": "/images5/products_index/peppermint.jpg",
    "url": "/iced/peppermint_iced_pouch.html",
    "steepInfo": ""
  },
  {
    "category": "iced",
    "imageUrl": "/images5/products/golden_monkey.jpg",
    "description": "Full-leaf black tea in cold-brew pouches. Simply place overnight in a pitcher of water. Awake to find a tea rich in flavor and aroma, at a price that's a fraction of the supermarket-bought teas. For quicker preparation, steep in hot water for five minutes and add ice. Contains a hand-processed tea from the Fujian province of China, with taste reminiscent of roasted apples, palm sugar, walnut, cocoa, rye and spice. Makes 40 ounces.",
    "name": "golden monkey iced pouch",
    "score": 90,
    "thumbUrl": "/images5/products_index/golden_monkey.jpg",
    "url": "/iced/golden_monkey_iced_pouch.html",
    "steepInfo": ""
  },
  {
    "category": "iced",
    "imageUrl": "/images5/products/rooibos.jpg",
    "description": "Full-leaf tea in pouches that make iced tea easy and delicious. Simply place overnight in a pitcher of water. Awake to find a tea rich in flavor and aroma, at a price that's a fraction of the supermarket-bought teas. For quicker preparation, steep in hot water for five minutes and add ice. Contains herbal tea from South Africa, colloquially known as 'Red Tea'. Naturally caffeine-free, perfect anytime of day. Makes 40 ounces.",
    "name": "rooibos iced pouch",
    "score": 99,
    "thumbUrl": "/images5/products_index/rooibos.jpg",
    "url": "/iced/rooibos_iced_pouch.html",
    "steepInfo": ""
  },
  {
    "category": "iced",
    "imageUrl": "/images5/products/yunnan_jig.jpg",
    "description": "Full-leaf black tea in cold-brew pouches. Simply place overnight in a pitcher of water. Awake to find a tea rich in flavor and aroma, at a price that's a fraction of the supermarket-bought teas. For quicker preparation, steep in hot water for five minutes and add ice. Contains black tea from the Yunnan province of China, famous for its savory cocoa and black pepper flavors. Makes 40 ounces.",
    "name": "yunnan jig iced pouch",
    "score": 95,
    "thumbUrl": "/images5/products_index/yunnan_jig.jpg",
    "url": "/iced/yunnan_jig_iced_pouch.html",
    "steepInfo": ""
  },
  {
    "category": "iced",
    "imageUrl": "/images5/products/white_blueberry.jpg",
    "description": "Full-leaf white tea in cold-brew pouches. Simply place overnight in a pitcher of water. Awake to find a tea rich in flavor and aroma, at a price that's a fraction of the supermarket-bought teas. For quicker preparation, steep in hot water for five minutes and add ice. Contains white tea from China with the juicy flavor of ripe blueberries. Fragrant and refreshing. Makes 40 ounces.",
    "name": "white blueberry iced pouch",
    "score": 95,
    "thumbUrl": "/images5/products_index/white_blueberry.jpg",
    "url": "/iced/white_blueberry_iced_pouch.html",
    "steepInfo": ""
  },
  {
    "category": "iced",
    "imageUrl": "/images5/products/peach.jpg",
    "description": "Full-leaf black tea in cold-brew pouches. Simply place overnight in a pitcher of water. Awake to find a tea rich in flavor and aroma, at a price that's a fraction of the supermarket-bought teas. For quicker preparation, steep in hot water for five minutes and add ice. Contains black tea from Sri Lanka with the summer flavor of perfectly ripened peaches. An ideal afternoon tea. Makes 40 ounces.",
    "name": "peach iced pouch",
    "score": 93,
    "thumbUrl": "/images5/products_index/peach.jpg",
    "url": "/iced/peach_iced_pouch.html",
    "steepInfo": ""
  },
  {
    "category": "iced",
    "imageUrl": "/images5/products/masala_chai.jpg",
    "description": "Full-leaf black tea in cold-brew pouches. Simply place overnight in a pitcher of water. Awake to find a tea rich in flavor and aroma, at a price that's a fraction of the supermarket-bought teas. For quicker preparation, steep in hot water for five minutes and add ice. Combines black tea from Sri Lanka with spicy cinnamon, cardamom and ginger to produce a fragrant, zesty flavor. Makes 40 ounces.",
    "name": "masala chai iced pouch",
    "score": 90,
    "thumbUrl": "/images5/products_index/masala_chai.jpg",
    "url": "/iced/masala_chai_iced_pouch.html",
    "steepInfo": ""
  },
  {
    "category": "iced",
    "imageUrl": "/images5/products/green_rooibos_bonita.jpg",
    "description": "Full-leaf herbal tea in pouches that make iced tea easy and delicious. Simply place overnight in a pitcher of water. Awake to find a tea rich in flavor and aroma, at a price that's a fraction of the supermarket-bought teas. For quicker preparation, steep in hot water for five minutes and add ice. Combines green Rooibos with peaches, strawberries and citrus. Naturally caffeine-free, perfect anytime of day. Makes 40 ounces.",
    "name": "green rooibos bonita iced pouch",
    "score": 88,
    "thumbUrl": "/images5/products_index/green_rooibos_bonita.jpg",
    "url": "/iced/green_rooibos_bonita_iced_pouch.html",
    "steepInfo": ""
  },
  {
    "category": "iced",
    "imageUrl": "/images5/products/mango_green.jpg",
    "description": "Full-leaf green tea in cold-brew pouches. Simply place overnight in a pitcher of water. Awake to find a tea rich in flavor and aroma, at a price that's a fraction of the supermarket-bought teas. For quicker preparation, steep in hot water for five minutes and add ice. Contains green tea from China with the flavor of perfectly ripened mangoes. Fragrant and refreshing. Makes 40 ounces.",
    "name": "mango green iced pouch",
    "score": 96,
    "thumbUrl": "/images5/products_index/mango_green.jpg",
    "url": "/iced/mango_green_iced_pouch.html",
    "steepInfo": ""
  },
  {
    "category": "iced",
    "imageUrl": "/images5/products/pu_erh_hazelberry.jpg",
    "description": "Earthy black tea in cold-brew pouches. Simply place overnight in a pitcher of water. Awake to find a tea rich in flavor and aroma, at a price that's a fraction of the supermarket-bought teas. For quicker preparation, steep in hot water for five minutes and add ice. Combines Pu Erh, a black tea from the Yunnan province of China, with the rich flavor of hazelnut and strawberries. Makes 40 ounces.",
    "name": "pu erh hazelberry iced pouch",
    "score": 88,
    "thumbUrl": "/images5/products_index/pu_erh_hazelberry.jpg",
    "url": "/iced/pu_erh_hazelberry_iced_pouch.html",
    "steepInfo": ""
  },
  {
    "category": "iced",
    "imageUrl": "/images5/products/lapsang_souchong.jpg",
    "description": "Smoky black tea in cold-brew pouches. Simply place overnight in a pitcher of water. Awake to find a tea rich in flavor and aroma, at a price that's a fraction of the supermarket-bought teas. For quicker preparation, steep in hot water for five minutes and add ice. Contains Lapsang Souchong, a black tea from the Fujian province of China, famous for its smoky aroma and flavor. Makes 40 ounces.",
    "name": "lapsang souchong iced pouch",
    "score": 70,
    "thumbUrl": "/images5/products_index/lapsang_souchong.jpg",
    "url": "/iced/lapsang_souchong_iced_pouch.html",
    "steepInfo": ""
  },
  {
    "category": "iced",
    "imageUrl": "/images5/products/jade_oolong.jpg",
    "description": "Full-leaf oolong tea in cold-brew pouches. Simply place overnight in a pitcher of water. Awake to find a tea rich in flavor and aroma, at a price that's a fraction of the supermarket-bought teas. For quicker preparation, steep in hot water for five minutes and add ice. Contains Jade Oolong tea from Nantou county, Taiwan, prized for its floral aroma and sweet flavor. A superb tea. Makes 40 ounces.",
    "name": "jade oolong iced pouch",
    "score": 94,
    "thumbUrl": "/images5/products_index/jade_oolong.jpg",
    "url": "/iced/jade_oolong_iced_pouch.html",
    "steepInfo": ""
  },
  {
    "category": "iced",
    "imageUrl": "/images5/products/earl_grey_bravo.jpg",
    "description": "Premium black tea in cold-brew pouches. Simply place overnight in a pitcher of water. Awake to find a tea rich in flavor and aroma, at a price that's a fraction of the supermarket-bought teas. For quicker preparation, steep in hot water for five minutes and add ice. Contains black tea from Sri Lanka, flavored with bergamot (a citrus fruit). Makes a perfect afternoon tea, with zesty aroma and a balanced orange flavor. Makes 40 ounces.",
    "name": "earl grey iced pouch",
    "score": 97,
    "thumbUrl": "/images5/products_index/earl_grey_bravo.jpg",
    "url": "/iced/earl_grey_bravo_iced_pouch.html",
    "steepInfo": ""
  },
  {
    "category": "iced",
    "imageUrl": "/images5/products/chamomile.jpg",
    "description": "Premium herbal tea in cold-brew pouches. Simply place overnight in a pitcher of water. Awake to find a tea rich in flavor and aroma, at a price that's a fraction of the supermarket-bought teas. For quicker preparation, steep in hot water for five minutes and add ice. Contains the finest chamomile flowers from Egypt's Nile River Valley. Naturally caffeine-free, perfect anytime of day. Makes 40 ounces.",
    "name": "chamomile iced pouch",
    "score": 90,
    "thumbUrl": "/images5/products_index/chamomile.jpg",
    "url": "/iced/chamomile_iced_pouch.html",
    "steepInfo": ""
  },
  {
    "category": "teabags",
    "imageUrl": "/images5/products/jasmine_pearls_teabags.jpg",
    "description": "Oolong tea from the Fujian province of China infused with the delicate scent of the night-blooming jasmine flowers. If you enjoy jasmine tea, we urge you to try the sublime taste of its well-made varieties. Our 'Jasmine Suite no. 12' is an exotic Dragon Phoenix Pearl tea, comprised of intricate jasmine-infused pearls. Each pearl combines two delicate leaves and an unopened bud. When added to water, the pearls majestically unfurl, releasing their delicate scent and flavor. A spellbinding treat for all senses. While not cheap, this tea is well worth the experience. Full-leaf tea in portable, individually wrapped bags - superior taste and maximum convenience.",
    "name": "jasmine pearls",
    "score": 96,
    "thumbUrl": "/images5/products_index/jasmine_pearls_teabags.jpg",
    "url": "/teabags/jasmine_pearls.html",
    "steepInfo": ""
  },
  {
    "category": "teabags",
    "imageUrl": "/images5/products/fruit_sangria_teabags.jpg",
    "description": "Fruit Medley is a jammy sweet mix of strawberry, hibiscus flowers, apples, rose hips and lemongrass. Deep, rich fruity flavor, sweet-spicy aroma, full bodied and refreshing. Gentle herb notes help lighten up the fruitiness and give the cup some bounce. Completely caffeine free with no sugar or other sweeteners.",
    "name": "fruit sangria",
    "score": 97,
    "thumbUrl": "/images5/products_index/fruit_sangria_teabags.jpg",
    "url": "/teabags/fruit_sangria.html",
    "steepInfo": ""
  },
  {
    "category": "teabags",
    "imageUrl": "/images5/products/earl_grey_teabags.jpg",
    "description": "London Earl Grey is premium black tea from China flavored with oil of bergamot, a citrus fruit. According to legend, this tea is named for Earl Grey, a British Prime Minister, to whom a Chinese noble entrusted its secret recipe for saving his life. Unfortunately, this story is not true. But we hope this won't prevent you from enjoying our exquisite version of the popular Earl Grey tea. Full-leaf tea in portable, individually wrapped bags - superior taste and maximum convenience.",
    "name": "earl grey",
    "score": 97,
    "thumbUrl": "/images5/products_index/earl_grey_teabags.jpg",
    "url": "/teabags/earl_grey.html",
    "steepInfo": ""
  },
  {
    "category": "teabags",
    "imageUrl": "/images5/products/juicy_slices_teabags.jpg",
    "description": "Add the superior flavor of full-leaf tea to the convenience and portability you enjoy with ordinary tea bags. Our bags' pyramid shape provides ample room for the expansion of the large leaves that characterize gourmet tea, resulting in better infusion and superior flavor. Try an assortment of our teas to see the flavor you're now missing. Includes nine gourmet tea varieties (though subject to infrequent change), 18 bags total.",
    "name": "juicy slices",
    "score": 97,
    "thumbUrl": "/images5/products_index/juicy_slices_teabags.jpg",
    "url": "/teabags/juicy_slices.html",
    "steepInfo": ""
  },
  {
    "category": "teabags",
    "imageUrl": "/images5/products/english_breakfast_teabags.jpg",
    "description": "The original, classic cup of English Breakfast was made with black Keemun tea from Anhui province in China. Across many generations, plenty of different interpretations have been made. Our English Breakfast stays close to the classic. Made from fine quality Keemun, prized for its rich, slightly smoky flavor and perfectly 'on point' astringency. Balanced, very honeyed aroma. May be enjoyed plain or with a drop of milk. English Breakfast remains one of Adagio's most popular varieties.",
    "name": "english breakfast",
    "score": 94,
    "thumbUrl": "/images5/products_index/english_breakfast_teabags.jpg",
    "url": "/teabags/english_breakfast.html",
    "steepInfo": ""
  },
  {
    "category": "teabags",
    "imageUrl": "/images5/products/peppermint_teabags.jpg",
    "description": "A native of the Mediterranean, peppermint leaves were often used to crown luminaries in ancient Greece and Rome. It continues to be revered for its cooling, crisp aroma, deeply refreshing flavor and smooth finish. If you have yet to try gourmet peppermint tea, made from just pure peppermint (no added oils or sweeteners), you'll be pleasantly surprised by its superior flavor.",
    "name": "peppermint",
    "score": 96,
    "thumbUrl": "/images5/products_index/peppermint_teabags.jpg",
    "url": "/teabags/peppermint.html",
    "steepInfo": ""
  },
  {
    "category": "teabags",
    "imageUrl": "/images5/products/citrus_green_teabags.jpg",
    "description": "Green tea from China with the delicate flavors of lemon and lime. A happy marriage of great taste and proven health benefits. Just the right touch of citrus flavors to liven up the cup. Makes a light and refreshing drink that's popular both hot and iced. If you are new to green tea, this lightly flavored tea may be a good place to start. Full-leaf tea in portable, individually wrapped bags - superior taste and maximum convenience.",
    "name": "citrus green",
    "score": 95,
    "thumbUrl": "/images5/products_index/citrus_green_teabags.jpg",
    "url": "/teabags/citrus_green.html",
    "steepInfo": ""
  },
  {
    "category": "teabags",
    "imageUrl": "/images5/products/display_rack.jpg",
    "description": "Display your teas beautifully with this free chrome-plated wire rack. The rack is offered complimentary with a purchase of six unique tea boxes. Please select a Flavors or Premium assortments:<br><br>",
    "name": "display rack",
    "score": 92,
    "thumbUrl": "/images5/products_index/display_rack.jpg",
    "url": "/teabags/display_rack.html",
    "steepInfo": ""
  },
  {
    "category": "teabags",
    "imageUrl": "/images5/products/masala_chai_teabags.jpg",
    "description": "In Indian culture, 'Masala' means 'a blend of spices', and 'chai' simply means 'tea.' So, Masala Chai is literally 'spiced tea.' Our take on this treasured Indian drink combines premium Ceylon black tea with warming cinnamon, cardamom and ginger. Warm and inviting fragrance, zesty flavor (without being too hot or spicy) and invigorating, aromatic finish. We suggest two heaping teaspoons per 8 oz cup, boiling water for 7-10 minutes. Sugar, cream or soy if desired.",
    "name": "masala chai",
    "score": 95,
    "thumbUrl": "/images5/products_index/masala_chai_teabags.jpg",
    "url": "/teabags/masala_chai.html",
    "steepInfo": ""
  },
  {
    "category": "teabags",
    "imageUrl": "/images5/products/vanilla_rooibos_teabags.jpg",
    "description": "According to the International Ice Cream Association, Vanilla is by far the most popular flavor, getting a full 23% of all ice cream consumption. Inspired by this love, Adagio has created Rooibos Vanilla, combining rich, warm dark sugar aroma of vanilla with mellow and grounding rooibos herb from South Africa. Soothing, sweet and very 'beany' vanilla fragrance (like warm sugar cookies made with fresh vanilla beans). Slight fruit juiciness from the rooibos, melting texture and comforting flavor. Naturally caffeine free! Full-leaf tea in portable, individually wrapped bags - superior taste and maximum convenience. 15 teabags per box.",
    "name": "vanilla rooibos",
    "score": 97,
    "thumbUrl": "/images5/products_index/vanilla_rooibos_teabags.jpg",
    "url": "/teabags/vanilla_rooibos.html",
    "steepInfo": ""
  },
  {
    "category": "teabags",
    "imageUrl": "/images5/products/foxtrot_teabags.jpg",
    "description": "Like the dance that inspired its name, our Foxtrot tea is an overnight success that will leave you giddy with joy. It is an herbal cocktail of Egyptian chamomile, South African rooibos (with a touch of vanilla) and fresh peppermint. A soothing blend of familiar tastes that produces a pleasantly original combination. It's entirely caffeine-free, but you'll still have a spring in your step from the delightful, delicately clean and sweet flavor.",
    "name": "foxtrot",
    "score": 94,
    "thumbUrl": "/images5/products_index/foxtrot_teabags.jpg",
    "url": "/teabags/foxtrot.html",
    "steepInfo": ""
  },
  {
    "category": "teabags",
    "imageUrl": "/images5/products/blueberry_white_teabags.jpg",
    "description": "This tea blends together the taste of juicy blueberries with premium white tea from Fujian province, China. Very fragrant, like freshly harvested 'highbush' blueberries (the aromatic variety). Soft, rounded mouthfeel with a clean, refreshing finish. A customer favorite, this tea is delectable both hot and cold. Full-leaf tea in portable, individually wrapped bags - superior taste and maximum convenience. 15 teabags per box.",
    "name": "blueberry white",
    "score": 97,
    "thumbUrl": "/images5/products_index/blueberry_white_teabags.jpg",
    "url": "/teabags/blueberry_white.html",
    "steepInfo": ""
  },
  {
    "category": "teabags",
    "imageUrl": "/images5/products/silver_needle_teabags.jpg",
    "description": "White tea from China. Silver Needle is among the most revered of Chinese teas, produced in the Fuding and Zhenhe districts of its Fujian province. Gathered only in the few days of early spring, the preparation of this tea is governed by strict requirements to ensure a premium product. This dedication to perfection is evident in the cup, which is sweet and delicate with a clean, airy fragrance. Our 'Sublime Needle' is a Special Grade (Bai Hao) version of this exquisite tea. Full-leaf tea in portable, individually wrapped bags - superior taste and maximum convenience.",
    "name": "silver needle",
    "score": 94,
    "thumbUrl": "/images5/products_index/silver_needle_teabags.jpg",
    "url": "/teabags/silver_needle.html",
    "steepInfo": ""
  },
  {
    "category": "teabags",
    "imageUrl": "/images5/products/green_popcorn_teabags.jpg",
    "description": "Classic Japanese green tea, blended with toasted, popped rice. Originally created to stretch short supplies of tea, now enjoyed by tea lovers here and abroad. Warm and nutty with a lovely savory quality. A hearty cup of tea and truly satisfying. A great green tea for someone seeking a substantial, but less astringent, flavor from their cup.",
    "name": "green popcorn",
    "score": 89,
    "thumbUrl": "/images5/products_index/green_popcorn_teabags.jpg",
    "url": "/teabags/green_popcorn.html",
    "steepInfo": ""
  },
  {
    "category": "teabags",
    "imageUrl": "/images5/products/peach_oolong_teabags.jpg",
    "description": "Imagine being whisked away to an bright, fresh peach orchard... That's the sensation you'll get with your first sip of our delectable Peach tea. Combining the sweet flavor of ripe summer peaches with the delectable taste of Taiwanese oolong tea, you can experience it year-round. Full-leaf tea in portable, individually wrapped bags - superior taste and maximum convenience.",
    "name": "peach oolong",
    "score": 99,
    "thumbUrl": "/images5/products_index/peach_oolong_teabags.jpg",
    "url": "/teabags/peach_oolong.html",
    "steepInfo": ""
  },
  {
    "category": "teabags",
    "imageUrl": "/images5/products/wuyi_oolong_teabags.jpg",
    "description": "Oolong tea from the Wuyi mountains in the Fujian province of China. Wuyi Oolong grows defiantly in the gaps of the mountainous rock, rendering cultivation both arduous and spellbindingly beautiful. This tea is famous for its 'dragonfly's head, frog's limbs and three colors.' The latter refers to the green, red and brown colors found in the cross-section of each leaf. Similar to other fine oolong teas, our 'Wuyi Ensemble' may be infused a number of times, with each infusion revealing a new nuance of this tea's complex flavor. Full-leaf tea in portable, individually wrapped bags - superior taste and maximum convenience.",
    "name": "wuyi oolong",
    "score": 93,
    "thumbUrl": "/images5/products_index/wuyi_oolong_teabags.jpg",
    "url": "/teabags/wuyi_oolong.html",
    "steepInfo": ""
  },
  {
    "category": "teabags",
    "imageUrl": "/images5/products/dragonwell_teabags.jpg",
    "description": "Green tea from the Chinese village of Dragon Well (Lung Ching in local parlance). Dragon Well tea has a distinguished shape. Its leaves are broad and flat, a result of laborious drying. There is something to show for this hard work: Dragon Well tea is refreshingly smooth, sweet and delicate, among the very best of Chinese greens. Our 'Dragon Well Requiem' is a First Grade version of this truly sublime tea. Full-leaf tea in portable, individually wrapped bags - superior taste and maximum convenience.",
    "name": "dragonwell",
    "score": 96,
    "thumbUrl": "/images5/products_index/dragonwell_teabags.jpg",
    "url": "/teabags/dragonwell.html",
    "steepInfo": ""
  },
  {
    "category": "teabags",
    "imageUrl": "/images5/products/oolong_goddess_teabags.jpg",
    "description": "Oolong tea from the Fujian province of China. In Mandarin, Ti Kuan Yin means 'iron goddess of mercy,' a name derived from local legend. This tea is arguably the finest of Chinese oolongs, with competition-grade varieties selling for thousand of dollars a pound. Upon sampling dozens of samples, we have selected this tea as the finest we have seen this year. We hope you agree with our decision. And will give our exquisite 'Ti Kuan Yin Trio' a try. Full-leaf tea in portable, individually wrapped bags - superior taste and maximum convenience.",
    "name": "oolong goddess",
    "score": 95,
    "thumbUrl": "/images5/products_index/oolong_goddess_teabags.jpg",
    "url": "/teabags/ti_kuan_yin.html",
    "steepInfo": ""
  },
  {
    "category": "teabags",
    "imageUrl": "/images5/products/golden_yunnan_teabags.jpg",
    "description": "Black tea from the Yunnan region of China. Yunnan tea is easily identified by its luscious soft leaves, and a unique peppery taste. Our 'Yunnan Gold' as the name implies is an exceptional quality tea with beautiful gold-colored leaves and an abundance of rich peppery flavor. Allowed to take only one tea to a desert island, 'Yunnan Gold' would be our clear choice. Full-leaf tea in portable, individually wrapped bags - superior taste and maximum convenience.",
    "name": "golden yunnan",
    "score": 98,
    "thumbUrl": "/images5/products_index/golden_yunnan_teabags.jpg",
    "url": "/teabags/golden_yunnan.html",
    "steepInfo": ""
  },
  {
    "category": "teabags",
    "imageUrl": "/images5/products/gourmet_sips_teabags.jpg",
    "description": "Add the superior flavor of full-leaf tea to the convenience and portability you enjoy with ordinary tea bags. Our bags' pyramid shape provides ample room for the expansion of the large leaves that characterize gourmet tea, resulting in better infusion and superior flavor. Try an assortment of our teas to see the flavor you're now missing. Includes eight gourmet tea varieties, 16 bags total.",
    "name": "gourmet sips",
    "score": 94,
    "thumbUrl": "/images5/products_index/gourmet_sips_teabags.jpg",
    "url": "/teabags/gourmet_sips.html",
    "steepInfo": ""
  },
  {
    "category": "pantry",
    "imageUrl": "/images5/products/amber_sugar_crystals.jpg",
    "description": "An ideal tea sweetener, these crystals are sugar in its purest form. If you like your tea sweet, there's no better way to impart savory notes to your favorite cup. Adding a few sugar crystals will sweeten tea without distorting its flavor profile, pleasing both your sweet tooth and taste buds.",
    "name": "amber sugar crystals",
    "score": 94,
    "thumbUrl": "/images5/products_index/amber_sugar_crystals.jpg",
    "url": "/pantry/amber_sugar_crystals.html",
    "steepInfo": ""
  },
  {
    "category": "pantry",
    "imageUrl": "/images5/products/tea_cookies.jpg",
    "description": "These cookies will hit the spot - buttery and rich with a hint of tea flavor. These cookies also include real tea leaves, which adds to their unique flavor. Grab a bag and it'll be sure to become a hit at your next tea party or afternoon tea!",
    "name": "tea cookies",
    "score": 95,
    "thumbUrl": "/images5/products_index/tea_cookies.jpg",
    "url": "/pantry/tea_cookies.html",
    "steepInfo": ""
  },
  {
    "category": "pantry",
    "imageUrl": "/images5/products/tea_honey.jpg",
    "description": "Honey has long been a source for sweetening a variety of foods and beverages for over 10,000 years. The sweet nectar has also served as currency, used for medicinal purposes, and has been a symbol in many religious and cultural celebrations. We are pleased to be carrying Savannah Bee Company's Tea Honey. This is a perfect addition to make your cup of tea a little sweeter. Savannah Bee Company is a purveyor of gourmet honeys, collected from their own beehives and formulated to create this subtle honey that will not overpower but compliment tea. Glass bottles. Made in USA.",
    "name": "tea honey",
    "score": 95,
    "thumbUrl": "/images5/products_index/tea_honey.jpg",
    "url": "/pantry/tea_honey.html",
    "steepInfo": ""
  },
  {
    "category": "pantry",
    "imageUrl": "/images5/products/matcha_mints.jpg",
    "description": "Everything you love about a mint- with a matcha twist! Cool, tingly and refreshing to the tastebuds with a unique sweetness and matcha undertones.",
    "name": "matcha mints",
    "score": 94,
    "thumbUrl": "/images5/products_index/matcha_mints.jpg",
    "url": "/pantry/matcha_mints.html",
    "steepInfo": ""
  },
  {
    "category": "pantry",
    "imageUrl": "/images5/products/honey_crystals.jpg",
    "description": "Handling honey can create the legendary sticky situation with drips and spills adhering to every surface. With honey crystals, you can master this feat by keeping your tea space mess-free yet enjoying the deep sweetness of real honey. Honey Crystals are made from finely crystallized honey for the convenience of sugar but the richness of honey.",
    "name": "honey crystals",
    "score": 73,
    "thumbUrl": "/images5/products_index/honey_crystals.jpg",
    "url": "/pantry/honey_crystals.html",
    "steepInfo": ""
  },
  {
    "category": "pantry",
    "imageUrl": "/images5/products/matcha_fruit_mix.jpg",
    "description": "Nothing replaces a juicy piece of fresh fruit or hot cup of green tea, but trying to enjoy either of these while on-the-go can be a tricky task. Behold Matcha Fruit Mix - the perfect snack for traveling to work or school, or even a night in. Dried fruits sprinkled with green tea matcha. Natural, healthy and delicious.",
    "name": "matcha fruit mix",
    "score": 87,
    "thumbUrl": "/images5/products_index/matcha_fruit_mix.jpg",
    "url": "/pantry/matcha_fruit_mix.html",
    "steepInfo": ""
  },
  {
    "category": "pantry",
    "imageUrl": "/images5/products/white_sugar_crystals.jpg",
    "description": "An ideal tea sweetener, these crystals are sugar in its purest form. If you like your tea sweet, there's no better way to impart savory notes to your favorite cup. Adding a few sugar crystals will sweeten tea without distorting its flavor profile, pleasing both your sweet tooth and taste buds.",
    "name": "white sugar crystals",
    "score": 93,
    "thumbUrl": "/images5/products_index/white_sugar_crystals.jpg",
    "url": "/pantry/white_sugar_crystals.html",
    "steepInfo": ""
  },
  {
    "category": "pantry",
    "imageUrl": "/images5/products/tea_chocolates.jpg",
    "description": "Tea pairs so well with many different foods as an accompaniment but how about as ingredient? Here we fuse together two favorite worlds- tea and chocolate to create a rich and decadent treat. Try our tea-infused chocolates in a variety of flavors. You won't be able to have just one!",
    "name": "tea chocolate",
    "score": 0,
    "thumbUrl": "/images5/products_index/tea_chocolates.jpg",
    "url": "/pantry/tea_chocolates.html",
    "steepInfo": ""
  }
]